[
  {
    "daf": 2,
    "data": [
      {
        "id": 0,
        "title": "Krias Shema at Night",
        "paragraph": "The opening Mishna discusses the time to recite Krias Shema at night."
      },
      {
        "id": 1,
        "title": "Time Kohen Can Eat Terumah",
        "paragraph": "A Kohen who was a tevul yom (he was tamei and went to the mikvah earlier in the day) can begin to eat his terumah at tzais, and does not have to wait until the next day until after he brings a korban."
      },
      {
        "id": 2,
        "title": "Six Opinions For Earliest Time for Shema",
        "paragraph": "The Gemara introduces six opinions regarding the earliest time to recite Shema at night. One of them is when a poor person begins to eat his dinner."
      }
    ],
    "siman": {
      "title": "House",
      "paragraph": "A man rushes into his house exactly at Tzais to recite the evening Krias Shema so he can join the Kohen and poor person who just sat down in the dining room to eat their terumah and dinner respectively."
    }
  },
  {
    "daf": 3,
    "data": [
      {
        "id": 0,
        "title": "Three Heavenly Watches",
        "paragraph": "Rabbi Eliezer identifies the end time for Krias Shema as the end of the first mishmar (watch), to teach us that there are three heavenly watches in the evening when Hashem roars like a lion, lamenting that the sins of His children caused the destruction of the Beis HaMikdash and their exile."
      },
      {
        "id": 1,
        "title": "Entering a Ruin",
        "paragraph": "Three reasons one may not enter a churvah (ruin):a. suspicion of inappropriate behaviorb. the danger of collapsec. the danger of harmful mazikin found there"
      },
      {
        "id": 2,
        "title": "Dovid HaMelech’s Harp",
        "paragraph": "The northern wind would blow across Dovid Hamelech’s harp exactly at midnight, upon which he would wake up and sing Hashem’s praises for the rest of the night."
      }
    ],
    "siman": {
      "title": "Camel",
      "paragraph": "Three watchmen on camels enter a dangerous ruin when they hear music and discover a man playing harp."
    }
  },
  {
    "daf": 4,
    "data": [
      {
        "id": 0,
        "title": "כחצות",
        "paragraph": "Moshe said כחצות  instead of giving the exact time, so the Egyptians would not question Hashem’s precision when carrying out makos bechoros."
      },
      {
        "id": 1,
        "title": "סומך גאולה לתפילה בלילה",
        "paragraph": "There is a machlokes whether one is required to be סומך גאולה לתפילה at night. If it is required, השכיבנו is considered גאולה אריכתא."
      },
      {
        "id": 2,
        "title": "Ashrei 3x",
        "paragraph": "One who says Ashrei three times a day is guaranteed a place in Olam Haba because:  a. One is using all the letters in aleph-beis to praise Hashem. (Except the letter nun)  b. It includes the passuk of פותח את ידך"
      }
    ],
    "siman": {
      "title": "Door",
      "paragraph": "There was a massive door at the front of the shul that had a big clock and when the clock struck midnight it would flash Ashrei three times to remind the minyan to be סומך גאולה לתפילה at Maariv"
    }
  },
  {
    "daf": 5,
    "data": [
      {
        "id": 0,
        "title": "קריאת שמע על המטה",
        "paragraph": "One who recites קריאת שמע על המטה  is likened to one who holds a double-edged sword to slay mazikin."
      },
      {
        "id": 1,
        "title": "Three good gifts acquired through yisurin.",
        "paragraph": "In the midst of the sugya of yisurin, it is taught that HaKadosh Baruch Hu gave three good gifts to klal Yisroel which all have to be acquired through yisurin; Torah, Eretz Yisroel, and Olam Haba."
      },
      {
        "id": 2,
        "title": "Freeing oneself from one’s own prison.",
        "paragraph": "We learn that a person cannot free himself from his own prison from the fact that R’ Yochanan needed someone to heal him even though he had the capacity to heal others - אין חבוש מתיר עצמו מבית\" האסורים\"."
      }
    ],
    "siman": {
      "title": "Hay",
      "paragraph": "A sick person sitting up on a bed of hay saying קריאת שמע על המטה with one hand while holding a sword with the other is visited by a Rabbi holding three gifts who has come to heal him."
    }
  },
  {
    "daf": 6,
    "data": [
      {
        "id": 0,
        "title": "Makom Kavua",
        "paragraph": "One who has a set place for davening is considered a talmid of Avraham Avinu and will receive similar help from Hashem."
      },
      {
        "id": 1,
        "title": "Hashem’s Tefillin",
        "paragraph": "Hashem wears tefillin with parshios that proclaim the uniqueness of Klal Yisroel, such as מי כעמך...."
      },
      {
        "id": 2,
        "title": "Being misameach a chosson",
        "paragraph": "One who benefits from a wedding banquet without being משמח חתן violates five קולות. (קול ששון וקול שמחה...) If he does gladden the חתן, then he merits the Torah which was given with five “sounds”."
      }
    ],
    "siman": {
      "title": "Sword",
      "paragraph": "A person takes out a sword that was in his מקום קבוע next to a very special pair of tefillin and dances with it to be mesameach a chosson so he merits the Torah and not violate the five"
    }
  },
  {
    "daf": 7,
    "data": [
      {
        "id": 0,
        "title": "Bilaam knows moment Hashem gets angry",
        "paragraph": "Bilaam knew the exact moment when HaKadosh Baruch Hu gets angry everyday which lasts a רגע (a moment). Rabbi Yehoshua knew it was when the rooster’s comb turns pale and stands on one foot."
      },
      {
        "id": 1,
        "title": "Tzadik v’ra lo",
        "paragraph": "Moshe requested after the chet ha’egel to understand tzaddik v’ra lo v’rasha v’tov lo, why bad occurs to the righteous and why the evil often prosper."
      },
      {
        "id": 2,
        "title": "Greater is serving a Talmid Chochom than learning from him",
        "paragraph": "We learn from the fact that Elisha’s relationship to Eliyahu is characterized by his pouring water on his Rebbe’s hands that attending to a Talmid Chochom is greater than learning from him.- גדולה שמושה של תורה יותר מלמודה"
      }
    ],
    "siman": {
      "title": "Gun (כלי זיין)",
      "paragraph": "A rasha has his sniper gun poised over a rooster standing on one foot so he can calculate the right time to shoot a Tzadik off in the distance whose talmid is washing his Rebbe’s hands. (He misses)."
    }
  },
  {
    "daf": 8,
    "data": [
      {
        "id": 0,
        "title": "Tefillos that require a timely response",
        "paragraph": "Things that a person should daven for that require a timely response:a. a good wifeb. Torahc. an easy deathd. a buriale. a nearby bathroomThis is learned from the passuk, “על זאת יתפלל כל חסיד אליך לעת מצא”, “Regarding this let every devout man pray to You: at the time [needed] a finding.” (Psalms 32:6)"
      },
      {
        "id": 1,
        "title": "Hashem resides now in the 4 amos of Halacha.",
        "paragraph": "Since the time of the destruction of the Beis HaMikdash, Hashem only has the four amos of Halachah in His world. (מיום שחרב בית המקדש אין להקב'ה בעולמו אלא ארבע אמות של הלכה)"
      },
      {
        "id": 2,
        "title": "שנים מקרא ואחד תרגום",
        "paragraph": "One should always complete the weekly Parsha with the congregation reading שנים מקרא ואחד תרגום (reading twice in Hebrew and the Targum once). One who does so merits that his days and years are prolonged."
      }
    ],
    "siman": {
      "title": "Challah",
      "paragraph": "Bochurim are standing  around a massive four-amah-long segula challah and are inserting tefillos for a good shidduch written in both Hebrew and Aramaic."
    }
  },
  {
    "daf": 9,
    "data": [
      {
        "id": 0,
        "title": "Latest time to eat the Korban Pesach",
        "paragraph": "There is a machlokes whether the korban Pesach must be eaten before chatzos or until the morning. The machlokes is based on whether the time of haste, (שעת חפזון) that is mentioned with regards to the time of eating the Korban Pesach, is referring to the haste of the Egyptians to free bnei Yisroel, which occurred at night, or the haste of bnei Yisroel to leave, which was in the morning."
      },
      {
        "id": 1,
        "title": "Earliest time to recite Krias Shema in the morning",
        "paragraph": "The Mishnah discusses the proper time to recite Krias Shema in the morning; the Gemara concludes it is when one can recognize ((משיכיר a friend at a distance of four amos."
      },
      {
        "id": 2,
        "title": "Greeting a king",
        "paragraph": "One should always try to greet a Jewish king. Even greeting a non-Jewish king is valuable so in Olam Haba will be able to better appreciate the kavod given to a Jewish king."
      }
    ],
    "siman": {
      "title": "Teapot",
      "paragraph": "The person quickly pouring tea for the group eating their korbon Pesach at midnight, suddenly sees his friend four amos away wearing a souvenir crown he bought at the parade to greet the King."
    }
  },
  {
    "daf": 10,
    "data": [
      {
        "id": 0,
        "title": "The neshama is similar to Hashem in five ways",
        "paragraph": "We learn from the five times that Dovid HaMelech stated ”ברכי נפשי” that the neshamah is comparable to HaKadosh Baruch Hu in five ways.- Just as Hashem fills the world, sustains it, sees but is not seen, is tahor and resides in חדרי חדרים (the hidden chambers),  so too the neshama in its relationship to the body."
      },
      {
        "id": 1,
        "title": "Never give up hope",
        "paragraph": "A person should never give up hope no matter how dire a situation seems. Even if a sword is placed upon his neck, one should never refrain from praying for mercy.- אפילו חרב חדה מונחת על צוארו של אדם אל ימני עצמו מן הרחמים This was learned from Chizkiyahu HaMelech who prayed for his health even though Yeshaya  HaNavi had told him he was going to die and lose his portion in Olam Haba for not getting married and procreating."
      },
      {
        "id": 2,
        "title": "Do not eat before davening Shacharis",
        "paragraph": "One should not eat before he davens. This is learned from \"לא תאכלו על הדם\", “you may not eat upon the blood”, which teaches that you may not eat in the morning before you pray upon your “blood”, i.e. before praying for your wellbeing."
      }
    ],
    "siman": {
      "title": "A Yid",
      "paragraph": "A Yid with a very special neshama has a sword against his neck but is not giving up hope as he sings    ברכי נפשי  five times swaying back and forth and refuses the meal offered him before he has davened."
    }
  },
  {
    "daf": 11,
    "data": [
      {
        "id": 0,
        "title": "Machlokes about how to recite Krias Shema",
        "paragraph": "The Gemara’s analysis of the machlokes regarding how Krias Shema must be recited. According to Beis Shammai, Krias Shema at night must be recited lying down and in the morning standing up. According to Beis Hillel, Shema can be recited in any position."
      },
      {
        "id": 1,
        "title": "Birkas Krias Shema",
        "paragraph": "The fourth Mishnah of the Perek discusses the number of berachos accompanying Krias Shema; three in the morning and four at night."
      },
      {
        "id": 2,
        "title": "Birkas haTorah",
        "paragraph": "Since the Gemara lists the different versions of birkas haTorah, we recite them all before beginning to learn."
      }
    ],
    "siman": {
      "title": "Stars (11 stars in Yosef’s dream)",
      "paragraph": "A man lying down on the ground reciting Shema and all of its berachos looks up at the stars and sees the constellations in the shape of a Sefer Torah which reminds him to say all of the birkas haTorah."
    }
  },
  {
    "daf": 12,
    "data": [
      {
        "id": 0,
        "title": "Aseres HaDibros before Krias Shema",
        "paragraph": "Chazal sought to establish the practice of reading the Aseres HaDibros before reciting Krias Shema in the morning in the provinces as is done in the Beis HaMikdash, but soon abolished it because they feared the minim (heretics)  would attempt to convince the ignorant that the rest of the Torah is false."
      },
      {
        "id": 1,
        "title": "Parshas Balak not included in Krias Shema",
        "paragraph": "Chazal wanted to include Parshas Balak in Krias Shema because it includes a reference to lying down and getting up in the passuk of \"כרע שכב כארי וכלביא מי יקמנו\" - \"He crouched and lay down like a lion and like a lion cub, who can stand him up?\" They refrained from doing so because of tircha d’tzibbura, the burden it would impose on the congregation due to its length."
      },
      {
        "id": 2,
        "title": "Five reasons Parshas Tzitzis was included in the Shema",
        "paragraph": "The parsha of tzitzis was included in Krias Shema for the following five reasons:a. מצות ציצית – The mitzva of tzitzisb. יציאת מצרים – The Exodus from Mitzrayimc. עול מצות – The yoke of mitzvosd.  דעת מינים והרהור עברה - The need to beware of heretical opinions and sinful thoughtse. הרהור עבודה זרה - Idolatrous thoughts"
      }
    ],
    "siman": {
      "title": "Twelve Brothers",
      "paragraph": "Twelve brothers carrying posters of the Aseres HaDibros and proudly wearing 5 pairs of tzitzis were marching towards the minim who were trying to read Parshas Balak to cause tircha d’tzibbura."
    }
  },
  {
    "daf": 13,
    "data": [
      {
        "id": 0,
        "title": "Not calling Avraham “Avram”",
        "paragraph": "Bar Kappara taught that one who calls Avraham by the name Avram transgresses a מצות עשה whereas Rebbe Eliezer says he transgresses a מצות לא תעשה."
      },
      {
        "id": 1,
        "title": "Kavana for Krias Shema",
        "paragraph": "The various opinions regarding how much of Krias Shema requires kavana:•The first passuk of שמע•The first three pesukim up to and including על לבבך•The first parsha•The first two parshios"
      },
      {
        "id": 2,
        "title": "Prolonging the Echad",
        "paragraph": "Anyone who prolongs the pronunciation of the word “Echad” (one) will have his days and years prolonged. R’ Chiya taught it is long enough if one mentally acknowledges Hashem’s malchus (kingship) in heaven, earth and the over the four directions of the skies."
      }
    ],
    "siman": {
      "title": "Bar Mitzvah Boy",
      "paragraph": "A bar mitzvah boy ­ is reciting his first Krias Shema from his new siddur embossed Avraham (not Avram) with great kavana and is prolonging Echad for over a minute."
    }
  },
  {
    "daf": 14,
    "data": [
      {
        "id": 0,
        "title": "Interruptions during Hallel",
        "paragraph": "On days when even an individual is praying privately must complete the full Hallel, he may interrupt between paragraphs to greet an esteemed person but not in the middle of the paragraphs. On days when he does not complete the full Hallel, he can interrupt to greet even in the middle of a paragraph."
      },
      {
        "id": 1,
        "title": "The third parsha of Krias Shema in Eretz Yisroel",
        "paragraph": "The minhag in Eretz Yisroel was to abbreviate the third parsha of Shema and only recite:“דבר אל בני ישראל ואמרת אליהם אני ה' אלקיכם אמת” – “Speak to the children of Israel and say to them: I am Hashem your G-d – it is true.”They would then recite a small paragraph mentioning yetzios mitzrayim."
      },
      {
        "id": 2,
        "title": "R’ Shimon Bar Yochai’s explanation for the order of the parshios in Krias Shema",
        "paragraph": "R’ Shimon bar Yochai offers  an explanation for the for the order of the parshios of Shema in addition to R’ Yehoshua ben Korcha’s reason in the Mishna:שמע – includes in the paragraph the mitzvos of learning Torah, teaching Torah and doing mitzvosוהיה אם שמוע – only includes in the paragraph the mitzvos of to teach and to do mitzvosויאמר – only includes in the paragraph the mitzvah of doing mitzvos"
      }
    ],
    "siman": {
      "title": "Hand",
      "paragraph": "The kehilla davening Hallel was interrupted by an Israeli greeting them and shaking all of their hands, because he had already said his abbreviated Shema, wearing a shirt that read LTD, for learn, teach and do."
    }
  },
  {
    "daf": 15,
    "data": [
      {
        "id": 0,
        "title": "Washing before tefilla",
        "paragraph": "Washing before tefilla is so important that one should travel back almost a mil and forward as far as a parsah in order to find water."
      },
      {
        "id": 1,
        "title": "Is one required to hear himself recite Krias Shema?",
        "paragraph": "A significant amount of the daf focuses on the machlokes in the Mishna regarding whether one is required to hear himself recite Krias Shema to fulfill the mitzvah."
      },
      {
        "id": 2,
        "title": "Spacing out words that ten to blur into one another",
        "paragraph": "From the word \"ולמדתם\", “and you should teach them” we learn \"שיהא למודך תם\",“that one’s learning should be pure” (articulated faultlessly). Therefore one should pause between words that tend to get attached such as \"על לבבך\". (“ul levavecha”)"
      }
    ],
    "siman": {
      "title": "A Fruit Bowl (Based on connection to Tu B’Shevat)",
      "paragraph": "A fruit bowl with handles shaped like two big ears is placed under a washing sink and contains the words \"על לבבך\"“ul levavecha” written on two separate pieces of paper."
    }
  },
  {
    "daf": 16,
    "data": [
      {
        "id": 0,
        "title": "Workers can recite Krias Shema up in a tree",
        "paragraph": "Workers can say Shema while working up in trees since kavana is only required for the first passuk. They must come down for tefilla since it is a request for rachamim (mercy) and requires more kavana."
      },
      {
        "id": 1,
        "title": "Condolences for servants",
        "paragraph": "Rabban Gamliel accepted condolences (מקבל תנחומים) when his servant Tavi passed away because he was a talmid chochom, even though one generally does not accept condolences for a servant."
      },
      {
        "id": 2,
        "title": "A chosson is exempt from Krias Shema",
        "paragraph": "A chosson is exempt from Krias Shema because he is preoccupied with the mitzvah (טרדא דמצוה)."
      }
    ],
    "siman": {
      "title": "Toes",
      "paragraph": "A distracted chosson walks into a tree and stubs his toes which causes the worker to fall off the branch and down to the ground just as a funeral for a beloved servant is passing by."
    }
  },
  {
    "daf": 17,
    "data": [
      {
        "id": 0,
        "title": "Tefillos of Tanna’im and Amora’im after Shemoneh Esrei",
        "paragraph": "The individual tefillos that various Tanna’im and Amora’im recited after Shemoneh Esrei. Included in this list are some that were incorporated into our tefillos:- The tefillah recited after the Viduy of Yom Kippur –... אלקי עד שלא נוצרתי- The tefillah recited after Shemoneh Esrei – אלקי נצור לשוני מרע... Mentioned at the bottom of 16b are:- The tefillah when we bless the new moon – שתתן לנו חיים ארוכים...- The tefillah after Hamaavir sheinah meinai – שתצלינו מעזי פנים..."
      },
      {
        "id": 1,
        "title": "Reason women merit Olam Haba",
        "paragraph": "Women merit Olam Haba for bringing their children to school and letting their husbands learn, even though they have to wait for them to return."
      },
      {
        "id": 2,
        "title": "Concerns about looking haughty",
        "paragraph": "The concern over doing things that might make a person look haughty, such as a chosson reciting Krias Shema on his wedding night."
      }
    ],
    "siman": {
      "title": "Used Car",
      "paragraph": "The great Rabbis are all saying extra tefillos next to the holy pink used car that was used by the mother to bring her children to school, when a haughty chassan drives by in his fancy limousine."
    }
  },
  {
    "daf": 18,
    "data": [
      {
        "id": 0,
        "title": "Exemption from mitzvos even when not in front of the deceased",
        "paragraph": "The Mishnah on 17b states that someone who is required to bury his dead relative, who is right now in front of him, is exempt from mitzvos. According to Rav Ashi, he is exempt from all mitzvos, even when not in the presence of the deceased. Rav Ashi learns this from Avraham and the burial of Sarah. The pasuk says, And Avraham arose from the presence of his dead, followed by the next verse after Avraham had walked away, … that I may bury my dead from before me."
      },
      {
        "id": 1,
        "title": "Mocking the dead",
        "paragraph": "One is not permitted to wear tefillin, learn from a sefer or wear his tzitzis out in a cemetery. Doing so is considered mocking the dead (לעג לרש), because they can’t do mitzvos anymore."
      },
      {
        "id": 2,
        "title": "Are the dead aware of worldly events?",
        "paragraph": "In discussing the question of whether the dead are aware of worldly events, the Gemara relates the story of a chasid who successfully planted his crops each year based on forecasts he overheard from two spirits talking in a cemetery."
      }
    ],
    "siman": {
      "title": "Chuppah – בן י'ח לחופה",
      "paragraph": "Two spirits standing under a chuppah in a cemetery discuss next year’s weather forecast and are overheard by a rich farmer with tucked-in tzitzis, who is about to bury his mother."
    }
  },
  {
    "daf": 19,
    "data": [
      {
        "id": 0,
        "title": "One who disparages a deceased talmid chacham",
        "paragraph": "Anyone who disparages a deceased talmid chacham ultimately falls into Gehinnom.כל המספר אחר מטתן של תלמידי חכמים נופל בגיהנים"
      },
      {
        "id": 1,
        "title": "Do not open mouth to the Satan",
        "paragraph": "One should never open himself up to prosecution by the Satan by saying of himself that he is worthy of punishment.- אל תפתח פה לשטן"
      },
      {
        "id": 2,
        "title": "Personal dignity (kavod habrios) does not override a Torah prohibition",
        "paragraph": "Rav taught that if someone discovers shaatnez in his clothing he must remove the garment even in the middle of the marketplace, because where there is a threat of chillul Hashem (meaning violating a Torah prohibition) we do not worry about a person’s dignity (kavod habrios).- This is based on the passuk,\"אין חכמה אין תבונה אין עצה לנגד ה'\"- There is no value to wisdom, or understanding, or counsel when weighed against the honor of Hashem. Respect for a person’s dignity does, however, override a Rabbinic prohibition."
      }
    ],
    "siman": {
      "title": "Yacht",
      "paragraph": "A nasty person who disparaged a deceased talmid chacham fell off a yacht and was swallowed by a whale with a big open mouth, as the captain who ripped off his shaatnez-containing uniform steered the boat."
    }
  },
  {
    "daf": 20,
    "data": [
      {
        "id": 0,
        "title": "Why miracles occurred for earlier generations",
        "paragraph": "Earlier generations merited seeing miracles that later generations—despite their superiority in breadth and mastery of Torah—did not, because the earlier generations were moser nefesh (sacrificed themselves) for kiddush Hashem (to sanctify G-d’s name). Example: Rav Adda bar Ahavah tore an inappropriate garment off a woman walking in the street because he thought she was Jewish."
      },
      {
        "id": 1,
        "title": "A woman’s obligation to recite birkas hamazon",
        "paragraph": "Is the obligation for women to recite birkas hamazon Biblical or Rabbinic? The practical difference would be whether they can recite birkas hamazon on behalf of men, who are Biblically obligated."
      },
      {
        "id": 2,
        "title": "Ezra’s takanah modeled after Har Sinai",
        "paragraph": "Ezra’s takanah (decree) requires a baal keri (one who experiences a seminal discharge) to immerse in a mikveh in order to speak words of Torah and to daven. The takanah was modeled on the events at Har Sinai, where immersion was required for the recitation of words of Torah. Thinking Torah thoughts without immersion is permitted."
      }
    ],
    "siman": {
      "title": "Coffee",
      "paragraph": "A woman drinking coffee in a café and was about to bentch, when a Rabbi ran in and knocked the immodest headpiece off her head which landed in a mikveh that was in front of a model of Har Sinai."
    }
  },
  {
    "daf": 21,
    "data": [
      {
        "id": 0,
        "title": "The two Biblically mandated berachos",
        "paragraph": "The Gemara identifies the sources for two Biblically mandated berachos.Birkas Hamazon – \"ואכלת ושבעת וברכת\"  - and you shall eat, be satisfied and blessBirkas HaTorah– \"כי שם ה' אקרא הבו גדל לאלקינו\"  - when I call the name of Hashem, ascribe greatness to our G-d"
      },
      {
        "id": 1,
        "title": "Machlokes is Krias Shema Biblical or Rabbinic",
        "paragraph": "There is a machlokes whether the obligation to recite Krias Shema is Biblical or Rabbinic. According to Rav Yehuda, the Biblical obligation of ובשכבך ובקמך (and when you lie down and arise) is to recite any section of the Torah, once in the morning and once in the evening. The fact that we fulfill this requirement by reciting the words of Shema is Rabbinic."
      },
      {
        "id": 2,
        "title": "Latecomer to shul",
        "paragraph": "There is a machlokes regarding at what point a latecomer to shul can join the tzibbur (congregation) if they are in the middle of davening Shemoneh Esrei. One view permits it only if he can finish before the shliach tzibbur (the one leading the davening) reaches Kedushah; the other view holds that he only needs to finish before the shliach tzibbur reaches Modim."
      }
    ],
    "siman": {
      "title": "Car",
      "paragraph": "The latecomer to shul raced out of his car and jumped over one man bentching mid’Oraisa, and another man saying Shema mid’Rabbanan, but when he got to the minyan they were in the middle of Kedushah."
    }
  },
  {
    "daf": 22,
    "data": [
      {
        "id": 0,
        "title": "Why a Baal Keri immerses in a mikveh",
        "paragraph": "A Braisa teaches that the reason a baal keri is the only type of tumah that requires immersion in a mikveh before one is able to learn Torah is because the tumah came about as a result of levity. This is inconsistent with how the Torah was received at Har Sinai, which was with fear and trepidation."
      },
      {
        "id": 1,
        "title": "Words of Torah don’t contract tumah",
        "paragraph": "R’ Yehuda ben Beseira does not require a baal keri to immerse before learning Torah, because he holds that words of Torah are like fire, which do not contract tumah. He learns this from the pasuk: ‘הלא כה דברי כאש נאם ה, Behold my words are like fire, says Hashem."
      },
      {
        "id": 2,
        "title": "40 Se’ah or 9 Kabin?",
        "paragraph": "There is a machlokes whether a baal keri requires immersion in a mikveh of forty se’ah or whether having nine kabin of water poured over him suffices."
      }
    ],
    "siman": {
      "title": "Cab",
      "paragraph": "A cab driver laughed as his cab was surrounded by fire, which he doused with forty se’ah of water, pouring from a nine-kabin pail."
    }
  },
  {
    "daf": 23,
    "data": [
      {
        "id": 0,
        "title": "Going to the bathroom before Shemoneh Esrei",
        "paragraph": "One who feels the need to relieve himself and cannot restrain himself for 72 minutes (the time it takes to travel the distance of a parsah), should not begin Shemoneh Esrei. To do otherwise would be to render his tefillah a to’eivah (an abomination).       -  The source for the need to prepare oneself for tefillah is the pasuk,הכון לקראת אלקיך           ישראל – Prepare to meet your G-d, O Israel."
      },
      {
        "id": 1,
        "title": "Where to take tefillin off when going to the bathroom",
        "paragraph": "One must remove his tefillin at least four amos way from an established bathroom before entering. If the place had never been used as a bathroom, he can take his tefillin off there and relieve himself, but he must move at least four amos away before putting them back on."
      },
      {
        "id": 2,
        "title": "Forbidden to store anything in a tefillin bag",
        "paragraph": "It is forbidden to store anything other than tefillin in a bag set aside to hold tefillin.- It’s a machlokes whether the bag becomes forbidden as soon as it is set aside for such usage   (הזמנה מילתא היא) or only after it has been used (הזמנה לאו מילתא היא)."
      }
    ],
    "siman": {
      "title": "Keg",
      "paragraph": "A man running to the bathroom before davening Shemoneh Esrei puts his tefillin in his new tefillin bag on a keg that was four amos away from the outhouse."
    }
  },
  {
    "daf": 24,
    "data": [
      {
        "id": 0,
        "title": "Husband and wife reciting Krias Shema in bed",
        "paragraph": "A husband and wife sleeping in the same bed can recite Krias Shema as long as they are turned away from each other and face in opposite directions."
      },
      {
        "id": 1,
        "title": "Ervah",
        "paragraph": "The Gemara identifies those parts/aspects of a woman that are considered ervah (nakedness), which, when within view or earshot of a man, halachically prevent him from reciting Shema, saying berachos, learning Torah, etc. Included in the list are: -          A tefach of exposed skin that is normally covered (including one’s wife)-          Thigh – שוק-          [Singing] Voice – קול-          Hair - שעיר"
      },
      {
        "id": 2,
        "title": "Inappropriate behavior during tefillah",
        "paragraph": "The Gemara lists various improper behaviors during tefillah, such as davening audibly, belching, yawning, sneezing and spitting."
      }
    ],
    "siman": {
      "title": "Pitcher (כד)",
      "paragraph": "A married couple lie in a bed with an empty pitcher used as a sheitel stand placed between them. The husband yawns while the wife says Shema."
    }
  },
  {
    "daf": 25,
    "data": [
      {
        "id": 0,
        "title": "Reciting Krias Shema near a foul smelling substance",
        "paragraph": "There is a machlokes regarding how far one must be from a foul odor that emanates from a substance (ריח רע שיש לו עיקר) to recite Krias Shema: - Rav Huna holds the person must be four amos away from the actual substance.- Rav Chisdah holds the person must be four amos away from spot where the odor stops."
      },
      {
        "id": 1,
        "title": "Learning with an odor without substance",
        "paragraph": "While it is forbidden to say Krias Shema if there is an odor without substance (ריח רע שאין לו עיקר) Rav Sheishes ruled that it is permitted to learn if the smell is coming from another person.This is learned from the fact that people learned in a place where people dozed on mats."
      },
      {
        "id": 2,
        "title": "Reciting Krias Shema opposite a chamber pot",
        "paragraph": "It is forbidden to recite Krias Shema opposite a clay chamber pot  (גרף של רעי) used for excrement or urine, even if there is nothing in it, since it is especially absorbent and makes the vessel repulsive."
      }
    ],
    "siman": {
      "title": "Silver Anniversary",
      "paragraph": "The surprise silver anniversary party the husband threw for his wife was a disaster when the party room he rented was less than four amos away from a barn that was full of foul smelling substances, people sleeping on mats, and used chamber pots."
    }
  },
  {
    "daf": 26,
    "data": [
      {
        "id": 0,
        "title": "Excrement in front of a person",
        "paragraph": "According to Rav Huna, when the Mishnah said that one must be four amos away from excrement in order to recite Krias Shema, it was referring to when it is behind the person. If it’s in front of the person, then it’s prohibited to recite Shema as long as it is in one’s field of vision."
      },
      {
        "id": 1,
        "title": "Making up for missed tefillos",
        "paragraph": "After introducing the time periods of various tefillos in the perek’s opening Mishnah, the Gemara teaches that one may make up for missed tefillos (תשלומים) as follows:  - If one missed Minchah, he may daven Maariv twice even though it is not     the same day.  - If one missed Minchah Erev Shabbos, he may daven the Shabbos Maariv      twice, even though it is not the same Shemoneh Esrei.  - If one missed Shabbos Minchah, he may daven the weekday Maariv twice,     inserting Havdalah in the first Maariv."
      },
      {
        "id": 2,
        "title": "The source for davening three times a day",
        "paragraph": "The Gemara brings a machlokes whether davening three times a day originates with the Avos (אבות תקנום) or the Anshei Knesses Hagdolah (the Men of the Great Assembly), who instituted the tefillos to correspond to the daily tamid offerings (כנגד תמידין תקנום)."
      }
    ],
    "siman": {
      "title": "A military coup",
      "paragraph": "Soldiers wearing binoculars burst into the shul but didn’t notice the man in the corner davening his second Maariv, because they were transfixed by the Sukkah poster depicting the Avos."
    }
  },
  {
    "daf": 27,
    "data": [
      {
        "id": 0,
        "title": "The latest time to daven Minchah",
        "paragraph": "Since the Gemara does not render the halachah regarding the latest permissible time to daven Minchah, one may follow the opinion either of the Rabbanan and daven until nightfall, or of R’ Yehudah and daven until plag Haminchah (10 ¾ seasonal hours into the day). R’ Yehudah also permits one to daven Maariv right after plag Haminchah, even though it’s before nightfall. According to many, one may not, however, do a split decision, following the Rabbanan to daven Minchah after plag and then following R’ Yehudah to immediately daven Maariv before nightfall."
      },
      {
        "id": 1,
        "title": "Walking in front of someone davening Shemoneh Esrei",
        "paragraph": "One may not pass in front of someone who is davening Shemoneh Esrei - אסור לעבור כנגד המתפללין.Furthermore, one may not daven either alongside or behind his Rebbi, as doing so would appear arrogant."
      },
      {
        "id": 2,
        "title": "R’ Gamliel is deposed",
        "paragraph": "The Gemara relates that the machlokes between R’ Gamliel and R’ Yehoshua over whether Maariv is voluntary or obligatory led to R’ Gamliel being deposed and R’ Elazar ben Azarya being appointed Nasi in his place."
      }
    ],
    "siman": {
      "title": "Kazoo (a toy musical instrument that one blows into to create a buzzing sound)",
      "paragraph": "A little boy blew his annoying kazoo during the Minchah minyan after plag whenever he saw someone passing in front of someone who was davening Shemoneh Esrei, feeling so proud as he stood next to the new Nasi."
    }
  },
  {
    "daf": 28,
    "data": [
      {
        "id": 0,
        "title": "Hundreds of talmidim enter the beis midrash",
        "paragraph": "On the day that R’ Elazar ben Azaryah became the Nasi, the doors to the beis midrash were opened to all the talmidim who had been excluded by R’ Gamliel because they were not as good on the inside as they appeared on the outside (שאין תוכו כברו). As a result of their participation, all heretofore unresolved halachos were resolved that day. -  Masechta Eduyos is composed of halachos that were taught that day, and wherever in Shas the term “that day” (בו ביום) is used it refers to that day."
      },
      {
        "id": 1,
        "title": "Final words from R’ Eliezer and R’ Yochanan ben Zakkai to their talmidim",
        "paragraph": "The Gemara relates what two ailing Tanna’im said to their talmidim: -  R’ Eliezer said (among other things) כשאתם מתפללים דעו לפני מי אתם עומדים – When you daven, know before whom you are standing. -  R’ Yochanan Ben Zakai blessed his students from his deathbed – יהי רצון שתהא מורא שמים עליכם כמורא בשר ודם - May it be Hashem’s will that your fear of Heaven be as great as your fear of man."
      },
      {
        "id": 2,
        "title": "What 18 berachos in the Amidah correspond to",
        "paragraph": "The Gemara brings a three-way machlokes regarding what the 18 blessings in the Amidah correspond to:    - The 18 times Hashem’s name appears in Psalm 29 – הבו לה' בני אלים    - The 18 times His name appears in Krias Shema    - The 18 vertebrae in the spine     - The nineteenth blessing (הצדוקים ברכת) was composed by Shmuel Hakatan against the heretics."
      }
    ],
    "siman": {
      "title": "Strong Man (strength)",
      "paragraph": "The big strongman let hundreds of talmidim into the beis midrash to visit their two sick Rabbanim, resolve halachos and to daven Shemoneh Esreifor their refuah."
    }
  },
  {
    "daf": 29,
    "data": [
      {
        "id": 0,
        "title": "The differing number of berachos in the various Amidahs",
        "paragraph": "The Gemara explains the differing number of berachos in the various Amidahs recited on special days:- The seven berachos in the Shabbos Amidah correspond to the seven kolos (sounds) that Dovid Hamelech mentioned in Psalm 29.- The nine berachos in the Rosh Hashanah Amidah correspond to the nine times Chanah uttered Hashem’s name in her tefillah.- The 24 berachos in the fast day Amidah correspond to the 24 expressions of song (רננות) that Shlomo Hamelech recited on the day the Aron was brought into the Kodesh Hakadashim (Holy of Holies)."
      },
      {
        "id": 1,
        "title": "Additional Tefillos",
        "paragraph": "A number of additional tefillos are introduced:- הביננו  (Havineinu) - an abridged version of Shemoneh Esrei.-  תפילה קצרה במקום סכנה - A short tefillah recited when in a dangerous place.-  תפילת הדרך – Tefillas Haderech, the traveler’s prayer."
      },
      {
        "id": 2,
        "title": "Not making one’s teffilah “keva”",
        "paragraph": "The Gemara cites four opinions regarding the meaning of “keva” (קבע) in R’ Eliezer’s statement that one should not make his tefillah “keva.”- Treating one’s tefillah like a burden- Not davening like a supplicant (דרך תחנונים).- Not innovating anything in one’s tefillah, i.e. not introducing any new requests from one tefillah to the next.- Not davening when the sun is red, meaning immediately after sunrise or before sunset."
      }
    ],
    "siman": {
      "title": "Cots",
      "paragraph": "The hospital cots were unfortunately full on Shabbos, Rosh Hashana and Fast Days because people who had been travelling and going through dangerous places had treated their tefillos as a burden."
    }
  },
  {
    "daf": 30,
    "data": [
      {
        "id": 0,
        "title": "Davening towards Yerushalayim",
        "paragraph": "One must daven facing towards Yerushalayim, the Beis Hamikdash and the Kodesh Hakadashim. This is derived from the pasuk כמגדל דויד צוארך בנוי לתלפיות – Like the tower of David is your neck, built as a landmark, which the Gemara explicates as תל שכל פיות פונים בו – A hill towards which all mouths turn."
      },
      {
        "id": 1,
        "title": "Travelling early in the morning",
        "paragraph": "There is a machlokes regarding how one who must travel early in the morning, before the time of tefillah, should proceed. The dispute hinges on which requirement is more important—davening Shemoneh Esrei while standing or juxtaposing redemption to tefillah (סומך גאולה לתפילה) -The Tanna Kamma holds that it is more important to daven Shemoneh  Esrei  while standing;  thus the traveler should daven at home, standing, and then recite Krias Shema on the journey when the time comes. -R’ Shimon ben Elazar holds that juxtaposing redemption to tefillah is more important, so the traveler should start his journey without saying Shemoneh Esrei and then recite Krias Shema at the proper time, followed by Shemoneh Esrei , even if it must be said sitting."
      },
      {
        "id": 2,
        "title": "Davening with כובד ראש (an attitude of reverence)",
        "paragraph": "The source for the requirement that one daven with an attitude of reverence (כובד ראש) is the pasuk עבדו את ה' ביראה וגילו ברעדה – Serve Hashem with awe, and rejoice with trepidation."
      }
    ],
    "siman": {
      "title": "Rebbe in a classroom",
      "paragraph": "With the map of the world behind him, the Rebbe was teaching his righteous students the importance of davening towards Yerushalayim when the Uber driver arrived to take him on his pre-sunrise trip."
    }
  },
  {
    "daf": 31,
    "data": [
      {
        "id": 0,
        "title": "Breaking a glass at a chuppah",
        "paragraph": "The Gemara recounts several incidents where the Rabbis tempered joyous events with seriousness when they felt their peers were overly cheerful. This is the reason (Tosafos) for breaking the glass at a wedding: - Mar the son of Ravina broke a precious glass worth four hundred zuz in the presence of the Rabbanan- Rav Ashi broke a white glass in their presence as well"
      },
      {
        "id": 1,
        "title": "The proper mindset for tefillah",
        "paragraph": "The Rabbis taught in a Baraisa that one should not daven Shemoneh Esrei amidst a state of sorrow  (עצבות), slothfulness(עצלות) , laughter(שחוק) , silly chatter(שיחה) , light headedness (קלות ראש) or idle words(דבירם בטלים) . Rather one should daven amidst the joy associated with a mitzvah, (שמחה שלמצוה)."
      },
      {
        "id": 2,
        "title": "Halachos learned from Chanah’s tefillos",
        "paragraph": "A large part of this Daf details the many halachos and concepts related to tefillah learned from Chanah’s tefillos and her conversation with Eli. A few examples include: - One must direct their heart to G-d.- One must pronounce the words with his lips.- It is forbidden to raise one’s voice to the degree that others can hear.- It is forbidden to sit within four amos of one who is davening"
      }
    ],
    "siman": {
      "title": "Judge (connected to law)",
      "paragraph": "The judge was so impressed with the joyous davening that took place right after the breaking of the glass at a chuppah, that he signed up for the course on tefillah given by a woman named Chanah."
    }
  },
  {
    "daf": 32,
    "data": [
      {
        "id": 0,
        "title": "Moshe’s defense of Bnei Yisrael for their involvement in the chet ha’egel",
        "paragraph": "The Gemara goes through an extensive analysis of Moshe’s defense of Bnei Yisrael before Hashem for their involvement in the chet ha’egel (sin of the Golden Calf),-  Moshe argued that the cause of the sin was the abundance of gold that Hashem had lavished on Bnei Yisrael.-  Moshe realized that Hashem telling him to leave (הניחה לי) really provided an opening for him to    continue to try to save the nation by imploring Hashem on their behalf.-  Moshe countered Hashem’s notion to rebuild the nation entirely from Moshe, arguing that if a three-legged chair—Bnei Yisrael founded on the Avos—could not endure, then surely a one-legged chair—Bnei Yisrael founded from him alone—would not endure."
      },
      {
        "id": 1,
        "title": "Praising Hashem",
        "paragraph": "R’ Simla’i teaches that one should always praise Hashem before praying:לעולם יסדר אדם שבחו של הקב'ה ואחר כך יתפלל.-  This is learned from Moshe, who first praised Hashem before petitioning to be granted permission to enter Eretz Yisrael."
      },
      {
        "id": 2,
        "title": "The Gates of Tears are never locked",
        "paragraph": "The Gemara relates that though the heavenly gates of tefillah have been locked since the destruction of the Beis Hamikdash, the gates of tears have not been locked.- אף על פי ששערי תפילה ננעלו שערי דמעה לא ננעלו -  This is learned from the pasuk, שמעה תפלתי ה' ושועתי האזינה אל דמעתי אל תחרש – Hear my prayer, Hashem, give ear to my outcry, to my tears be not silent."
      }
    ],
    "siman": {
      "title": "Mad scientist in a lab",
      "paragraph": "The mad scientist in the lab tried to create a gold colored calf that would sing his praises all day long but when the calf came to life it escaped, causing the mad scientist to break down into tears."
    }
  },
  {
    "daf": 33,
    "data": [
      {
        "id": 0,
        "title": "Havdalah",
        "paragraph": "When the Jews first returned to Eretz Yisrael from the Babylonian exile, the Anshei Knesses Hagedolah (Men of the Great Assembly) fixed the berachah of Havdalah within Shemoneh Esrei, because the people were poor and couldn’t afford wine. Later, when the people grew wealthier, the berachah was removed from tefillah and its recital was fixed over a cup of wine. The details of the original enactment were forgotten. Later still, when the people became impoverished, they reverted to the original enactment and fixed Havdalah in tefillah, but required people who could afford it to recite Havdalah a second time over wine."
      },
      {
        "id": 1,
        "title": "Limiting praising Hashem’s traits",
        "paragraph": "R’ Chanina reprimanded a shliach tzibbur who enumerated a long list of Hashem’s traits. When the man finished his tefillah, R’ Chanina asked him, “Did you complete all the praises of your Master?” – סיימתינהו לכולהו שבחי דמרך? He explained that were it not for the fact that Moshe praised Hashem with the three attributes of Gadol, Gibbor and Nora in the Torah and the Anshei Knesses HaGedolah established them in the text of our tefillos, we would not have been able to recite even those attributes."
      },
      {
        "id": 2,
        "title": "יראת שמים",
        "paragraph": "R’ Chanina taught that הכל בידי שמים חוץ מיראת שמים – Everything is in the hands of Heaven except for the fear of Heaven. - This is derived from the pasuk, ועתה ישראל מה ה' אלקיך שואל מעמך כי אם ליראה – And now, Israel, what does Hashem, your G-d, ask of you, but merely to fear Hashem."
      }
    ],
    "siman": {
      "title": "Pirate with a peg leg",
      "paragraph": "The pirate with a peg leg lifted up his cup of Havdala and started enumerating many praises for Hashem when his wife came in and reprimanded him for having no yirasshamayim."
    }
  },
  {
    "daf": 34,
    "data": [
      {
        "id": 0,
        "title": "How to approach the three different parts of Shemoneh Esrei",
        "paragraph": "R’ Chanina taught how one should comport himself while davening Shemoneh Esrei: - When he recites the first three berachos, he is like a servant who states words of praise before his master before daring to make a request.- When he recites the middle berachos, he is like a servant who requests his allotment.- When he recites the last three berachos he is like a servant who received his allotment from his master, begs leave and goes on his way, expressing gratitude."
      },
      {
        "id": 1,
        "title": "The proper times to bow",
        "paragraph": "The Gemara discusses the proper times to bow during Shemoneh Esrei and teaches that the more exalted the stature of the individual, the greater the need to humble oneself through bowing:A regular Jew:  At the beginning and end of the first beracha of Avos as well as the beginning and end of the beracha of Hoda’ah (Thanksgiving).Kohen Gadol:One opinion states at the end of each beracha.Another opinion states at the beginning and end of each beracha.Melech:One opinion states at the beginning and end of each beracha.Another opinion states that he remains bowed from the first beracha until the completion of the tefillah"
      },
      {
        "id": 2,
        "title": "Ba’alei Teshuva vs. Tzadikim Gemurim",
        "paragraph": "The Gemara introduces the question of who is more exalted: Ba’alei Teshuva or Tzadikim Gemurin (The completely righteous):R’ Abahu is of the opinion that the place where ba’alei teshuvah stand, the completely righteous do not stand.במקום שבעלי תשובה עומדין צדיקים גמורים אינם עומדין His opinion is based on the pasuk, \"שלום שלום לרחוק ולקרוב\" – Peace, peace to the distant and to the near. (Isaiah 57:19). Hashem extends greetings to those that are distant (ba’alei teshuva) before those that are close (tzadikim gemorim): R’ Yochanan, who is of the opinion that tzadikim gemurimn are nore exalted, interprets “the distant” as those that are distant from sin, and “the near” as those nearer to sin."
      }
    ],
    "siman": {
      "title": "Ladder",
      "paragraph": "The baal teshuva climbed the ladder to the special room to learn how the King davens Shemoneh Esreicompletely bowed as the servant down below begged the king for his allotment."
    }
  },
  {
    "daf": 35,
    "data": [
      {
        "id": 0,
        "title": "ברכה ראשונה is based on reason",
        "paragraph": "After concluding that there is no Torah source for the concept of a ברכה ראשונה (blessing before eating), the Gemara teaches that the obligation to do so is based on reason:       -   אסור לו לאדם שיהנה מן העולם הזה בלא ברכה – It is forbidden for a person to derive benefit from this world without first reciting a blessing.       -  Since one derives pleasure from the world, he should thank the Creator of those pleasures. The Gemara lists implications of eating without a berachah:- כל הנהנה מן העולם הזה בלא ברכה מעל – Whoever derives benefit from the world without first reciting a berachah has committed an act of me’ilah (misappropriation of Temple property).-  כל הנהנה מן העולם הזה בלא ברכה כאילו גוזל להקבה וכנסת ישראל - Whoever derives benefit from the world without first reciting a berachah is regarded as if he robs from Hashem and the Assembly of Israel."
      },
      {
        "id": 1,
        "title": "ואספת דגנך",
        "paragraph": "There is a machlokes over how to understand the words in Krias Shema, ואספת דגנך, you shall gather in your grain:- R’ Yishmael understands it as a general directive that Torah study should be combined with     earning a living. - R’ Shimon bar Yochai argues that preoccupation with earning a living would leave no time for Torah study, so he interprets the verse as referring to a time when the nation does not fulfill Hashem’s will. At such a time, they will not only have to do their own work, gathering their own grain, but even have to do the work of others. But when they do fulfill Hashem’s will, the work of gathering in their grain will be done for them by others."
      },
      {
        "id": 2,
        "title": "Why wine has a special berachah",
        "paragraph": "The Gemara concludes that the reason that wine—unlike olive oil—merits having a unique berachah of its own ((הגפן, is because wine satiates (סעיד) and olive oil does not."
      }
    ],
    "siman": {
      "title": "Children’s choir singing La La La",
      "paragraph": "The children’s choir at the Berachos Party sang the Berachah Rishonah song for wine, while the darling little kids on stage pretended to harvest wheat."
    }
  },
  {
    "daf": 36,
    "data": [
      {
        "id": 0,
        "title": "Berachah over wheat flour",
        "paragraph": "There is a machlokes concerning the berachah recited over wheat flour(קמחא דחיטי) : -          Rav Yehuda says that one recites a ha’adamah, since it is likened to eating wheat kernels. The fact that the flour is ground does not change its status. -          Rav Nachman says that one recites a shehakol, because the ground flour is no longer in its original state of wheat kernels, which would require a ha’adamah, but has not yet reached its final state of bread, which would require a hamotzi."
      },
      {
        "id": 1,
        "title": "Husks of Caper Bush",
        "paragraph": "The Gemara asks why the husks of a caper bush are not subject to the orlah restriction, given that a shomer (protective covering) of an orlah fruit is considered orlah. Rava teaches that something is only considered a fruit’s shomer if without it the fruit would die. Caper bush husks are not needed to keep the berries alive, so they do not attain the status of shomer and are not subject to orlah."
      },
      {
        "id": 2,
        "title": "Foods that contain one of the five grains",
        "paragraph": "Rav and Shmuel teach that one recites a borei minei mezonos on any food that contains one of the five species of grain, even if the grain is not the primary ingredient. Tosafos adds that this is only when the grain is there to enhance the dish, rather than merely to serve as a binder."
      }
    ],
    "siman": {
      "title": "Lulav",
      "paragraph": "The lulav that was covered in fine white wheat flour and was sprouting caper bush husks out of its top was sitting in a bowl of porridge."
    }
  },
  {
    "daf": 37,
    "data": [
      {
        "id": 0,
        "title": "The berachah on cooked rice",
        "paragraph": "Cooked rice is similar to the five grains, inasmuch as the berachah before eating it isבורא מיני מזונות, but it is dissimilar regarding the berachah said afterwards, which is בורא נפשותrather than על המחיה."
      },
      {
        "id": 1,
        "title": "Berachah after eating one of the seven species",
        "paragraph": "A Baraisa records a machlokes over the proper berachah after eating one of the seven species, and relates a relevant incident: a.       R’ Gamliel says one should recite ברכת המזון.b.      The Chachamim say one should recite מעין שלש. -          When R’ Gamliel gave permission to R’ Akiva to lead the bentching after eating dates, R’ Akiva quickly said the berachah of מעין שלש. He subsequently explained that although R’Gamliel taught that one should bentch in such a case, he also taught that one should follow the majority opinion, which in this case was to say מעין שלש."
      },
      {
        "id": 2,
        "title": "Berachah on cooked dish made with pieces of bread",
        "paragraph": "According to Rav Sheishess, one makes a המוציא on a cooked dish made with pieces of bread even if the pieces are smaller than a kezayis (an olive). Rava stipulates that if the pieces are smaller than a kezayis, they must still have the appearance of bread."
      }
    ],
    "siman": {
      "title": "Laser tag",
      "paragraph": "The Chol Hamoed Pesach laser tag trip got out of hand when the losing team started throwing rice and dates and the winning team discovered little pieces of bread in their cooked dish."
    }
  },
  {
    "daf": 38,
    "data": [
      {
        "id": 0,
        "title": "Food or drinks with medicinal purpose on Shabbos",
        "paragraph": "It is permitted to consume any or food or drink for medicinal purposes on Shabbos, since the act is considered one of eating rather than healing."
      },
      {
        "id": 1,
        "title": " ”Hamotzi” or “Motzi”?",
        "paragraph": "There is a machlokes regarding whether the nusach of the berachah on bread should be “Motzi” or “Hamotzi”: -          The Rabbanan say one should say Hamotzi lechem min ha’aretz, which means, He who brought forth bread from the ground, in the past tense. -          R’ Nechemiah says that when Hashem is referred to as the “Hamotzi,” the reference is to what He has not yet done—take Bnei Yisroel out of Mitzrayim—but will do in the future. His proof is the pasuk (Shemos 6:7) which says המוציא אתכם מתחת סבלות מצרים, referring to Hashem taking Bnei Yisrael out of Mitzrayim in the near future. Since that connotation would be not be fitting for the berachah, one should say “Motzi,” meaning Who brought forth, in the past tense. -          The halachah follows the Rabbanan."
      },
      {
        "id": 2,
        "title": "The berachah on cooked vegetables (שלקות)",
        "paragraph": "The appropriate berachah on cooked vegetables(שלקות)  is often ha’adamah but sometimes shehakol: -          When cooking elevates the vegetable to the primary form in which it’s eaten, as, for example, with a potato, then the berachah on the raw vegetable is shehakol on for the cooked vegetable ha’adamah. -          When cooking is not the primary way to eat the vegetable, as, for example, with a leek, then the berachah on the raw vegetable is ha’adamah and on the cooked vegetable shehakol."
      }
    ],
    "siman": {
      "title": "Chicken soup (a davar lach)",
      "paragraph": "The sick yeshiva bochur made Hamotzion the challahs, before he was served some medicinal chicken soup together with some cooked vegetables."
    }
  },
  {
    "daf": 39,
    "data": [
      {
        "id": 0,
        "title": "Precedence in Berachos",
        "paragraph": "Regarding the precedence in berachos, one should first make a berachah on food with a more specific berachah (e.g. ha’adamah) before making it on food with a less specific berachah (e.g. shehakol). If both foods require the same berachah, then one should choose the one that he prefers (חביב)."
      },
      {
        "id": 1,
        "title": " Whole loaf vs. large piece",
        "paragraph": "There is a machlokes regarding which bread a person should say hamotzi on when faced with a choice between a small whole loaf and a larger broken piece of the same grain:Rav Huna holds that size takes precedence over wholeness, so one says hamotzi on the larger, broken piece.- R’ Yochanan holds that completeness takes precedence over size, so one says hamotzi on the smaller, complete loaf.- Rav Nachman bar Yitzchok holds that a ירא שמים should adopt the practice of placing the broken piece under the whole loaf and then either break off a piece from the whole loaf or from both of them."
      },
      {
        "id": 2,
        "title": "Lechem Mishneh",
        "paragraph": "On Shabbos, one makes hamotzi over two whole loaves of bread, commemorating the fact that on Fridays in the desert a double portion (לחם משנה) of manna would fall.- Rav Kahana would recite the berachah on two loaves but would only break one. - R’ Zeira would break off a large piece for himself that would suffice for the whole meal."
      }
    ],
    "siman": {
      "title": "Letter",
      "paragraph": "The father was shocked when he discovered a letter under the two small whole loaves of lechemmishna next to a large piece of bread, reminding him to always make a berachah on a carrot before making one on gefilte fish."
    }
  },
  {
    "daf": 40,
    "data": [
      {
        "id": 0,
        "title": "Speaking after saying Hamotzi",
        "paragraph": "Although one may not talk in between reciting a brachah and eating, one is permitted to speak between making Hamotzi and eating of the bread if the purpose is to facilitate the eating of the bread. -Rav says one is allowed to tell the people seated at the table to take a piece of bread.-R’ Yochanan says one is even allowed to ask for salt or relish to be brought to the table to enhance the taste of the bread.-Rav Sheishess says one is even allowed to ask that food be prepared for his animals since it is forbidden for a person to eat before he gives food to his animals."
      },
      {
        "id": 1,
        "title": "What type of tree was the Eitz HaDaas?",
        "paragraph": "A Baraisa is brought that lists various opinions regarding what type of tree Adam HaRishon ate from (i.e. the Eitz HaDaas): -R’ Meir – It was a grapevine. R’ Meir’s reasoning is that we find that “wine brings wailing upon a person,” and the Eitz HaDaas brought about death.-R’ Nechemyah – It was a fig tree. R’ Nechemyah’s reasoning is that it is logical that Hashem will bring about Adam and Chava’s “repair through what caused their damage,” i.e. since  their “repair” was through a fig tree, as they sewed fig leaves to wear, their “damage” i.e. their downfall of eating from the Eitz HaDaas as well must have been through a fig tree.-R’ Yehuda – It was wheat. R’ Yehuda’s logic is that since a child does not know his first words of “Abba” and “Imma” until he begins to eat grain, this indicates that grain is associated with the development of Daas."
      },
      {
        "id": 2,
        "title": "The proper text for a berachah",
        "paragraph": "There is a dispute regarding the required text for a berachah:- Rav says that any berachah that does not mention Hashem’s name is not considered a berachah.כל ברכה שאין בה הזכרת השם אינה ברכה- Rav Yochanan says that any berachah that does not include Hashem’s name and does not mention Hashem’s sovereignty over the world as well, is not considered a berachah.כל ברכה שאין בה מלכות אינה ברכה"
      }
    ],
    "siman": {
      "title": "Pool of water",
      "paragraph": "The over ambitious new parents were sitting by the pool under a fig tree trying to feed their infant grain, teaching it the proper text of the berachah while asking for salt for the bread."
    }
  },
  {
    "daf": 41,
    "data": [
      {
        "id": 0,
        "title": " מין שבעה עדיף או מין חביב עדיף?",
        "paragraph": "Rebbe Yehuda and the Rabbonon debate in the Mishna on דף מ : regarding which food one recites a berachah on first when several foods are in front of him:-  Rebbe Yehuda says that if one of the foods are one of the seven species, then that food takes precedence (מין שבעה עדיף).-  The Rabbonon say  that the food that he prefers takes precedence (חביב עדיף). The Amoraim dispute the parameters of the debate:-  One Amora states that they disagree only when the different foods share the same berachah, such as an apple and an olive. In a case where they have different berachos, such as a potato and an olive, then both Tannaim in the Mishna will agree that one recites the berachah first on the food that he prefers  (חביב עדיף).-          The other Amora states that the same disagreement also applies when the berachos are different. The disagreement then would be in regards to which of the two berachos is recited first."
      },
      {
        "id": 1,
        "title": " The seven species list",
        "paragraph": "There is a machlokes regarding what can be learned from the pasuk which lists the seven species ((\"ארץ חטה ושעורה וגפן ותאנה ורמון ארץ זית שמן ודבש\": -  Rav Yosef teaches that the order of foods listed in the pasuk indicate which foods attain precedence in berachos. The closer the food is to the term “ארץ”, the greater the precedence. -  Rav Chanan teaches that the purpose of the pasuk is to teach the measurements for different halachos, with each food item representing a different unit of measure."
      },
      {
        "id": 2,
        "title": " Making berachos on foods during the meal",
        "paragraph": "Rav Pappa stated the following rulings regarding the berachos recited on foods eaten in the course of the meal: -          Foods that are eaten together with bread, which are eaten during the meal, do not require a berachah either before or after eating them.-          Foods that are not eaten together with bread, which are eaten during the meal, require a berachah before eating them but not after.-          Foods that are usually eaten after the meal, such as dessert, even when eaten during the meal, require a berachah both before and after eating them."
      }
    ],
    "siman": {
      "title": "Ma (Grandma)",
      "paragraph": "The grandma couldn’t decide which fruit to make the berachah on, her favorite apple or the pomegranate, so she used her 7 species ruler to measure which was larger, and made a berachah on it during the course of her meal."
    }
  },
  {
    "daf": 42,
    "data": [
      {
        "id": 0,
        "title": "Making a Hamotzi on פת הבאה בכיסנין",
        "paragraph": "The berachah for פת הבאה בכיסנין is generally a mezonos, since it is usually eaten as a snack, but Rav Nachman rules that if one eats enough of it to establish a meal on (קובע סעודה), the berachah would be hamotzi."
      },
      {
        "id": 1,
        "title": "When is a meal considered completed?",
        "paragraph": "The Gemara discusses the point at which a meal is considered completed, when no more food may be eaten before reciting Birkas Hamazon. -          Rav Huna says it is when one finishes eating the meal.-          Rav Pappa says it is when the bread and food are removed from the table.-          Rava says that guests are dependent on the host’s intentions, so that if the host brings additional portions to the table even after the removal of the food and bread, it may still be eaten.-          Rav says that if one is accustomed to anoint his hands with oil on finishing a meal, then as long as he has not anointed his hands he may continue eating, even after he finishes the meal, and even after the food is removed from the table. The Gemara concludes that the halachah follows what Rav Chiya bar Ashi says in the name of Rav, that the washing of the hands after the meal (מים אחרונים) is followed immediately by Birkas Hamazon, meaning that there may be no more eating after washing מים אחרונים."
      },
      {
        "id": 2,
        "title": "One making a berachah on behalf of a group",
        "paragraph": "The Mishnah infers that in order for one person in a group to make a berachah for the others, the group must be reclining, not just sitting. The Gemara later concludes that if the group verbally states their intention to eat together, then sitting is considered like reclining."
      }
    ],
    "siman": {
      "title": "Mobster",
      "paragraph": "As part of their initiation, the newly recruited mobsters were required to make a berachah for the group on a meal’s worth of פת הבאה בכיסנין, and then correctly guess that מים אחרונים is when the mob boss considers the meal over."
    }
  },
  {
    "daf": 43,
    "data": [
      {
        "id": 0,
        "title": " Berachos on fragrances",
        "paragraph": "The Gemara discusses the appropriate berachos to recite when smelling various fragrances:•בורא מיני בשמים  over spices.•בורא עשבי בשמים  over plants.•בורא עצי בשמים  over the scent of wood.•בורא שמן ערב  over the sweet scent of balsam oil.•שנתן ריח טוב בפירות  over an esrog. One who sees a fruit tree in blossom during Nissan recites:ברוך שלא חיסר בעולמו כלום וברא בו בריות טובות ואילנות טובות להתנאות בהן בני אדם, Blessed [are you, Hashem,…] Who did not leave anything lacking in His universe and created in it good creatures and good trees, to give pleasure to mankind."
      },
      {
        "id": 1,
        "title": "Tamar not embarrassing Yehuda",
        "paragraph": "Tamar’s willingness to be executed rather than cause shame to Yehudah teaches us that it is preferable to cast oneself into a fiery furnace rather than shame one’s fellow in public.נוח לו לאדם שיפיל עצמו לתוך כבשן האש ואל ילבין פני חברו ברבים."
      },
      {
        "id": 2,
        "title": "Behaviors unbecoming to a talmid chacham",
        "paragraph": "The Rabbanan teach that six behaviors are unbecoming for a talmid chacham:1.Going into the street with perfumed clothes, in a place where people are suspected of homosexuality.2.Going out alone at night, lest he be suspected of inappropriate behavior.3.Going outside with patched shoes.4.Conversing with a woman in the market.5.Dining with עמי הארץ (unlearned people), lest he be drawn after them.6.Being the last to enter the beis midrash, lest people consider him lazy."
      }
    ],
    "siman": {
      "title": "Magazine",
      "paragraph": "The frum scratch and sniff spice magazine spring edition featured articles on how talmidei chachamim can avoid getting perfume on their clothesso they don’t get embarrassed in public, as well as where to find blossoming trees in the month of Nissan."
    }
  },
  {
    "daf": 44,
    "data": [
      {
        "id": 0,
        "title": "The fruits of Genosar",
        "paragraph": "The Gemara wants to know an example of the Mishnah’s case where bread would be considered secondary (טפל) to a salty food which would be considered primary (עיקר). It answers that fruits of Genosar were extremely sweet and delicious that they needed to be eaten with salt. These fruits were so exceptional that when eaten with bread the fruits were considered primary  (עיקר)and the bread that was eaten with them was considered secondary (טפל) to them. The Gemara describes how delicious they were:- Rav Yochanan would eat vast quantities and swear that he had not satisfied his hunger.- Reish Lakish would eat them until he became delirious and needed others to bring him home."
      },
      {
        "id": 1,
        "title": "The berachah of מעין שלש",
        "paragraph": "The Gemara discusses the text of the berachah of מעין שלש when recited on fruits of theשבעת המינים.- In Eretz Yisroel the conclusion of the berachah for fruits is על פירותיה.- In the Diaspora the berachah concludes with   על הפרות ."
      },
      {
        "id": 2,
        "title": "בורא נפשות",
        "paragraph": "The Gemara discusses which foods require a Borei Nefashos as an after-berachah:- Rav Yitzchak bar Avdimi said in the name of Rav: On eggs and meat but not on vegetables.- Rebbe Yitzchak: Even on vegetables but not on water.- Rav Pappa: Even on drinking water."
      }
    ],
    "siman": {
      "title": "Mud",
      "paragraph": "The Jew in chutz l’aretz had just concluded his berachah of מעין שלש with the words על הפרותwhen he began to reminisce fondly about trekking through the mud in Eretz Yisroel to eat the fruits of Genosar and making a בורא נפשות on its water."
    }
  },
  {
    "daf": 45,
    "data": [
      {
        "id": 0,
        "title": "The source for making a zimun",
        "paragraph": "The Gemara seeks the source for the Mishnah’s ruling that three people who eat bread together are obligated to join in a zimun: - Rav Assi cites the pasuk גדלו לה' אתי ונרממה שמו יחדיו – Declare (plural) the greatness of Hashem with me and let us exalt His name together.- R’ Abahu cites the pasuk כי שם ה' אקרא הבו גדל לאלקינו – When I call out the Name of Hashem, ascribe (plural) greatness to our G-d. - The verses describe one person talking to more than one person, implying a minimum of three."
      },
      {
        "id": 1,
        "title": "Can two people make a zimun?",
        "paragraph": "The Gemara inquires whether two people who eat together are permitted to make a zimun, even if they are not obligated to. -  Rav holds that two people are permitted to make a zimun, but R’ Yochanan holds they are not. The verse of גדלו  implies that two additional people are called to form the quorum, but two people alone lack the requisite number of דעות (minds) to form a zimun."
      },
      {
        "id": 2,
        "title": "When part of a group wants to make a zimun",
        "paragraph": "When three people eat bread together and two of them finish while the other is still eating, the third is expected to interrupt his meal to join in the zimun. But when only one of them finishes first, the other two are not obligated to interrupt their meal to make a zimun on his behalf."
      }
    ],
    "siman": {
      "title": "Monopoly",
      "paragraph": "Two of the three fathers were tired of waiting for their children’s monopoly game to end, so they forced the third one to join their zimun and declare Hashem’s greatness, and resolved that next time that only the two of them would eat together so as not to be obligated in a Zimun."
    }
  },
  {
    "daf": 46,
    "data": [
      {
        "id": 0,
        "title": "Who breaks bread and who leads the bentching?",
        "paragraph": "R’ Yochanan says in the name of R’ Shimon bar Yochai that the baal habayis breaks the bread and a guest leads Birkas Hamazon. -  The reason the baal habayis is the one to break the bread is because he will be generous and cut larger pieces, which a guest would not be comfortable doing. -  The reason a guest leads the zimun is to enable him to bless the host by saying the Yehi Ratzon paragraph toward the end of bentching.The Yehi Ratzon includes the following requests:   a.      That the host not be embarrassed in either this world or the next.   b.      That he be successful with all his property.   c.      That host and guests never have thoughts of sin."
      },
      {
        "id": 1,
        "title": "How far does the berachah of the zimun extend?",
        "paragraph": "There is a machlokes regarding how far the berachah of the zimun extends:        - Rav Nachman says it extends up to and including the leader’s response of נברך.        - Rav Sheishess says it includes the first berachah of הזן. According to Rashi, Rav     Sheishess holds that the first berachah of Birkas Hamazon proper is   הארץ. (Tosafos and other Rishonim interpret Rav Sheishess differently)."
      },
      {
        "id": 2,
        "title": "הטוב והמטיב is a דרבנן",
        "paragraph": "The Gemara brings different proofs that the blessing הטוב ומטיב is not Biblical:-          Rav Yosef sees it from the halachah that laborers may delete it.-          Rav Yitzchak bar Shmuel in the name of Rav derives it from the fact that it is next to   the berachah בונה ירושלים, yet it still begins with the word “ברוך.” Were it   Biblical, it wouldn’t require “ברוך,” since it would be considered aברכה סמוכה   לחברתה .-          Rav Nachman derives it from the halachah that it is not recited in the house of a   mourner."
      }
    ],
    "siman": {
      "title": "Cows",
      "paragraph": "Farmer Brown’s cow themed bentcher guided the one leading the Zimun to go up until the end of HaZan, a reminder to bless Farmer Brown to have lots of prize winning cattle (after all he did give big pieces of bread out at the beginning of the meal), and instructions for his farmhands to skip HaTovVeHaMativand get back to the fields."
    }
  },
  {
    "daf": 47,
    "data": [
      {
        "id": 0,
        "title": "Replying amein is part of the berachah procedure",
        "paragraph": "After reciting hamotzi, the one who made the berachah is not permitted to break the bread until the listeners finish saying amein. (The Gemara had earlier taught that the berachah must be finished before the bread is broken; here it teaches that replying amein is considered part of the berachah procedure [Rashi])."
      },
      {
        "id": 1,
        "title": "Incorrect ways to say Amein",
        "paragraph": "A Baraisa lists the incorrect ways to respond amein, with Ben Azzai warning of the consequences for doing so:a.       אמן חטופה – Amein Chatufah (snatched): The aleph is pronounced with a sheva instead of a kamatz gadol. One who does this will have his days snatched away. b.      אמן קטופה – Amein Ketufah (abbreviated): The nun at the end is not enunciated clearly, so that it sounds like “Amei.” One who does this will have his days abbreviated. c.       אמן יתומה – An orphaned amein: One says amein without hearing the berachah. Doing this will cause one’s children to be orphaned. d.      לא יזרוק ברכה מפיו – One should not throw the blessing from his mouth, i.e. not say it hastily. -          Ben Azzai concludes that whoever is lengthy with his amein (meaning he pronounces it properly) will merit length of days and years."
      },
      {
        "id": 2,
        "title": " Who is considered an am haaretz?",
        "paragraph": "A Baraisa lists a number of opinions regarding who is considered an am haaretz:          - R’ Eliezer – Anyone who does not recite Shema in the morning and evening.         - R’ Yehoshua – Anyone who does not put on tefillin.         - Ben Azzai – Anyone who does not wear tzitzis.         - R’ Nassan – Anyone who does not have a mezuzah on his door’s entrance.         - R’ Nassan bar Yosef – Anyone who has sons and does not raise them to learn Torah.         - Others – One who did not engage in group discussions to discern the underlying reasons and         applications of the Chumash and Mishnah (Rashi)."
      }
    ],
    "siman": {
      "title": "Maze",
      "paragraph": "The only way for the contestants to escape the maze while being chased by a group of non-tzitzis wearing amei haaretz, was for everybody to finish pronouncing a proper amein and then break bread."
    }
  },
  {
    "daf": 48,
    "data": [
      {
        "id": 0,
        "title": "Minimum number of bread-eaters in a zimun",
        "paragraph": "There is a machlokes regarding how many of the men in a ten-man zimun are required to have eaten bread:-          R’ Yirmiyah says a simple majority of six.-          R’ Zeira regretted that he did not inquire about the case of six and was concerned that possibly a more noticeable majority of seven was required.The Gemara brings the halachah that one who ate vegetables or wine can join in a zimun of ten (assuming there were seven who ate bread) but cannot lead the zimun unless he ate a kezayis of food produced from grain."
      },
      {
        "id": 1,
        "title": "Who wrote various berachos in Birkas Hamazon",
        "paragraph": "The Gemara details how the text of Birkas Hamazon was formulated:-         Moshe composed the berachah of Hazan at the time the manna fell.-         Yehoshua composed the berachah for Eretz Yisrael when they entered the land.-         David and Shlomo composed Boneih Yerushalayim.David, who conquered Yerushalayim, composed the segment, “Have mercy, please, Hashem our G-d, on Israel Your people and on Yerushalayim your city.”Shlomo, who built the Beis Hamikdash, composed the segment, “and on the great and holy House.”-         The Sages of Yavneh composed Hatov VeHameitiv on the day the slain Jews of Beitar were finally allowed to be buried.Hatov (Who is good) refers to the miracle that the bodies did not decay.VeHameitiv (and Who bestows good) refers to the kindness that the bodies were allowed to be buried."
      },
      {
        "id": 2,
        "title": "The source for the various berachos in Birkas Hamazon",
        "paragraph": "A Baraisa breaks out the Torah verse (Devarim 8:10) that serves as the source for the blessings in Birkas Hamazon:-          Hazan – ואכלת ושבעת וברכת – And you will eat, be satisfied and bless-          Hazimun – את ה' אלקיך – Hashem your G-d-          Haaretz – על הארץ – on the land-          Boneih Yerushalayim – הטובה  – the good [land]-          Hatov VeHameitiv – אשר נתן לך – which I have given you"
      }
    ],
    "siman": {
      "title": "Brainiacs",
      "paragraph": "The seven brainiacs would only let three non-bread eaters join their zimunif they could match the right author to each berachah of Birkas Hamazon, as well as identify the source of each berachah."
    }
  },
  {
    "daf": 49,
    "data": [
      {
        "id": 0,
        "title": "Don’t conclude berachah with two subjects",
        "paragraph": "The Gemara explains that we don’t conclude a berachah with two subjects because we don’t perform mitzvos in bundles – אין עושין מצות חבילות חבילות. For example, we don’t conclude the berachah of Birkas Hamazon with בונה ירושלים (Builder of Yerushalayim) andמושיע ישראל  (Savior of Israel)."
      },
      {
        "id": 1,
        "title": "Forgettingיעלה ויבא of Rosh Chodesh in tefillah and birkas hamazon",
        "paragraph": "Rav Nachman explains logically why when one forgets to say יעלה ויבא in his Rosh Chodesh tefillah he must repeat it, but when he forgets to say it in Rosh Chodesh bentching, he doesn’t repeat it:•Tefillah is obligatory, so it must be repeated with the proper mentioning of Rosh Chodesh.•Eating bread on Rosh Chodesh is not obligatory, so there is no need to repeat bentching ifיעלה ויבא was forgotten."
      },
      {
        "id": 2,
        "title": "Minimum amount of bread to be obligated in joining a zimun",
        "paragraph": "The Gemara explains the machlokes between R’ Meir and R’ Yehudah regarding the minimum amount of bread one must eat to be obligated in joining a zimun. •R’ Meir says it’s a כזית, because he interprets ואכלת as referring to אכילה and ושבעת as referring to שתיה, and the minimum shiur for אכילה is a כזית. •R’ Yehudah says it’s a כביצה, because he interprets the wordsואכלת ושבעת  together as referring to אכילה שיש בה שביעה (the eating of an amount that satiates), which is a כביצה."
      }
    ],
    "siman": {
      "title": "Meat/Butcher",
      "paragraph": "The extremely generous butcher sent bundles and bundles of mitzvah meat and כביצים of bread for the זימון  to the Yeshiva’s Rosh Chodesh party because they never forget to say יעלה ויבא in the bentching."
    }
  },
  {
    "daf": 50,
    "data": [
      {
        "id": 0,
        "title": "Talmid chacham or ignoramus making berachos",
        "paragraph": "The Gemara teaches that we can tell whether a person is a talmid chacham or an ignoramus from the way he makes berachos.•If he does any of the following, he is considered an ignoramus:•Instead of saying ובטובו חיינו (and through Whose goodness we live), he says ומטובו חיינו (and from Whose goodness we live), which minimizes Hashem’s bestowal of goodness.•He says ובטובו חיים (…and through Whose goodness they live), since he is excluding himself.•Instead of saying נברך שאכלנו משלו (Let us bless [He] of Whose we have eaten) he saysלמי שאכלנו משלו  (to the One of Whose we have eaten), since it implies that he is blessing one of many possible providers.•Instead of saying ברוך שאכלנו משלו (Blessed is [He] of Whose we have eaten) he saysעל המזון שאכלנו (…for the food we have eaten) since it appears as if he is blessing the food and not its Provider."
      },
      {
        "id": 1,
        "title": "One bentched without making a zimun",
        "paragraph": "If a group of three ate bread together and one of them recited Birkas Hamazon on his own without a zimun, he may join the other two in a zimun so they can fulfill their obligation, but he does not fulfill his own obligation, because there is no such thing as a retroactive zimun (זימון למפרע)."
      },
      {
        "id": 2,
        "title": "One forgot to make a berachah",
        "paragraph": "If one mistakenly put food in his mouth without reciting a berachah:•If it’s a liquid, he should swallow it.•If it’s a food that won’t be made repulsive by being spit out, he should spit it out, make the berachah and then eat it.•If spitting it out would make the food repulsive, he should shift it to the side of his mouth, make the berachah and then eat it."
      }
    ],
    "siman": {
      "title": "Nincompoop",
      "paragraph": "The nincompoop who always forgot to make berachos and join in a zimun, was declared a total ignoramus when the Rabbi overheard all the textual changes he made in his bentching."
    }
  },
  {
    "daf": 51,
    "data": [
      {
        "id": 0,
        "title": "Forgot to make a berachah",
        "paragraph": "If one forgot to make a berachah before he ate, he should make one when he remembers and continue eating. If he has finished eating, he no longer has the opportunity to make a berachah."
      },
      {
        "id": 1,
        "title": "Ten requirements for the כוס של ברכה",
        "paragraph": "The Gemara lists ten requirements of the כוס של ברכה (the cup of blessing):1.It must be washed on the inside – הדחה2.And rinsed on the outside – שטיפה3.It must be fresh – חי4.And full – מלא5.It must be crowned – עיטורOpinion 1 – the one who recites Birkas Hamazon should surround himself with students while doing itOpinion 2 – the cup must be surrounded with other cups of wine (done during second cup of wine)6.The one who recites Birkas Hamazon should cover himself with a cloak while sitting, or spread a scarf over his head – עיטוף7.It should be taken with both hands – נוטלו בשבתי ידיו8.And then placed in the right hand – ונותנו בימין9.It should be raised a tefach off the ground – מגביהו מן הקרקע טפח10.One should concentrates his eyes on it while reciting Birkas Hamazon - נותן עיניו בו"
      },
      {
        "id": 2,
        "title": "The מלאך המות teaches three things",
        "paragraph": "The מלאך המות (Angel of Death) told R’ Yehoshua ben Levi three things:Do not take your shirt in the morning from the hand of the butler.Do not have your hands washed by someone who has not washed his own hands.Do not stand in front of women when they are returning from a funeral, because the Angel of Death dances before them with his sword in hand and has permission to harm those he meets."
      }
    ],
    "siman": {
      "title": "Gnawing beaver which connects to beaver pelt hat.",
      "paragraph": "The eccentric who insisted on donning his beaver pelt hat when holding up his freshly rinsedכוס של ברכה got such a fright when he saw the מלאך המות standing by his butler who was holding his shirt, that he started drinking the wine without making a berachah."
    }
  },
  {
    "daf": 52,
    "data": [
      {
        "id": 0,
        "title": "Kiddush hayom or the berachah on wine",
        "paragraph": "The Gemara resolves a seeming contradiction in Beis Shammai.In the Mishna on 51b, Beis Shammai holds that the beracha on kedushas hayom (sanctity of the day) precedes the berachah on the wine because it is the sanctity of the day which is cause for the wine to be brought to the meal.Yet in a Beraisa on 52a, Beis Shammai holds that the berachah on the wine precedes the berachah of Havdalah, which addresses the nature of the day. The Gemara answers that according to Beis Shammai there is no contradiction. When it comes to bringing in Shabbos, the more we advance it, the better, therefore the berachah on the day comes first.When it comes to ending the Shabbos day, the more we more we delay it, the better, therefore  the berachah of Havdalah comes after the berachah on the wine."
      },
      {
        "id": 1,
        "title": "What a tamei liquid does to a utensil",
        "paragraph": "A tamei liquid that touches the outside of the keli (utensil) renders the outside tamei but the inside, rim, and handle is tahor. But if the tamei liquid touches the inside of the keli (utensil) then the whole keli becomes tamei."
      },
      {
        "id": 2,
        "title": "Why Beis Hillel holds it better to put wet napkin on a cushion",
        "paragraph": "There is no requirement of washing the hands for chullin (non-consecrated food) from the Torah since the hands are not considered a separate entity from the body and cannot contract tumah from a rishon. It is only a Rabbinic law that they are treated separately and considered a sheni to require someone to wash and remove the tumah before eating bread. This explains why Beis Hillel holds that it is of greater concern that the liquid in a wet napkin will lead to food becoming tamei when placed on a table, than the liquid in the wet napkin leading to hands becoming tamei when placed on a cushion."
      }
    ],
    "siman": {
      "title": "Newbie",
      "paragraph": "The newbie to Yiddishkeit had finally gotten down the order of berachos for Kiddush and Havdallah when he was introduced to the metaphysics of tamei liquids touching utensils and wet napkins touching his hands."
    }
  },
  {
    "daf": 53,
    "data": [
      {
        "id": 0,
        "title": "Which light and spices one can make the berachah on?",
        "paragraph": "The berachah of בורא מאורי האש is recited only on a flame lit for illumination. If it was lit solely for other purposes, such as cooking, or to honor a prominent person sitting in a beis haknesses or beis midrash, or to honor the deceased at his funeral, no berachah is recited. Similarly, a berachah of בורא מיני בשמים is recited only for a fragrance designated for the enjoyment of its smell. A fragrance used for other purposes, such as perfuming clothing or removing the odor of a decaying corpse, does not merit a berachah."
      },
      {
        "id": 1,
        "title": "What is considered deriving benefit from the light?",
        "paragraph": "There is a machlokes regarding the Mishnah’s meaning when it says one may not make a berachah over the flame until he benefits from its illumination – אין מברכין על הנר עד שיאותו.•Rav Yehuda in the name of Rav says that one does not actually have to benefit from the light—the berachah is made as long as the light is strong enough that one could benefit from it, even though he is standing far away and can’t benefit from it.•Rava says that the berachah is only made when he is close enough to the light that he could benefit from it. This is the basis for looking at one’s fingernails when making the berachah on the flame in Havdalah. Distinguishing between the fingernail and its surrounding skin is similar to discerning the difference between two different small coins or two different weights that are similar in appearance."
      },
      {
        "id": 2,
        "title": "Making the berachah vs. saying amein",
        "paragraph": "There is a machlokes Tanna’im regarding whether it is preferable to make a berachah or to answer amein to it.•One Baraisa holds that saying amein is greater. R’ Nehorai likens it to battle, where the common soldiers engage the enemy first, followed by the elite troops, who come in to seal the victory.•Another Baraisa holds that the Heavenly emissaries hasten more to bestow reward on the one making the berachah than on the one answering amein."
      }
    ],
    "siman": {
      "title": "A Nigerian Prince",
      "paragraph": "The Nigerian Prince held his fingers up to benefit from the light that had been lit for illumination (not for his honor) and made a berachah on all of his riches while his champion servants proudly proclaimed amein."
    }
  },
  {
    "daf": 54,
    "data": [
      {
        "id": 0,
        "title": "Berachos in places where miracles occurred",
        "paragraph": "All are obligated to make a berachah when seeing a place where  miracles were performed for the masses, but only an individual is obligated to make a berachah on a miracle performed for him alone."
      },
      {
        "id": 1,
        "title": "Eight places where miracles occurred",
        "paragraph": "A Baraisa enumerates eight places where one is obligated to recite a berachah for the miracles performed there.1.Where the Yam Suf was crossed.2.Where the Jordan was crossed.3.At the crossing of the Canyons of Arnon(מעברות נחלי ארנון) , where the Amorites waiting in ambush were miraculously crushed in the mountains.4.At the stones of Elgavish in the descent of Beis-Choron. These were the hailstones that were suspended in midair for the sake of Moshe and later came down for the sake of Yehoshua when he defended Givon in the battle with the Emori.5.At the stone that King Og of Bashan wanted to throw at the nation.6.At the stone that Moshe sat on during the war with Amalek.7.At the remains of Lot’s wife.8.At the wall of Jericho, which was swallowed. The Gemara elaborates on the eight miracles."
      },
      {
        "id": 2,
        "title": "Bentching gomel and having a shomer (guardian)",
        "paragraph": "Rav Yehudah said in the name of Rav that four types of people must give thanks and bentch gomel, because they survived dangerous situations:•One who travels across the sea.•One who travels through a wilderness.•One who recovers from an illness.•One who is freed from prison.  Rav Yehudah further taught that three types of people need protection from mazikin (demons):A sick person is more vulnerable, because his mazel has turned for the worse.A chosson and kallah are also in danger, because they evoke the jealousy of mazikin."
      }
    ],
    "siman": {
      "title": "Noodles",
      "paragraph": "The caterer transporting spaghetti noodles across the desert bentched gomel after finally delivering them to the well-guarded chosson and kallah, who were busy making berachos in the eight places where miracles had occurred."
    }
  },
  {
    "daf": 55,
    "data": [
      {
        "id": 0,
        "title": "Three things that prolong life",
        "paragraph": "The Gemara analyzes the three actions which, when prolonged, prolong one’s life, according to Rav Yehudah (54b):•Spending a long time in tefillah.•Spending a long time at the table, thereby affording the poor a greater chance to come and share in the meal.•Spending a long time in the bathroom."
      },
      {
        "id": 1,
        "title": "Betzalel’s wisdom",
        "paragraph": "The Gemara discusses Betzalel’s wisdom:•He was called Betzalel because “he lived in the shadow of G-d” (בצל קל), as he knew the order in which Hashem had commanded the building of the Mishkan—first the Mishkan, then the vessels—despite Moshe changing the order in his instructions to him.••He knew how to join together the letters of the Torah in the same way they were combined to create heaven and earth."
      },
      {
        "id": 2,
        "title": "Dreams",
        "paragraph": "The daf discusses dreams at length:•A dream that has not been interpreted is like an unread letter.•One who is troubled by a dream should have it remedied in the presence of three people. The text of הטבת חלום is presented. ••One who doesn’t understand the meaning of his dream should stand before the kohanim during Birkas Kohanim and recite a supplication, aiming to finish it as the congregation responds amein, so that his supplication will be affirmed together with the blessing of the kohanim. We are accustomed to doing this during Mussaf on Yom Tov."
      }
    ],
    "siman": {
      "title": "Speed Limit – 55",
      "paragraph": "Rabbi Betzalel dreamt that he planted a speed limit sign in the middle of shul to remind the congregants that the key to long life is spending more time in tefillah, and his congregants begged him to do Hatavos Chalom."
    }
  },
  {
    "daf": 56,
    "data": [
      {
        "id": 0,
        "title": "People dream about what they were thinking about",
        "paragraph": "To illustrate the teaching (on 55b) that a person dreams about what he was thinking of during the day (אין מראין לו לאדם אלא מהרהרי לבו), the Gemara cites the incident of Caesar asking R’ Yehoshua bar R’ Chananya what he would dream of that night. R’ Yehoshua told him that he would dream of being pressed into service by the Persians in a degrading way. Caesar thought about the distressing vision all day and then dreamt of it at night."
      },
      {
        "id": 1,
        "title": "Bar Hedya, the Dream Interpreter",
        "paragraph": "The Gemara relates the story of Bar Hedya, the dream interpreter, who gave positive interpretations to those who paid for his services and negative ones to those who didn’t. Abaye and Rava shared many similar dreams and had them interpreted by Bar Hedya. Since Abaye paid, his dreams were always interpreted for good; Rava did not pay, and his dreams were interpreted for ill. Finally, Rava discovered—in a book owned by Bar Hedya—that “dreams go according to the mouth” (כל חלומות הולכין אחר הפה), meaning according to the way they are interpreted. Rava cursed him and Bar Hedya fled, eventually meeting a gruesome death at the hands of the Roman royal court."
      },
      {
        "id": 2,
        "title": "The meaning of a well in a dream",
        "paragraph": "The Gemara discusses the symbolic meaning of items appearing in a dream. If one dreams of a well:•R’ Chanina says he will see peace.•R’ Nassan says he will find Torah.•Rava says he will find life."
      }
    ],
    "siman": {
      "title": "Shusher in shul going nu nu",
      "paragraph": "The shusher in shul was going bananas trying to nu nuthe guy giving nightmares to the President about losing the election while the dream interpreter was telling the cheapskate he was going to fall into a well."
    }
  },
  {
    "daf": 57,
    "data": [
      {
        "id": 0,
        "title": "Visions of tefillah in dreams",
        "paragraph": "The Gemara lists dream visions that include elements of tefillah, along with their meaning:•One who responds \"אמן יהא שמיה רבה מברך\" in a dream is assured of being destined for Olam Haba. •One who recites Krias Shema in a dream is fit to have the Shechinah dwell upon him, except that his generation doesn’t merit having it happen.••One who dreams of laying tefillin should anticipate growing in greatness."
      },
      {
        "id": 1,
        "title": "Waking up with a passuk",
        "paragraph": "R’ Yochanan says that if one wakes up and a verse “fell into his mouth,” i.e. immediately came to mind, this is a type of minor prophecy."
      },
      {
        "id": 2,
        "title": "One sixtieth",
        "paragraph": "Five things are considered a sixtieth of something else:1.Fire is a sixtieth part of Gehinnom.2.Honey is a sixtieth part of the manna.3.Shabbos is a sixtieth part of Olam Haba.4.Sleep is a sixtieth part of death.5.A dream is a sixtieth part of prophecy."
      }
    ],
    "siman": {
      "title": "Pinocchio’s nose",
      "paragraph": "Pinochio’s nose began to grow when he claimed he was saying Krias Shema in his dream and then woke up with a passuk in his mouth, until he was reminded wood burns in fire which is a sixtieth part of Gehinnom."
    }
  },
  {
    "daf": 58,
    "data": [
      {
        "id": 0,
        "title": "ברוך חכם הרזים",
        "paragraph": "One who sees a multitude of Jews (600,000) recites ברוך חכם הרזים (Blessed [are You] … Sage of the secrets), acknowledging that Hashem knows everyone’s secret thoughts."
      },
      {
        "id": 1,
        "title": "Rav Sheishess and the king",
        "paragraph": "The Gemara elaborates on the importance of greeting a king,(which we initially learned on daf ט) relating the incident of the blind Rav Sheishess, who was able to discern when the king passed by in his procession. When the first two troops passed by, each followed by loud noise, Rav Sheishess knew that the king was not yet approaching. After the third troop passed by and it fell silent, he knew that the king was about to pass. Rav Sheishess explained that he knew this from the verses (Melachim I 19:11-12) describing how Eliyahu discerned Hashem’s presence not in the midst of three loud noises, (great wind, an earthquake and a fire) but rather when there was a still, thin sound (קול דממה דקה). He said, since “earthly royalty reflects Heavenly royalty,” there must be a similar chain of events when an earthly king appears."
      },
      {
        "id": 2,
        "title": "שהחיינו on a friend",
        "paragraph": "One who sees a friend after a lapse of thirty days recites שהחיינו; if the lapse is twelve months, he says ברוך מחיה המתים (Blessed [are You] … Who resurrects the dead(."
      }
    ],
    "siman": {
      "title": "נח – Zookeeper",
      "paragraph": "The Zookeeper greeted his friend the king who he hadn’t seen in 30 days with aשהחיינו and over his procession of 600,000 a ברוך חכם הרזים, while everyone else stood still in silence."
    }
  },
  {
    "daf": 59,
    "data": [
      {
        "id": 0,
        "title": "The berachah on a rainbow",
        "paragraph": "There is a dispute regarding the berachah to recite on seeing a rainbow (though one should not stare at it).    - The Gemara says the berachah is ברוך זוכר הברית – Blessed [are You] … Who remembers the covenant.    - R’ Yishmael the son of R’ Yochanan ben Beroka says the ending should beנאמן בבריתו וקיים במאמרו – Who is trustworthy in His covenant and fulfills His word.    - Rav Pappa rules that we accommodate both views by incorporating both endings:ברוך זוכר הברית ונאמן בבריתו וקיים במאמרו – Blessed [are You] … Who remembers the covenant and is trustworthy in His covenant and fulfills His word."
      },
      {
        "id": 1,
        "title": "Birkas Hachamah",
        "paragraph": "One who sees the sun at the beginning of its 28-year cycle, when it returns to its original position at its creation, recites Birkas Hachamah, the blessing on the sun: ברוך עושה בראשית – Blessed [are You] … Who makes the work of creation."
      },
      {
        "id": 2,
        "title": "הטוב והמטיב",
        "paragraph": "One who drank wine at a meal and is then offered a superior wine makes the berachahהטוב והמטיב – [Blessed are You] … Who is good and does good."
      }
    ],
    "siman": {
      "title": "Knight in shining armor",
      "paragraph": "The knight in shining armor stood nobly at the bottom of the rainbow, as he blessed the sun after 28 years by raising his cup of superior wine making a טוב והמטיב."
    }
  },
  {
    "daf": 60,
    "data": [
      {
        "id": 0,
        "title": "דיין האמת והטוב והמטיב",
        "paragraph": "The Gemara illustrates the meaning of making a berachah of דיין האמת (the True Judge) on a calamity that has the potential to have a favorable outcome, and making the berachah ofהטוב והמטיב (Who is good and does good) on a favorable occurrence that has the potential for a calamitous outcome:    - One should recite דין האמת on his field being flooded, even though there will be a favorable outcome in that the accumulation of sediment will improve his land.   - One should recite הטוב והמטיב on finding an object, even though the King might hear of it and take it from him."
      },
      {
        "id": 1,
        "title": "The conclusion of אשר יצר",
        "paragraph": "The Gemara details the various berachos of Hamapil, Asher yatzar, Elokai neshamah and the 15 birkas hashachar.- There is a machlokes regarding the concluding berachah of Asher yatzar: - Rav says it should be רופא חולים – Who heals the sick. - Objecting that this would portray everyone as sick, whereas healthy people also recite the berachah, Shmuel holds that the proper ending is רופא כל בשר – Who heals all flesh. - Rav Sheishess says it should be מפליא לעשות – Who does wonders. - Rav Pappa rules to incorporate both the endings of Shmuel and Rav Sheishess, resulting in our text of רופא כל בשר ומפליא לעשות – Who heals all flesh and does wonders."
      },
      {
        "id": 2,
        "title": "כל דעביד רחמנא לטב עביד",
        "paragraph": "R’ Akiva said that one should always be accustomed to say כל דעביד רחמנא לטב עביד – Whatever the Merciful one does, He does for the best. The Gemara relates the story of R’ Akiva traveling and being denied lodging in a city. He saidכל דעביד רחמנא לטב  and went to sleep in a field. That night a wind blew out his lamp, a cat ate his rooster and a lion ate his donkey, after which he repeated כל דעביד רחמנא לטב.The next day R’ Akiva learned that an army had come by the previous night and captured the city that had denied him lodging. Had his lamp had not blown out, the soldiers would have seen him and captured him. Likewise, had his rooster and donkey not been eaten, the soldiers would have discovered him after hearing his animals make noise."
      }
    ],
    "siman": {
      "title": "Smiley Face Stickers",
      "paragraph": "The forever optimistic farmer who made a דיין האמת on his flooded field was putting smiley face stickers on his dead rooster and donkey and in his siddur next to birkas hashachar and asher yatzar."
    }
  },
  {
    "daf": 61,
    "data": [
      {
        "id": 0,
        "title": "How Chavah was fashioned",
        "paragraph": "There is a machlokes between Rav and Shmuel concerning how Chavah was fashioned:-  One opinion is that man was created as a double figure, male and female, and that Hashem fashioned Chavah from the female figure.-  The pasuk of זכר ונקבה בראם – He created them male and female is initially brought in support of this view. - The other opinion is that she was fashioned from the tail. -The pasuk of ויבן ה' אלקים את הצלע אשר לקח מן האדם  – And He built the side that He had taken from man, seems to support this view. If the woman already existed, there would have been no need to build her."
      },
      {
        "id": 1,
        "title": "The concept of a בינוני",
        "paragraph": "Rabbi Yosi Haglili says that the righteous are ruled by their yetzer tov, the evil by their yetzer hara, and average people  (בינונים)are ruled by both.When Abaye heard Rava say that he considered himself an average person, he said that by that standard, not a person in the world could be considered righteous."
      },
      {
        "id": 2,
        "title": "R’ Akiva’s response to Pappus ben Yehudah",
        "paragraph": "The Gemara relates the story of R’ Akiva’s imprisonment and subsequent execution, during which— with his dying breath—he proclaimed the אחד of Krias Shema. Before being imprisoned, as he was giving a shiur, R’ Akiva was asked by Pappus ben Yehudah if he feared the wicked regime, which had forbidden the teaching of Torah. R’ Akiva answered with a mashal of a fox trying to persuade fish to save themselves from being pursued in the water by coming up onto the land. The fish replied that if in the environment that supported their life they were afraid, shouldn’t they be even more afraid in an environment that was inimical to their life? Similarly, the Jewish people’s life support is Torah learning, as it says,כי הוא חייך וארך ימיך – For it is your life and the length of your days. Without Torah learning, we would be in even greater danger. Eventually, when Pappus was thrown into prison with R’ Akiva for a false accusation, he said, “Fortunate is R’ Akiva, who was apprehended on words of Torah! Woe to Pappus, who was apprehended on account of meaningless words!”"
      }
    ],
    "siman": {
      "title": "A saw",
      "paragraph": "The magician successfully sawed the man into two, one-half male and one-half female but was booed as a benoini performer because he couldn’t make the fish jump out of the fishbowl."
    }
  },
  {
    "daf": 62,
    "data": [
      {
        "id": 0,
        "title": "Not wiping oneself with the right hand",
        "paragraph": "A significant part of the daf focuses on proper and modest behaviors in the bathroom.A number of reasons are given as to why the right hand should be given honor and not be used for the base purpose of wiping oneself:a. The Torah was given with Hashem’s right hand as it says – מימינו אש דת למו– From His right hand, the fire of the Law was given.b. It is generally used for noble act of eating. c. One ties tefillin on his left arm with one’s right hand.d. One shows the cantillation notes of the Torah with his right hand. The hand used for a holy purpose should not be used for a profane one."
      },
      {
        "id": 1,
        "title": "Dishonoring clothing",
        "paragraph": "Whoever dishonors clothing in the end will not benefit from them – כל המבזה את הבגדים סוף אינו נהנה מהם.This is learned from the incident when Dovid quietly cut off the corner of Shaul’s cloak when Shaul went into a cave to discreetly relieve himself. Dovid did this to demonstrate that he had been able to cause greater harm to Shaul but chose not to. Nevertheless, since he dishonored Shaul’s garment, Dovid was punished in his later years when his own garments did not provide him warmth."
      },
      {
        "id": 2,
        "title": " Taking shortcuts through a shul",
        "paragraph": "Although one is not permitted to use a shul as a shortcut, if one initially entered to daven he may leave through a different exit even though it will end up being a shortcut."
      }
    ],
    "siman": {
      "title": "Submarine captain",
      "paragraph": "The submarine captain that was famous for doing everything with his right hand with his left one tied behind his back, reprimanded his officers for not keeping their uniforms clean and for taking shortcuts through the ship’s shul."
    }
  },
  {
    "daf": 63,
    "data": [
      {
        "id": 0,
        "title": "Small but fundamental passuk",
        "paragraph": "Bar Kapppara asked the following question: What is a small passuk upon which all of the fundamentals of the Torah depend? He answered:בכל דרכך דעהו והוא יישר ארחתך– In all your ways you must know Him, and He will straighten your paths.Rava explained that “In all your ways” includes even one engaged in a transgression. This passuk teaches that there are times when Hashem’s honor demands that one perform a transgression.-(An example of this is when Eliyahu Hanavi brought offerings outside the Beis Hamikdash on Har HaCarmel in the incident with the prophets of Ba’al even though sacrificing outside of the Beis haMikdash is a Torah prohibition)."
      },
      {
        "id": 1,
        "title": "Receiving Torah daily",
        "paragraph": "It was taught in a Baraisa that when the Rabbis entered Kerem beYavneh they each opened up their derasha with words in honor of their hosts that housed them (פותחין בכבוד אכסניא).Rebbe Yehuda further opened up his derasha focusing on honoring those who learn Torah with the following passuk, “הסכת ושמע ישראל היום הזה נהיית לעם” – Pay heed and listen, Yisroel, on this day you became a nation.”How does one make sense of this passuk that implies that that the Torah was given on that day, when in fact it was given Torah forty years earlier?Rebbe Yehuda answers that the passuk is coming to teach you that on each and every day the Torah should be as dear to those that study it as on the day it was given on Har Sinai."
      },
      {
        "id": 2,
        "title": "Learning with others",
        "paragraph": "The Gemara says that the word \"הסכת\" teaches – עשו כתות כתות ועסקו בתורה– that one must form groups (asu kitos) and engage in Torah learning because the Torah is only acquired through learning with others.This is in accordance with Rebbe Yossi b’Rebbe Chaninah who said:1. There will be as sword against those who sit alone and learn Torah.2. They will become foolish and make mistakes in judgment.3. They will also come to sin."
      }
    ],
    "siman": {
      "title": "Boys on Segways",
      "paragraph": "The Yeshiva Ketana boys sped to the Beis Midrash on their Segways taking every type of straight path, eager to learn Torah as if it was just given that day and making sure to get the most by learning in groups."
    }
  },
  {
    "daf": 64,
    "data": [
      {
        "id": 0,
        "title": "סיני או עוקר הרים",
        "paragraph": "When the Rabbis in Bavel were looking for new leadership in the academy they asked the Rabbis in Eretz Yisroel which type of leader is preferred, a “Sinai” (סיני) who has a lot of breadth in learning or one who uproots mountains (עוקר הרים) with his sharp analysis? The choice was between Rav Yosef who was a סיני and Rabba who was the עוקר הרים.The Rabbis answered that the סיני takes precedence because his encyclopedic knowledge will enable him to easily discover the solution to most problems. Rav Yosef in the end did not accept the position as the Gemara explains and only became head of the academy twenty-two years later after Rabbah’s death."
      },
      {
        "id": 1,
        "title": "ילכו מחיל אל חיל",
        "paragraph": "R’ Levi bar Chiya said that one who leaves the beis haknesses and immediately enters the beis hamidrash to learn will merit to greet the face of the Shechinah as it says,\"ילכו מחיל אל חיל יראה אל אלקים בציון\" – Go from multitude to multitude, appear before Hashem in Tziyon. The multitudes are referring to those gathered in shuls and those gathered in batei midrashim.Rav Chiya bar Ashi said in the name of Rav that the passuk is referring to talmidei chochomim have no rest in Olam Hazeh or Olam Habah. The multitudes are referring to the batei midrashim in Olam Habah where talmidei chochomin will continue to climb from one level to the next forever increasing their understanding."
      },
      {
        "id": 2,
        "title": "Talmidei chochomim bring shalom",
        "paragraph": "R’ Elazar said in the name of R’ Chanina: Talmidei chochomim increase the peace in the world as it says, וכל בניך למודי ה' ורב שלום בניך – And all your sons will be disciples of Hashem, and abundant will be the peace of your sons. Do not read it as “your sons” (בניך) but “your builders” (בוניך). The passuk is teaching that it is the talmidei chochomin that build the world with their Torah which results in peace in the world."
      }
    ],
    "siman": {
      "title": "סוד - Secret",
      "paragraph": "The Daf Yomi learners secretly reviewed their encyclopedic knowledge of Masechta Berachos as they left the beis haknesses and immediately entered the beis hamidrash to learn, going from one level to the next as they learned from talmidei chochomim who bring peace to the world."
    }
  }
]