[
  {
    "daf": 2,
    "data": [
      {
        "id": 0,
        "title": "What constitutes קינוי and סתירה, and why Masechta Sotah follows Nazir",
        "paragraph": "The opening Mishnah begins by discussing the number of witnesses necessary for קינוי – warning, and סתירה – subsequent seclusion, based on which a wife would have to drink the sotah waters. כיצד מקנא לה – How does he (her husband) warn her? אומר לה בפני שנים אל תדברי עם איש פלוני – If he says to her, “Do not speak with Ploni,” ודברה עמו – and she spoke with him anyway, she does not become a sotah. נכנסה עמו לבית הסתר ושהתה עמו כדי טומאה – But if she entered a secluded house with him after being warned not to do so, and remained for enough time for potential defilement, she is rendered a sotah, becoming forbidden to her husband and in eating terumah. The Gemara opens explaining the placement of Masechta Sotah: למה נסמכה פרשת נזיר לפרשת סוטה – Why was the passage of Nazir placed near the passage of Sotah in the Torah? לומר לך שכל הרואה סוטה בקלקולה  – To tell you that anyone who sees a sotah in her disgrace, יזיר עצמו מן היין – should restrain himself through nezirus from wine."
      },
      {
        "id": 1,
        "title": "The basis and difficulty of matching men and women for marriage",
        "paragraph": "When Reish Lakish would begin to teach Sotah, he would say: אין מזווגין לו לאדם אשה אלא לפי מעשיו – They only pair a woman to a man according to his deeds, as it says:  כי לא ינוח שבט הרשע על גורל הצדיקים – “for the rod of the wicked will not rest on the lot of the righteous.” Rebbe Yochanan said: וקשין לזווגן כקריעת ים סוף – And they are as difficult to pair as splitting the Reed Sea, which he sources. The Gemara asks that this contradicts a statement of Rav:בת קול יוצאת ואומרת  ארבעים יום קודם יצירת הולד, – Forty days before the forming of an embryo, a Heavenly voice goes forth and says:בת פלוני לפלוני בית פלוני לפלוני שדה פלוני לפלוני – “The daughter of Ploni is destined for Ploni, this particular house is destined for Ploni, and this particular field is destined for Ploni.” We see that one’s wife is predetermined at conception before he becomes wicked or righteous!? The Gemara answers: לא קשיא הא בזוג ראשון הא בזוג שני – This is not difficult. This statement that their match is predetermined at conception is regarding the first marriage, whereas this statement that they are paired based on their deeds is regarding the second marriage."
      },
      {
        "id": 2,
        "title": "The basis for the machlokes for how many witnesses to make her drink, and a third opinion",
        "paragraph": "In the Mishnah, Rebbe Eliezer said: מקנא לה על פי שנים – he warns her based on two witnesses present, ומשקה על פי עד אחד או על פי עצמו – and makes her drink the sotah waters based on even one witness, or even his own testimony of her seclusion. Rebbe Yehoshua said that both the קינוי and the סתירה require two witnesses. The Gemara explains the basis of the machlokes: A Baraisa teaches that even a single witness to actual adultery during seclusion is believed. About this law the Torah says \"בה\" – about her, which, according to Rebbe Yehoshua, teaches: בה ולא בקינוי, בה ולא בסתירה – about her defilement a single witness is believed, but not about the warning; about her defilement, but not about the seclusion. Rebbe Eliezer agrees that בה excludes קינוי to require two witnesses but says that a hekesh between סתירה and טומאה (defilement) teaches that one witness suffices for סתירה. Rebbe Yose bar Rebbe Yehudah quotes a reverse version of Rebbe Eliezer, that one witness (or himself) suffices for קינוי, and two witnesses are required for סתירה."
      }
    ],
    "siman": {
      "title": "Siman - House",
      "paragraph": "The sotah who secluded herself in the red Sotah house with a nazir after being warned not to do so, who was leafing through a matchmaking book titled “Heavenly Matches” with a picture of krias Yam Suf on its cover, was spotted by one witness who saw her do סתירה."
    }
  },
  {
    "daf": 3,
    "data": [
      {
        "id": 0,
        "title": "A person’s private wrongdoings are publicized",
        "paragraph": "Rebbe Meir said: אדם עובר עבירה בסתר והקב\"ה מכריז עליו בגלוי – A person commits a sin privately, such as the unfaithful wife, and Hashem “announces” it openly. Rashi explains that Hashem causes the husband to warn her, resulting in its becoming known publicly, as it says: \" ועבר עליו רוח קנאה\" – “And a jealous spirit shall pass over him,” ואין עבירה אלא לשון הכרזה  – and the word \"עבירה\" is an expression of announcing, as it says: \"ויצו משה ויעבירו קול במחנה\"   - And Moshe commanded, and they announced (ויעבירו) throughout the camp. Reish Lakish said: אין אדם עובר עבירה אלא אם כן נכנס בו רוח שטות – A person does not commit a sin unless a spirit of foolishness enters him, as it says: “\"איש איש כי תשטה אשתו תשטה – “A man whose wife strays” (the word \"תשטה\" can be read “sishteh,” that she will act foolishly)."
      },
      {
        "id": 1,
        "title": "Machlokes if the רוח that enters the husband is a רוח טומאה or a רוח טהרה",
        "paragraph": "The academy of Rebbe Yishmael said: אין אדם מקנא לאשתו אלא אם כן נכנסה בו רוח – A person only warns his wife if a “spirit” entered him, which he bases on the passuk. Amoraim disagree about the nature of this “spirit”: The Rabbis said: רוח טומאה – It is a spirit of impurity, but Rav Ashi said: רוח טהרה – It is a spirit or purity, out of an intolerance for promiscuity. The Gemara finds support for Rav Ashi in a Baraisa: וקנא את אשתו – ­Regarding the passuk, “And he shall warn his wife,” Rebbe Yishmael said: רשות – It is merely a permit for him to do so, but not an obligation. Rebbe Akiva said: חובה – It is an obligation to do so if he suspects her. Since these Tannaim hold it is a permit or even an obligation to warn her, it stands to reason that the spirit which caused him to do so is a pure one. The Gemara relates two other cases about which Rebbe Yishmael and Rebbe Akiva disagree if they are a permit or obligation. One is the passuk which teaches that a Kohen becomes tamei for his deceased relatives, and the other is the passuk about keeping a non-Jewish slave permanently. Rebbe Yishmael says each of these is a permit, and Rebbe Akiva considers them obligatory. The Gemara explains the source of the dispute in each case."
      },
      {
        "id": 2,
        "title": "Mitzvos and aveiros go before a person in the future",
        "paragraph": "Rav Shmuel bar Nachmani said in the name of Rebbe Yonasan:כל העושה מצוה אחת בעוה\"ז מקדמתו והולכת לפניו לעוה\"ב – Anyone who does one mitzvah in this world, it precedes him and goes before him in the World to Come (and announces his arrival), as it says: “\"והלך לפניך צדקך – And your righteous deeds will go before you. וכל העובר עבירה אחת בעוה\"ז מלפפתו והולכת לפניו ליום הדין – And anyone who commits one sin in this world, it envelops him and goes before him on the Day of Judgement, as it says, \"ילפתו ארחות דרכם יעלו בתוהו ויאבדו\" – They are enveloped by their paths, enter wasteland, and are lost. Rebbe Eliezer says: קשורה בו ככלב – [The sin] is bound to him like a dog (referring to their remaining attached after mating), as it says regarding Yosef’s refusing the advances of Potiphar’s wife:  \"ולא שמע אליה לשכב אצלה להיות עמה\" –: And he did not listen to her to lie beside her, to be with her.  לשכב אצלה בעולם הזה להיות עמה לעולם הבא – “To lie beside her” means in this world, and “to be with her” means that the sin would be bound to him in the World to Come."
      }
    ],
    "siman": {
      "title": "Siman - Camel",
      "paragraph": "The red-haired camel driver riding his red camel through a camp and publicly announcing an aveirah that a person did with a רוח שטות privately, stopped to give a ride to husband with a רוח טהרה who was on his way to warn his wife, carrying a picture of a sinner who was bound up with a dog."
    }
  },
  {
    "daf": 4,
    "data": [
      {
        "id": 0,
        "title": "Duration of seclusion to be considered a sotah",
        "paragraph": "The Gemara records nine opinions of Tannaim as to the duration of seclusion which renders her a sotah. Later, a second Baraisa is quoted in which five of those Tannaim provide different shiurim, which forces the reinterpretation of some of the statements of this Baraisa. The Gemara later will explain that each Tanna formed his opinion based on his own experience. Rebbe Yishmael said: כדי טומאה, כדי ביאה, כדי העראה, כדי הקפת דקל – the time for defilement to occur, which is the time required for cohabitation, which only means the time required for the first stage of cohabitation, which practically is the time required to circle a palm tree. The Gemara explains that the first three parts of his statement are to clarify that only time for העראה is required, and not the seduction beforehand, nor the entire act. Rebbe Eliezer says: כדי מזיגת הכוס – the time for mixing a cup of wine with water. Rebbe Yehoshua says: כדי לשתותו – the time to drink it, which is explained later to mean to mix and drink it. Ben Azzai says: כדי לצלות ביצה – the time to roast an egg. Rebbe Akiva says: כדי לגומעה – the time to swallow it, which is explained to mean to roast and swallow it. Rebbe Yehudah ben Beseira says: the time to swallow three eggs, which the Gemara explains is the same as Rebbe Akiva’s shiur, but he prefers to describe it with a single term. Three more opinions are recorded."
      },
      {
        "id": 1,
        "title": "The negative implications of not washing one’s hands before eating bread",
        "paragraph": "Rav Avira expounded: כל האוכל לחם בלא נטילת ידים – Anyone who eats bread with washing the hands, כאילו בא על אשה זונה – is as if he had relations with a harlot, as it says: “\"כי בעד אשה זונה עד ככר לחם – for on account of a harlot, until a loaf of bread (reading it as, “on account of eating a loaf of bread improperly, he is considered as if he had relations with a harlot”). Rava objects to the derashah based on the language of the passuk and explains the passuk differently. Rebbe Elazar says: כל המזלזל בנטילת ידים נעקר מן העולם – Anyone who belittles washing the hands is uprooted from the world. Rashi explains that violating Rabbinical enactments warrants death. Rebbe Abahu said: כל האוכל פת בלא ניגוב ידים כאילו אוכל לחם טמא – Anyone who eats bread without drying the hands after washing, is as if he eats tamei bread (because it is repulsive to eat bread with wet hands)."
      },
      {
        "id": 2,
        "title": "The evils of גסות הרוח",
        "paragraph": "Rebbe Yochanan said: כל אדם שיש בו גסות הרוח לבסוף נכשל באשת איש – Anyone who has in him a haughtiness of spirit will ultimately be led to sin with a married woman, as it says: \"ואשת איש נפש יקרה תצוד\" – A married woman, a ‘precious’ soul ensnares. Rava objects to this derashah and explains the passuk differently. Rebbe Yochanan quoted Rebbe Shimon ben Yochai: כל אדם שיש בו גסות הרוח כאילו עובד עבודת כוכבים – Anyone who has in him haughtiness of spirit, is as though he worships idols. Rebbe Yochanan himself said: כאילו כפר בעיקר – It is as though he has denied the fundamental principle of Hashem’s existence. Rebbe Chama bar Chanina said: כאילו בא על כל העריות – It is as though he had relations with all the forbidden relations. Ulla said: כאילו בנה במה – It is as though he built an altar (for idolatry)."
      }
    ],
    "siman": {
      "title": "Siman - Door",
      "paragraph": "When the red Sotah door with nine different clocks on it was opened, it revealed a group of people eating bread even though the netilas yadaim cup and towel were missing, as well as a haughty person bowing down to avodah zara placed on top of an altar he built."
    }
  },
  {
    "daf": 5,
    "data": [
      {
        "id": 0,
        "title": "Various statements of what befalls one who possesses גסות הרוח",
        "paragraph": "This Daf continues with many teachings about one who possesses גסות הרוח – arrogance. Rav Avira said: לסוף מתמעט – [his stature] will eventually be diminished. He expounded further that he does not exist in the world, and what will ensue if he does or does not repent . Rebbi Elazar said: ראוי לגדעו כאשירה – It is fitting that he should be cut down like an asheirah tree (a tree which was worshipped and must be cut down). He also said: אין עפרו ננער – His dust is not aroused for תחיית המתים. He said further: שכינה מיללת עליו – the Shechinah laments over him. Rav Chisda (or possibly Mar Ukva) said: אמר הקדוש ברוך הוא: אין אני והוא יכולין לדור בעולם – Hashem says, “I and he cannot dwell together in the world. Rebbe Alexandri said: אפילו רוח קימעא עוכרתו – Even a small wind will trouble him (i.e., even a small punishment will overwhelm him). Rav Ashi said: לסוף נפחת – He is eventually reduced in stature."
      },
      {
        "id": 1,
        "title": "If a Talmid Chochom should possess a small measure of גסות הרוח",
        "paragraph": "Rav Chiya bar Ashi said in the name of Rav: תלמיד חכם צריך שיהא בו אחד משמונה בשמינית – A Torah scholar must have an eighth of an eighth of haughtiness. Rashi explains that this is in order that he and his teachings will be taken seriously. Rav Huna, son of Rav Yehoshua said: ומעטרא ליה כי סאסא לשבולתא – And this measure of haughtiness crowns him like the beard of a stalk (i.e., it is beautiful and fitting for him). Rav commented: בשמתא דאית ביה, ובשמתא דלית ביה – One who possesses it [more than this amount] is in excommunication, and one who does not possess [even this tiny amount] is in excommunication. Rashi explains that if he is exceedingly humble, the people in his town will not fear him, and he lacks the power to rebuke. Rav Nachman bar Yitzchak objected: לא מינה ולא מקצתה – One should possess neither it nor any part of it. מי זוטר דכתיב ביה תועבת ה' כל גבה לב – Is it insignificant that which is written about it: “An abomination to Hashem is every haughty of heart”?!"
      },
      {
        "id": 2,
        "title": "Why a sotah requires chalitzah but cannot perform yibum",
        "paragraph": "The Mishnah on Daf 2 taught about a sotah: ואם מת – חולצת – If he (her husband) dies without children, she requires chalitzah. The Gemara asks why yibum itself is not allowed. Three version of Rav Yosef’s answer are presented. The first: The passuk says about a woman divorced because of suspected adultery: ויצאה מביתו והלכה והיתה לאיש אחר\"“ - And she left his house and went and married another man. לאיש אחר ולא ליבם – This teaches she may only marry “Another man,” but not a yavam. When Abaye objected that she should not require chalitzah, since the passuk implies she may marry freely, Rav Yosef answered: אילו איתיה לבעל מי לא בעיא גט – If the husband were alive, would she not require a get? We see that the marriage was not dissolved. השתא נמי תיבעי חליצה – Now, too, that he died, she requires chalitzah. In the second version, Rav Yosef reasoned that the Torah required the husband to divorce herדלא ליסתריה לביתיה  – so that his house should not be destroyed, ואת אמרת תתייבם נמי יבומי – and you say she should be taken in yibum?! Although another man may marry her, that is his choice, as opposed to yibum which is imposed upon him. The third version, and an additional explanation from Rava, are presented on the next Daf."
      }
    ],
    "siman": {
      "title": "Siman - Hay",
      "paragraph": "The arrogant man getting covered in piles and piles of red hay and feeling diminished, pointed to the Talmid Chochom who had an eighth of an eighth of haughtiness and asked why he isn’t getting covered too, while the Talmid Chochom ignored him since he was busy overseeing a chalitzah for a Sotah."
    }
  },
  {
    "daf": 6,
    "data": [
      {
        "id": 0,
        "title": "אם נאסרה במותר לה באסור לה לא כל שכן",
        "paragraph": "Rava offers another explanation why a sotah cannot be taken in yibum: קל וחומר, אם נאסרה במותר לה – It is a kal vachomer: If she became forbidden to the husband who was permitted to her, באסור לה לא כל שכן – then to one who was forbidden to her before (the husband’s brother), all the more so she should not become permitted for yibum. Rashi explains that if the marriage was sufficiently damaged to prohibit her to her husband, it certainly should not permit a formerly forbidden yavam. Abaye challenged his reasoning: אשת כהן שנאנסה ומת – A Kohen’s wife who was violated (prohibiting her to her husband), and [the husband] died without children, ויש לו אח חלל – and he has a brother who is a chalal (a disqualified Kohen who is permitted to women forbidden to valid Kohanim), yibum should be prohibited according to Rava’s logic: If she became forbidden to her husband, she certainly should not become permitted to the chalal brother who was forbidden until now. The Gemara answers: אונס בישראל מישרא שרי, וגבי דהאי ליכא איסורא – A violated [wife] is permitted to a Yisroel, and for this [chalal] there is no prohibition. Rava’s logic applies only to willing relations, where the yavam would be subject to the same prohibition as the husband."
      },
      {
        "id": 1,
        "title": "סוטה שיש לה עדים במדינת הים אין המים בודקין אותה",
        "paragraph": "Rav Amram quoted Rav Sheishess: סוטה שיש לה עדים במדינת הים – A sotah about whom there are witnesses overseas who saw her adultery, אין המים בודקין אותה - the waters do not examine her to establish her innocence or guilt. Rav Sheishess brought support from the Mishnah: ושבאו לה עדים שהיא טמאה – and one about whom witnesses came and testified that she is defiled through adultery [cannot eat terumah as a confirmed adulteress]. These witnesses must have testified after she drank (otherwise, the ruling is obvious), and her survival from the sotah waters should demonstrate her innocence, proving that the witnesses are lying about her adultery! Rather, Rav Sheishess must be correct that whenever witnesses to her adultery exist, the waters are ineffective, and that is how she survived. Rav Yosef rejected the proof, because there may be another explanation for her survival (despite her guilt): אימור זכות תולה לה – say that a merit temporarily suspends the punishment for her. The Gemara discusses their dispute. A Baraisa is later quoted to support Rav Sheishess, although a different derashah is brought."
      },
      {
        "id": 2,
        "title": "The minchah of a sotah after testimony of her guilt",
        "paragraph": "Rav Sheishess was challenged from a Mishnah: ואלו שמנחותיהן נשרפות – These are the ones whose minchahs are burned (and are ineligible for offering or redemption): האומרת טמאה אני – One who says, “I am defiled,” confessing to her guilt, ושבאו לה עדים שהיא טמאה – and one about whom witnesses came and testified that she is defiled. If the waters would examine her (despite the existence of witnesses), it is understood that the minchah was originally valid, and became invalid after the testimony. But if the very existence of witnesses renders sotah waters ineffective for her (as Rav Sheishes holds), then their testimony actually informs us that she was never fit for them, and the minchah was sanctified in error and should revert to its original chullin state (and not be burned)!? Three answers are given: כגון שזינתה בעזרה – The case is where she committed adultery in the azarah (after the minchah was sanctified). Although she was escorted by young Kohanim during the procedure, she may have sinned with one of them. Alternatively, they may have granted her privacy to relieve herself, allowing her the opportunity for adultery. Finally, Rav Pappa says that although the sanctification of the minchah was indeed in error, it is burned because of a Rabbinic decree."
      }
    ],
    "siman": {
      "title": "Siman - Sword",
      "paragraph": "The large red sword was thrown down in front of a Sotah, preventing her from being taken in yibum, just as it was discovered that the reason the waters didn’t work was because there were witnesses to her adultery in chutz l’aretz, which led to her minchah being burned mid’Rabbanon."
    }
  },
  {
    "daf": 7,
    "data": [
      {
        "id": 0,
        "title": "Machlokes if the husband can be trusted to escort the sotah to Yerushalayim",
        "paragraph": "The next Mishnah teaches that after the sotah’s husband takes her to a local Beis Din, ומוסרין לו שני תלמידי חכמים – they provide him with two Torah scholars to escort them, שמא יבא עליה בדרך – for perhaps he will have relations with her on the way, which is forbidden, and additionally renders the waters ineffective. Rebbe Yehudah says: בעלה נאמן עליה – her husband is trusted regarding her, and an escort is unnecessary. In a Baraisa, Rebbe Yehudah supports his position with a kal vachomer: ומה נדה שהיא בכרת – If a niddah, with whom relations are punishable with kares, בעלה נאמן עליה – yet her husband is trusted regarding her and their seclusion is permitted, סוטה שהיא בלאו לא כל שכן – then a sotah, who is prohibited to her husband with a mere negative commandment, all the more so he should be trusted. The Chachomim respond that, on the contrary, the husband can more easily be trusted with a niddah, whose severity deters him from sinning. In another Baraisa, they argued that a husband can be trusted regarding a niddah, who will become permitted again, as opposed to a sotah who may not. Later, Rebbe Yehudah offered a Scriptural source for his position."
      },
      {
        "id": 1,
        "title": "Beis Din’s attempt to persuade her to confess",
        "paragraph": "The next Mishnah describes the beginning of the sotah procedure. The Sanhedrin endeavors to frighten her to admit her guilt. ואומר לה – And they say to her, בתי, הרבה יין עושה, הרבה שחוק עושה – “My daughter, wine causes much wrongdoing, frivolity causes much wrongdoing, הרבה ילדות עושה, הרבה שכנים הרעים עושין – immaturity causes much wrongdoing, and bad neighbors cause much wrongdoing (through their regular access to her). עשי לשמו הגדול שנכתב בקדושה שלא ימחה על המים – Act for His great Name which was written in holiness by admitting your guilt so that It should not be erased on the waters!” They then tell her of righteous people in the Torah who confessed to misdeeds. If she confesses, she forfeits her kesubah and is divorced. If she insists on her innocence, she is brought to the Eastern Gate where the sotah waters are administered. The Mishnah then describes the degradation to which she was subjected, including her clothing being grabbed and possibly torn, her hair being uncovered and unbraided, and what she cannot wear. It then details who may watch the proceedings."
      },
      {
        "id": 2,
        "title": "The confessions and rewards of Reuven and Yehudah",
        "paragraph": "A Baraisa describes the confessions of righteous people about whom the sotah is told. יהודה הודה ולא בוש – Yehudah confessed to his deed with Tamar and was not ashamed, מה היה סופו – what was his end? נחל חיי העולם הבא – He inherited life in the World to Come. The same is said of Reuven’s confession of his deed concerning Bilhah. The Baraisa also describes their reward in this world. The Torah describes Yehudah’s confession: ויכר יהודה ויאמר צדקה ממני – “And Yehudah recognized his items and said, “She is right, [the child] is from me.” Reuven’s confession is hinted in Moshe’s berachah: יחי ראובן ואל ימות...וזאת ליהודה – “Reuven should live and not die…and this to Yehudah,” which implies a connection between the two. The Gemara tells that while the Jewish nation traveled through the Desert, Yehudah’s bones were rolling in his coffin (because of the cheirem he accepted, although it was conditional), until Moshe pleaded for him: רבונו של עולם, מי גרם לראובן שהודה – “Master of the world, who caused Reuven to confess?” יהודה \"וזאת ליהודה\" – ”Yehudah! Yet Reuven’s bones are intact (\"יחי ראובן\"), and this is to Yehudah?” The Gemara details the continuation of Moshe’s prayer, and Yehudah’s steady ascendancy in the מתיבתא דרקיעא – the   Heavenly Academy."
      }
    ],
    "siman": {
      "title": "Siman - Gun (כלי זיין)",
      "paragraph": "The two talmidei Chochomim with red guns escorting the Sotah since her husband could not be trusted, tried to frighten her to confess by pointing their guns at a bottle of wine and telling her wine causes much wrongdoing, just as they passed two great tzadikim confessing, one regarding a woman and the other regarding a bed."
    }
  },
  {
    "daf": 8,
    "data": [
      {
        "id": 0,
        "title": "אין משקין שתי סוטות כאחת",
        "paragraph": "It was taught in a Baraisa: אין משקין שתי סוטות כאחת – We do not give two sotahs to drink at once, כדי שלא יהא לבה גס בחבירתה – so that her heart should not be emboldened by her friend (who stands fast in her denial). Rebbe Yehudah disagrees and says the source is a passuk: \"אותה\", לבדה – “The Kohen will make her swear,” her alone. Although the Tanna Kamma agrees with this derashah, it is Rebbe Shimon, דדריש טעם דקרא – who expounds the reason of the pasuk and limits the application accordingly. The nafka minah is a woman who is רותתת – trembling from fear of the waters, who could drink alongside her friend according to Rebbe Shimon, since the reason does not apply. The Gemara objects that we still may not give two sotahs to drink at once, because אין עושין מצות חבילות חבילות – we do not perform mitzvos in “bundles,” since it appears we are trying to get them over with. It answers that if two Kohanim are administering the waters simultaneously to two sotahs, there is no impression of bundling the mitzvos."
      },
      {
        "id": 1,
        "title": "Machlokes about concern for immoral thoughts re: sotah and stoning",
        "paragraph": "The Chochomim in the Mishnah taught that the sotah’s heart and hair may be uncovered, but Rebbe Yehudah holds that if she is beautiful, they cannot. The Gemara asks: למימרא דר' יהודה חייש להרהורא ורבנן לא חיישי – Is this to say that Rebbe Yehudah is concerned about causing immoral thoughts to those watching and the Rabbis are not concerned? But the exact opposite can be shown from a Baraisa about one who is being stoned to death, where Rebbe Yehudah said that only the private areas of a man and woman must be covered (after their clothing is removed), while the Chochomim hold that a woman is not stoned unclothed altogether. We see, then, that the Chochomim are concerned for immoral thoughts of the onlookers, and Rebbe Yehudah is not!? Rabbah explains that although Rebbe Yehudah is concerned about someone sinning later with the sotah, who might leave unharmed, there is no concern of sinning with the woman who is being killed by stoning (and we have a tradition דאין יצר הרע שולט אלא במה שעיניו רואות – the Evil Inclination only rules over what one sees with his eyes, and therefore this does not arouse him towards other women). The Chochomim hold that although the sotah must be uncovered to achieve ונוסרו כל הנשים – “And all the women will be chastised,” regarding stoning it is unnecessary, because אין לך ייסור גדול מזה – there is no greater chastisement than this."
      },
      {
        "id": 2,
        "title": "במדה שאדם מודד בה מודדין לו re: sotah and capital punishment",
        "paragraph": "The next Mishnah states: במדה שאדם מודד בה מודדין לו – According to the measure with which a person measures his actions, with it they measure for him in punishment or reward. The laws of sotah illustrate this: היא קשטה את עצמה לעבירה המקום נוולה – She adorned herself for sin; Hashem disgraced her. היא גלתה את עצמה לעבירה המקום גלה עליה – She revealed herself for sin; Hashem revealed her sin publicly. בירך התחילה בעבירה תחילה ואחר כך הבטן – She began her sin with her thigh (where she first derives pleasure from her sin), and then her stomach, לפיכך תלקה הירך תחילה ואחר כך הבטן ושאר כל הגוף לא פלט – therefore the thigh is struck first and then the stomach, and the rest of her body does not escape. In a Baraisa, Rebbe derives this principle from a passuk, and then draws twelve parallels between a sotah’s sin and her punishment. Although executions ceased after the Beis Hamikdash was destroyed, דין ארבע מיתות לא בטלו – the punishment of the four types of executions has not ceased. Someone deserving of stoning falls from a roof or is trampled by a wild animal; one deserving of death by burning falls into a fire or is bitten by a poisonous snake; one deserving of beheading is killed by the government or bandits; and one deserving of strangulation either drowns or dies through a condition that causes suffocation."
      }
    ],
    "siman": {
      "title": "Siman - Challah (Baker)",
      "paragraph": "The baker who brought red challahs for two sotahs before they were going to be made to drink separately, was surprised to see their heads uncovered when the woman he saw stoned a day earlier was completely clothed and couldn’t watch when one sotah’s body began to react to the water, מדה כנגד מדה, based on her sotah behavior."
    }
  },
  {
    "daf": 9,
    "data": [
      {
        "id": 0,
        "title": "כל הנותן עיניו במה שאינו שלו, מה שמבקש אין נותנין לו, ומה שבידו נוטלין הימנו",
        "paragraph": "It was taught in a Baraisa: סוטה נתנה עיניה במי שאינו ראוי לה – The sotah set her eyes on one unfit for her, מה שביקשה לא ניתן לה – what she sought was not given to her (i.e., she becomes prohibited to him even after leaving her husband), ומה שבידה נטלוהו ממנה – and what was in her hand they took from her (i.e., death through the waters, or becoming prohibited to her husband through confessing), שכל הנותן עיניו במה שאינו שלו – because anyone who sets his eyes on what is not his, מה שמבקש אין נותנין לו – what he seeks is not given to him, ומה שבידו נוטלין הימנו – and what is in his hand they take from him. The Baraisa continues that the same held true for the original serpent, that set its eyes on Chava and had relations with her. It did not get what it sought and lost what it had: Instead of being king of the beasts, it would now be the most cursed; instead of walking upright, it would go on its belly; instead of eating mankind’s food, it would eat dust; instead of killing Adam (through eating of the Tree) and marrying Chava, there would be enmity between serpents and women. The Baraisa lists ten other people who exemplify this principle."
      },
      {
        "id": 1,
        "title": "מדה כנגד מדה re: Shimshon and Avshalom, and positive מדה כנגד מדה re: Miriam, Yosef, and Moshe",
        "paragraph": "The next Mishnah teaches more examples of מדה כנגד מדה: שמשון הלך אחר עיניו – Shimshon followed his eyes, לפיכך נקרו פלשתים את עיניו – therefore the Plishtim gouged out his eyes. Because Avshalom was conceited about his hair, he was hung by his hair; because he consorted with ten of his father’s concubines, ten lances were put into him; because he stole three hearts (by fooling his father, Beis Din, and Klal Yisroel), three staves were thrust into him. This principle applies for the good as well: מרים המתינה למשה שעה אחת – Miriam waited one hour for Moshe at the Nile, לפיכך נתעכבו לה ישראל ז' ימים במדבר – therefore, Klal Yisroel waited for her for seven days in the desert when she had tzaraas. Because Yosef, the greatest of the brothers, honored Yaakov by leading his burial procession, he was honored by being buried by Moshe, the greatest in Klal Yisroel. Moshe, in turn, was honored by being buried by Hashem Himself."
      },
      {
        "id": 2,
        "title": "Delilah’s name, and how she knew when Shimshon was telling the truth",
        "paragraph": "Rebbi said: אילמלא נקרא שמה דלילה – Even if her name had not been Delilah, ראויה היתה שתקרא דלילה – it would have been fitting for her to be called Delilah (from the word “weakened”): דילדלה את כחו – She weakened his strength, דילדלה את לבו – she weakened his heart, דילדלה את מעשיו – and she weakened his actions. He explains: She weakened his strength, as is says: \"ויסר כחו מעליו\" – And his strength left him. She weakened his heart, as it says: \"ותרא דלילה כי הגיד לה את כל לבו\" – And Delilah saw that he had told her all that was in his heart. She weakened his actions, דאיסתלק שכינה מיניה – because the Shechinah left him, as it says: \"והוא לא ידע כי ה' סר מעליו\" – And he did not know that Hashem had left him. The Gemara wonders how Delilah was certain that he had now told the truth, since he had been untruthful several times before. Rav Chanin said in the name of Rav: ניכרין דברי אמת – Words of truth are recognizable (such as here, where it explained why he grew his hair long and refrained from wine). Abaye said that she knew the righteous Shimshon would not say Hashem’s Name in vain, so when he said, \"נזיר אלקים אני\" – I am a nazir to Hashem, she knew he spoke truthfully."
      }
    ],
    "siman": {
      "title": "Siman - Teapot",
      "paragraph": "The jealous little old lady who had her eyes on her neighbor’s red teapot ended up dropping her antique blue teapot which smashed into pieces, and then got her fancy grey sheitel stuck in a tree because she was so conceited, that she could afford to go to the sheitel macher called “Delilah.”"
    }
  },
  {
    "daf": 10,
    "data": [
      {
        "id": 0,
        "title": "חמשה נבראו מעין דוגמא של מעלה, וכולן לקו בהן",
        "paragraph": "A Baraisa states: חמשה נבראו מעין דוגמא של מעלה – Five were created with a similarity to the One Above (i.e., they were unparalleled), וכולן לקו בהן – and they all were stricken in those areas of superiority: שמשון בכחו – Shimshon was stricken with his exceptional strength, as it says: \"ויסר כחו מעליו\" – And his strength left him. שאול בצוארו – Shaul, with his neck (which was exceptional in his being taller than all others), as it says: \"ויקח שאול את החרב ויפל עליה\" – And Shaul took the sword and fell upon it, presumably on the neck. אבשלום בשערו – Avshalom, with his exceptional hair (the Gemara describes on 10b both the exceptional nature of his hair, and how he was hung by it). צדקיה בעיניו – Tzidkiyah, in his eyes, as it says: \"ואת עיני צדקיהו עור\" – and the eyes of Tzidkiyahu [Nevuchadnetzar] blinded. אסא ברגליו – Asa, in his legs, as it says: \"רק לעת זקנתו חלה את רגליו\" – but in his old age he ailed in his feet (Rav identified it as gout). Rashi says he does not know of a Scriptural source for the exceptional eyes of Tzidkiyah and legs of Asa, and that the Tanna learned it from his teacher."
      },
      {
        "id": 1,
        "title": "Avraham’s אשל, and teaching about Hashem to wayfarers",
        "paragraph": "The passuk says about Avraham: ויטע אשל בבאר שבע – And he planted an \"אשל\" in Be’er Sheva. Reish Lakish explains: מלמד שעשה פרדס ונטע בו כל מיני מגדים – It teaches that he made an orchard and planted therein many kinds of fine fruits (אשל meaning tree). The Gemara quotes a machlokes if it means an orchard or an inn. (Rashi explains that \"אשל\" stands for אכילה שתייה ולינה – eating, drinking, and escorting). That passuk continues: ויקרא שם בשם ה' קל עולם – And he proclaimed the Name of Hashem, G-d of the world. Reish Lakish explains: אל תיקרי ויקרא אלא ויקריא – Do not read it as “he proclaimed,” rather, as “he caused to proclaim,” מלמד, שהקריא אברהם אבינו לשמו של הקדוש ברוך הוא בפה כל עובר ושב – teaching that Avraham Avinu caused Hashem’s Name to be proclaimed by the mouth of every passerby. After giving them to eat and drink, they arose to bless Avraham, whereupon he said: וכי משלי אכלתם – Was it my food that you ate? משל אלקי עולם אכלתם – You ate from the food of the G-d of the world! הודו ושבחו וברכו למי שאמר והיה העולם – Instead, thank, praise, and bless He Who spoke, and the world came into being."
      },
      {
        "id": 2,
        "title": "Yehudah’s reward for his public confession",
        "paragraph": "Rebbe Shimon Chasida said: יוסף שקדש שם שמים בסתר – Yosef, who sanctified the name of Heaven privately by refusing the advances of Potiphar’s wife, זכה והוסיפו לו אות אחת משמו של הקדוש ברוך הוא –merited that they added for him one letter from the name of Hashem, because he is called יהוסף in Tehillim (with an extra ה). יהודה שקדש שם שמים בפרהסיא – Yehudah, who publicly sanctified the name of Heaven with his confession, זכה ונקרא כולו על שמו של הקדוש ברוך הוא – merited to be called entirely based on the name of Hashem (his name contains all the letters of Hashem’s name). When Yehudah confessed, a bas kol went forth and said: אתה הצלת תמר ושני בניה מן האור – You saved Tamar and her two unborn sons from the fire, חייך שאני מציל בזכותך ג' מבניך מן האור – by your life, I will save in your merit three of your descendants from the fire, referring to Chananyah, Mishael, and Azaryah."
      }
    ],
    "siman": {
      "title": "Siman - Minyan of Yidden",
      "paragraph": "When five exceptional members from the minyan of Yidden wearing red talleisim, were stricken in different ways, they were brought to a holy man by an eshel tree who gave them food and drink and told them to bless Hashem and were inspired by a guest who publicly was mekadesh Hashem with his confession."
    }
  },
  {
    "daf": 11,
    "data": [
      {
        "id": 0,
        "title": "Pharaoh the \"מלך חדש\" and his scheme to enslave Bnei Yisroel",
        "paragraph": "The Gemara speaks at great length about the enslavement and redemption from Mitzrayim. Rav and Shmuel argued about the meaning of \"ויקם מלך חדש על מצרים\" – And a new king arose over Mitzrayim. One said: חדש ממש – literally new, for the first one had died. The other said: שנתחדשו גזירותיו – merely that his decrees were new, for the passuk does not say he died. The passuk that states “he did not know Yosef” means he seemed like he did not know Yosef by passing harsh decrees against his people. Pharaoh said: \"הבה נתחכמה לו\" – Let us act wisely concerning “it,” instead of them (Bnei Yisroel), meaning: באו ונחכם למושיען של ישראל – Let us act wisely concerning the Savior of Yisroel (Hashem). Pharaoh reasoned that although he could not oppress them with fire or the sword, because those are modes Hashem uses for punishment, but he could oppress them with drowning in the Nile, for Hashem swore never to visit a flood upon the world. He erred in two ways, as the Gemara explains.Rebbe Simai said: שלשה היו באותה עצה: בלעם, ואיוב, ויתרו – Three people were involved in that counsel to Pharaoh: Bilam, Iyov, and Yisro. Bilam, who advised to enslave them, was later killed. Iyov, who remained silent, was later punished through his suffering. Yisro, who fled, merited to have descendants in the Sanhedrin."
      },
      {
        "id": 1,
        "title": "The implementation of the enslavement",
        "paragraph": "The passuk says: \" וישימו עליו שרי מסים\" – And they appointed taskmasters over “it.” By not saying “them,” it teaches: שהביאו מלבן ותלו לו לפרעה בצוארו – that they brought a brick mold and hung it on Pharaoh’s neck, so no one could say they were too delicate to work since even Pharaoh was working. The enslavement is described as \".בפרך\" Rebbe Elazar explains this means בפה רך – with a soft mouth, persuading them with words and pay. Rebbe Shmuel bar Nachmani said: בפריכה – with crushing labor. That labor is described first as \"בחומר ובלבנים\" – with mortar and bricks, then \"ובכל עבודה בשדה\" – and with every labor in the field. Rava explained that initially, they labored only with mortar and bricks, and subsequently with every type of labor in the field. Rebbe Yonasan said: שהיו מחליפין מלאכת אנשים לנשים ומלאכת נשים לאנשים – that they switched the men’s work to women and the women’s work to men, which was especially difficult for them."
      },
      {
        "id": 2,
        "title": "The מילדות",
        "paragraph": "Rav and Shmuel disagree as to the identity of the two midwives: one says it was Yocheved and her daughter Miriam, and one says it was Yocheved and her daughter-in-law Elisheva. A Baraisa assumes the former when expounding their names: Shifrah was actually Yocheved, and she was called Shifrah שמשפרת את הולד – because she straightened the child’s limbs. Alternatively, שפרו ורבו ישראל בימיה – because Yisroel increased and multiplied in her days. Puah was Miriam, and she was called Puahשהיתה פועה [לולד] – because she would coo to the child. Alternatively: שהיתה פועה ברוח הקודש ואומרת – because she would cry out with Ruach Hakodesh and say, עתידה אמי שתלד בן שמושיע את ישראל – my mother is destined to bear a son who will save Yisroel. The passuk says: \"ותחיין את הילדים\" – And they kept the children alive, teaching that not only did they not kill them, אלא שהיו מספיקות להם מים ומזון – but they also provided them with food and water.Rav and Shmuel debated the meaning of the midwives’ reward: \"ויעש להם בתים\" – And he made for them “houses.”  One said it means houses of Kehunah and Leviyah, and the other said it means houses of royalty."
      }
    ],
    "siman": {
      "title": "Siman - Stars (Eleven Stars in Yosef's Dream)",
      "paragraph": "The new evil king meeting under the red starry night with his three wisest advisors, put a mortar around his neck with intent to destroy his enemies with crushing labor, but was distracted by the sound coming from two midwives, where one would coo while the other straightened the child’s limbs."
    }
  },
  {
    "daf": 12,
    "data": [
      {
        "id": 0,
        "title": "Amram’s divorce and remarrying Yocheved on Miriam’s advice",
        "paragraph": "The passuk says: וילך איש מבית לוי – A man went from the house of Levi. The descriptive term “going” teaches: שהלך בעצת בתו – that he followed his daughter’s advice. A Baraisa relates that when Pharaoh decreed for all male infants to be thrown into the river, Amram, the gadol hador, declared: לשוא אנו עמלין – We are laboring for nothing to have children, and he divorced his wife, and all Bnei Yisroel followed suit. Miriam told him: קשה גזירתך יותר משל פרעה – Your “decree” is worse than Pharaoh’s in three ways: now even females could not be born, these unborn children could not merit the World to Come, and your decree is certain to be fulfilled. Amram relented and remarried her. This is described with \"ויקח\" – and he took, which connotes a first marriage, to teach: שעשה לו מעשה ליקוחין – he made for her a ceremony akin to a first marriage. הושיבה באפריון ואהרן ומרים מרקדין לפניה – He seated her in a ceremonial chair used for carrying a bride, and Aharon and Miriam danced before her, ומלאכי השרת אמרו \"אם הבנים שמחה\" – and the malachim said, “the joyous mother of children.”"
      },
      {
        "id": 1,
        "title": "Pharaoh’s daughter retrieves Moshe from the Nile",
        "paragraph": "The passuk says: ותרד בת פרעה לרחוץ על היאור – And Pharaoh’s daughter went down to wash herself by the river. Rebbe Shimon bar Yochai said this teaches שירדה לרחוץ מגלולי אביה – that she went down to wash herself from her father’s idols (to convert). Her attendants are described as \"הולכות\" – walking: אין הליכה זו אלא לשון מיתה – This “walking” is none other than an expression of approaching death, as in the phrase \"הולך למות\" – going to die. Her attendants protested her saving Moshe, saying that even when a king’s decree is not kept by his subjects, at least his household members observe it. Gavriel came and struck them, killing them. Rebbe Yehudah and Rebbe Nechemiah dispute the meaning of \"ותשלח את אמתה ותקחה\" – and she sent forth her \"אמה\" and took [the basket]. One said it means her arm, and one said it means her maidservant (Gavriel left one alive, דלאו אורחא דבת מלכא למיקם לחודה – because it is not appropriate for a princess to stand alone). According to the opinion that it means her hand, the word אמתה is used to teach דאישתרבב אישתרבובי – that [her arm] extended greatly to reach him ."
      },
      {
        "id": 2,
        "title": "Moshe’s mother is brought to nurse him",
        "paragraph": "Miriam asked Pharaoh’s daughter if she should summon a wet-nurse \"מעבריות\" – from the Hebrews. The Gemara explains: שהחזירוהו למשה על כל המצריות כולן ולא ינק – they brought Moshe around to all the Egyptian women, but he did not nurse from them. Hashem said,פה שעתיד לדבר עם השכינה יינק דבר טמא – should the mouth which is destined to speak with the Shechinah, nurse of a non-kosher substance (eaten by an Egyptian wet-nurse)?! Pharaoh’s daughter said to Yocheved: \"היליכי את הילד הזה\" – Take this child and nurse him for me. Rebbe Chama bar Rebbe Chanina said: מתנבאה ואינה יודעת מה מתנבאה – She was prophesying but was not aware what she was prophesying, \"היליכי\" הא שליכי – the word “heilichi” is a contraction of here is that which is yours. Pharaoh’s daughter continued: \"ואני אתן את שכרך\" – and I will give your wages for nursing. Rebbe Chama bar Rebbe Chanina noted: לא דיין לצדיקים שמחזירין להן אבידתן – It is not enough for the righteous that what they lost is returned to them, אלא שנותנין להן שכרן – but they also pay them."
      }
    ],
    "siman": {
      "title": "Siman - Twelve Brothers",
      "paragraph": "The twelve red haired brothers who divorced their red-haired wives upon the instruction of their leader, but then celebrated by a river upon remarrying them, were shocked when they saw a princess stretch out her very long arm to snatch a baby from the water, and hand him to his mother to nurse with pay."
    }
  },
  {
    "daf": 13,
    "data": [
      {
        "id": 0,
        "title": "Eisav’s attempt to prevent Yaakov’s burial in מערת המכפלה",
        "paragraph": "The Gemara relates that when Yaakov’s burial procession reached מערת המכפלה, Eisav attempted to stop them, saying: “ממרא קרית הארבע היא חברון” – Mamre in the City of Four, which is Chevron. The Gemara explains that מערת המכפלה could only accommodate four couples, three of which were already buried there. Since Yaakov had buried Leah there, Eisav maintained that the final plot was his. A dispute arose if it had been sold to Yaakov, and Naftali, who was fleet of foot, was sent to fetch the document of sale from Mitzrayim. In the interim, Chushim, who was hard of hearing, inquired as to the cause of the delay. When he was told, he reacted: ועד דאתי נפתלי מארעא דמצרים יהא אבי אבא מוטל בבזיון – “And until Naftali comes from Mitzrayim, my grandfather will be lying in disgrace?!” He grabbed a staff and struck Eisav, killing him. The Gemara concludes: באותה שעה נתקיימה נבואתה של רבקה – At that time the prophecy of Rivkah was fulfilled, who said: \"למה אשכל גם שניכם יום אחד\" – Why should I be bereaved of both of you on the same day? ואף על גב דמיתתן לא ביום אחד הואי – Even though their deaths were not on the same day, קבורתן מיהא ביום אחד הואי – their burials at least were on the same day."
      },
      {
        "id": 1,
        "title": "Moshe seeks and finds Yosef’s bones",
        "paragraph": "A Baraisa states: בא וראה כמה חביבות מצות על משה רבינו – Come and see how precious mitzvos were to Moshe Rabbeinu, שכל ישראל כולן נתעסקו בביזה והוא נתעסק במצות – for all Bnei Yisroel were occupied with gathering booty, but Moshe was occupied with mitzvos (finding Yosef’s coffin). Moshe inquired of Serach (daughter of Asher) as to its location, and she told him that Yosef was buried in a metal coffin set in the Nile, to bring blessing to its waters. Moshe went to the riverbank and said: יוסף יוסף, הגיע העת שנשבע הקדוש ברוך הוא שאני גואל אתכם – Yosef, Yosef! The time has come about which Hashem swore, “I will redeem you,” והגיעה השבועה שהשבעת את ישראל – and the moment to fulfill the oath that you adjured Bnei Yisroel has arrived. אם אתה מראה עצמך מוטב – If you show yourself, it is good (and we will take you), אם לאו הרי אנו מנוקין משבועתך – but if you do not, we are exempted from your oath! Immediately, his coffin rose to the surface. Alternatively, Rebbe Nassan says that Yosef was buried in the royal crypt, and after Moshe made the above declaration, Yosef’s coffin shook, so Moshe was able to identify and take it."
      },
      {
        "id": 2,
        "title": "Moshe at the time of his death",
        "paragraph": "Moshe described himself as one hundred and twenty years old \"היום\" – today. The Gemara explains his meaning: היום מלאו ימי ושנותי – ”Today my days and years have been filled.” This teaches:שהקב\"ה משלים שנותיהם של צדיקים מיום ליום ומחדש לחדש – that Hashem completes he years of the righteous from day to day and from year to year, as it says: \"את מספר ימיך אמלא\" – the number of your days I will fill.Moshe continued: \"לא אוכל עוד לצאת ולבא\" – I am no longer able to go out and come in. The Gemara asks that this cannot mean he lacked the physical strength to “come and go,” for Moshe is described at the time of his death: \"לא נס ליחה\" – his freshness had not diminished. Moreover, a passuk alludes to Moshe climbing twelve steps of Mount Nevo in a single step, indicating he retained his full strength. Therefore, Rebbe Yonasan explains he meant he was unable לצאת ולבוא בדברי תורה – to “go out and come in” in words of Torah, מלמד שנסתתמו ממנו שערי חכמה – teaching that the gates of wisdom were closed to him then."
      }
    ],
    "siman": {
      "title": "Siman - Bar Mitzvah Boy",
      "paragraph": "The bar-mitzvah boy at the red-themed bar mitzvah party who came out wearing a mask of Esav’s reddish head, whose eyes dramatically popped out and rolled right next to a metal coffin floating on water, which was raised by a great man who lived to one hundred and twenty and who died on the day he was born."
    }
  },
  {
    "daf": 14,
    "data": [
      {
        "id": 0,
        "title": "להלך אחר מדותיו של הקדוש ברוך הוא",
        "paragraph": "Rebbe Chama bar Rebbe Chanina said: What does the passuk mean when saying, אחרי ה' אלקיכם תלכו –Hashem your G-d, you should follow? It cannot be understood literally, for Hashem is described as a burning fire. Rather, it means: להלך אחר מדותיו של הקדוש ברוך הוא – to follow the attributes of Hashem. מה הוא מלביש ערומים – Just as he clothes the unclothed, as we find that Hashem provided clothing for Adam and Chava, you, too, clothe the unclothed. הקדוש ברוך הוא ביקר חולים – Hashem visited the sick when he visited Avraham; אף אתה בקר חולים – you, too, visit the sick. הקדוש ברוך הוא ניחם אבלים – Hashem comforted mourners when he blessed Yitzchok after Avraham’s passing; אף אתה נחם אבלים – you, too, comfort mourners. הקדוש ברוך הוא קבר מתים – Hashem buried the dead when he buried Moshe; אף אתה קבור מתים – you, too, bury the dead."
      },
      {
        "id": 1,
        "title": "Why Moshe desired to enter Eretz Yisroel",
        "paragraph": "Rebbe Simlai expounded: מפני מה נתאוה משה רבינו ליכנס לארץ ישראל – Why did Moshe Rabbeinu desire to enter Eretz Yisroel? וכי לאכול מפריה הוא צריך – Did he need to eat of its fruit, או לשבוע מטובה הוא צריך - or satiate himself with its goodness? Surely not! Rather, Moshe said to himself:הרבה מצות נצטוו ישראל ואין מתקיימין אלא בא\"י – “There are many mitzvos that Klal Yisroel has been commanded that can only be fulfilled in Eretz Yisroel. אכנס אני לארץ כדי שיתקיימו כולן על ידי – I will enter the Land, so they will all be fulfilled through me.” אמר לו הקדוש ברוך הוא – Hashem said to him: כלום אתה מבקש אלא לקבל שכר – Do you seek anything other than to receive reward? מעלה אני עליך כאילו עשיתם – I will consider it for you as if you fulfilled [those mitzvos]."
      },
      {
        "id": 2,
        "title": "The procedure for bringing a minchah",
        "paragraph": "The second Perek begins by describing the differences between the minchah of a sotah and an ordinary minchah. The Gemara brings a Baraisa which details the entire procedure of a standard minchah: אדם מביא מנחה מתוך ביתו בקלתות של כסף ושל זהב – A person brings a minchah from his house in baskets of silver or gold, ונותנה לתוך כלי שרת ומקדשה בכלי שרת – and places it in a kli shareis and sanctifies it in the kli shareis. (The Gemara will explain that this can mean he sanctifies it automatically by placing it there),ונותן עליה שמנה ולבונתה ומוליכה אצל כהן– then he places its oil and frankincense on it and brings it to the Kohen. The Kohen then brings it to the מזבח and brings the kli close to the southwest corner of the מזבח. He then moves the frankincense to one side and performs kemitzah (the special procedure for removing a defined amount of flour from the vessel) from a spot which is well mixed with oil. He puts the “kometz” (the amount removed) into another kli shareis and is mekadesh it there (preparing it for offering on the מזבח). He collects the frankincense and places it atop the kometz, brings the minchah up to the מזבח in a kli shareis, salts it, and places it onto the fires. Once the kometz is offered, the rest of the mixture is permitted to be eaten by the Kohanim. They are able to add oil or honey but cannot allow it to become chametz."
      }
    ],
    "siman": {
      "title": "Siman - Hand (Juggler)",
      "paragraph": "The juggler juggling red clothes for the unclothed with his left hand while visiting the sick, told the patient how much he wants to go to Eretz Yisroel, and juggled all the parts that are brought with a minchah with his right one."
    }
  },
  {
    "daf": 15,
    "data": [
      {
        "id": 0,
        "title": "Why a מנחת חוטא and חטאת lack elements of standard korbanos",
        "paragraph": "Rebbe Shimon said: בדין הוא שתהא מנחת חוטא טעונה שמן ולבונה – By rights, the minchah of a sinner (a minchah brought by a poor person in place of an animal for certain sins) should require oil and levonah (like an ordinary minchah), שלא יהא חוטא נשכר – so that a sinner should not profit (by his minchah being less expensive than a standard minchah). ומפני מה אינה טעונה – Why then does it not require them? שלא יהא קרבנו מהודר – So his korbon should not be beautified. ובדין הוא שתהא חטאת חלב טעונה נסכים – Similarly, by rights a chatas for eating forbidden fats (for example) should require libations like an olah and shelamim, שלא יהא חוטא נשכר – so that a sinner should not profit, but it does not,שלא יהא קרבנו מהודר – so that his korbon should not be beautified. The Baraisa adds that the chatas and asham of a metzora do require libations, because they are not brought for a sin. The Gemara asks that tzaraas befalls a person for several aveiros, and answers that they are atoned through the tzaraas itself, and the korbanos are to permit him to eat kodshim, not for atonement."
      },
      {
        "id": 1,
        "title": "Halachos of the earthenware vessel",
        "paragraph": "The next Mishnah states: היה מביא פילי של חרס – [The Kohen] would bring an earthenware vial, ונותן לתוכה חצי לוג מים מן הכיור – and put into it a half-log of water from the kiyor. Rebbe Yehudah said a revi’is of water was used. Rebbe Yishmael says in a Baraisa that the vial must be new, which he derives from a metzora’s purification. Rava said: לא שנו אלא שלא נתאכמו פניו – [Although our Tanna does not require a new vial,] that was only taught when [the vial’s] face was not blackened from use, אבל נתאכמו פניו פסולין – but if it was blackened, it is invalid. He explains: דומיא דמים – It must be similar to the water, מה מים שלא נשתנו, אף כלי שלא נשתנה – just as the water was unchanged, the vessel must be unchanged. Rava inquired: נתאכמו והחזירן לתוך כבשן האש ונתלבנו מהו – If they became blackened, and they returned them to the furnace and they became whitened again, what is the halachah? מי אמרינן כיון דאידחו אידחו – Do we say since they were rejected, they remain rejected, או דילמא כיון דהדור הדור – or perhaps since they returned to their original state, they have returned to their validity?"
      },
      {
        "id": 2,
        "title": "The source for the earth used for sotah waters",
        "paragraph": "The Mishnah stated that there was a floorspace in the Heichal from which earth was taken for sotah waters. A Baraisa teaches: \"ומן העפר אשר יהיה\" – From the earth that will be, יכול יתקן מבחוץ ויכניס – one might think that [the Kohen] could prepare earth outside the Mikdash and bring it in, therefore the passuk says: \"בקרקע המשכן\" – on the floor of the Mishkan, indicating that it must be taken from the floor. אי בקרקע המשכן יכול יחפור בקרדומות – If it had stated only “on the floor of the Mishkan,” one would think he should dig with spades to procure earth, therefore the passuk says “that will be,” implying that it need not have originated there, as long as it was on the floor at some time. Therefore: יש שם הבא – If there is earth there, bring it; אין שם תן שם – if there is not earth there, place earth there to use. Another Baraisa brings an additional opinion: שהיה מתקן מבחוץ ומכניס  – that he would prepare earth outside and bring it in. (Rashi explains that he holds it does not need to be placed on the floor). Isi ben Yehudah then explains that “on the floor of the Mishkan” is teaching (according to Rashi’s girsa) to include the Beis Hamikdash in the law of sotah waters (even though the passuk says Mishkan)."
      }
    ],
    "siman": {
      "title": "Siman - Fruit Bowl (related to the fruit of Tu B’Shevat)",
      "paragraph": "The huge red fruit bowl containing the oil and levonah which were not brought with the מנחת חוטא, was placed next to earthenware vessel that looked new and had a half log of water in it, that was sitting on top of some earth taken from the Temple’s floor."
    }
  },
  {
    "daf": 16,
    "data": [
      {
        "id": 0,
        "title": "If ashes can be used for sotah waters in place of earth",
        "paragraph": "The Gemara asks regarding the sotah waters: אין שם עפר מהו שיתן אפר – If there is no earth there, can he place ashes in the water instead? אף על גב דאיקרי עפר הכא בקרקע המשכן כתיב – Do we say even though ashes are called \",עפר\" but here it is written “the floor of the Mishkan,” disqualifying ashes, or since it is used for a derashah earlier, it does not exclude ashes? The Gemara presents a Baraisa: בשלשה מקומות הלכה עוקבת מקרא – In three places, halachah [leMoshe miSinai] undermines the apparent meaning of a passuk: the blood of a shechted wild animal or bird may be covered with anything (although the passuk says “earth”), a nazir who shaves with anything is liable (although it says “razor”), and a get may be writtenon anything (although the passuk implies parchment). If ashes could be used for a sotah, why was it not listed here? The Gemara answers that the list is not exhaustive and explains that another was left out - that a metzora’s second shaving is total (“like a gourd”), although derashos would imply it is not. The Gemara suggests three reasons why this case may not belong in the Baraisa."
      },
      {
        "id": 1,
        "title": "Three things which must be visible, and machlokes about blood of a metzora’s bird",
        "paragraph": "It was taught in a Baraisa: שלשה צריכין שיראו – Three things must be visible: עפר סוטה – The earth of the sotah must be visible in the water, ואפר פרה ­– the ashes of the parah [adumah] must be visible in the spring water, ורוק יבמה – and the spittle of the yevamah performing chalitzah. Rebbe Yishmael adds another: אף דם צפור – Also the blood of [a metzora’s] bird must be visible in the spring water. Rebbe Yishmael holds that the two terms, \"בדם\" and \",במים\" together teach: מביא מים שדם ציפור ניכר בהן – he brings the amount of water in which the blood of the bird will be recognizable, which the Sages set at a revi’is. Rebbe Yirmiyah asked Rebbe Zeira: גדולה ומדחת את המים – A large bird which its blood overwhelms the water, קטנה ונדחית מפני המים מהו – or a small bird whose blood is overwhelmed by the water, what then? Tosafos explains that he wondered how the Sages could unequivocally declare (according to Rebbe Yishmael) that a revi’is is the correct amount regardless of the bird’s size. Rebbe Zeira objected to his question and said that the Rabbis arrived at a revi’is through measurements, and this amount is fit for all size birds which are valid for a metzora."
      },
      {
        "id": 2,
        "title": "Machlokes if the sotah waters are valid if one placed the earth in before the water",
        "paragraph": "It was taught in a Baraisa: הקדים עפר למים פסול – If one placed the earth in thevessel before the water, it is invalid. Rebbe Shimon holds it is valid. Rebbe Shimon makes a gezeirah shavah between the ashes of parah adumah and the earth of a sotah, teaching: Just as with sotah, the earth should be put on the water, so too with parah adumah, the ashes should be placed on the water. ומה כאן הקדים עפר למים כשר – Also, just as here [parah], if he placed the ashes before the water, it is valid, אף להלן הקדים עפר למים כשר – so too there [sotah], if he placed the earth before the water, it is valid (after the fact). The law by parah when the ashes are placed first, is itself disputed: Rebbe Shimon derives, based on contradictory terms in the passuk, that either order is valid. The Rabbonon hold that only one of the terms is teaching the order, and they reason: מה מצינו בכל מקום מכשיר למעלה – Just as we find in all places, the “permitter” is on top (the earth of sotah which tests her, and the blood of a metzora’s bird permits the water for its sprinkling), אף כאן מכשיר למעלה ­– here too, the “permitter” (the ashes) must be on top."
      }
    ],
    "siman": {
      "title": "Siman - Toes (Acrobat with large toes)",
      "paragraph": "The acrobat with the big red toes swinging through the air bringing ashes for a sotah since no earth could be found, looked down and saw the earth of the sotah visible in the water, as a Kohen was being rebuked for initially putting the earth in the vessel before the water."
    }
  },
  {
    "daf": 17,
    "data": [
      {
        "id": 0,
        "title": "איש ואשה זכו שכינה ביניהן",
        "paragraph": "Rebbe Akiva darshened: איש ואשה זכו שכינה ביניהן – A husband and wife, if they are meritorious in their mutual fidelity, the Shechinah is between them. (The yud in איש and the hei in אשה combine to Hashem’s name). לא זכו אש אוכלתן – If they are not meritorious, meaning they are unfaithful to the marriage, a fire consumes them. (With the yud and hei removed, each is left as אש – fire). Rava added: ודאשה עדיפא מדאיש – and the wife’s fire is stronger than the husband’s, as Rashi explains, she is more readily punished.  האי מצרף והאי לא מצרף – because the letters representing the fire of the woman are joined, whereas the letters representing the fire of the man are not joined."
      },
      {
        "id": 1,
        "title": "Why earth is brought for a sotah, and Avraham Avinu saying \"אנכי עפר ואפר\"",
        "paragraph": "Rava said: מפני מה אמרה תורה הבא עפר לסוטה – Why did the Torah say, “Bring earth for a sotah”? זכתה יוצא ממנה בן כאברהם אבינו – If she is meritorious, a son like Avraham Avinu will come forth from her, about whom it says: \"עפר ואפר\" – dust and ashes. לא זכתה תחזור לעפרה – If she is not meritorious, she will return to her dust when she drinks the waters. Rava also darshened: בשכר שאמר אברהם אבינו \"ואנכי עפר ואפר\" – As reward for Avraham Avinu saying, “I am but dust and ashes,” זכו בניו לב' מצות, אפר פרה ועפר סוטה – his descendants merited two mitzvos: ashes of the parah [adumah], and the earth of a sotah. The mitzvah of covering blood of a shechted wild animal or bird is not reckoned here, because it does not provide a benefit beside the mitzvah (as opposed to parah adumah, which effects taharah and atones for the Golden Calf, and sotah waters, which brings marital harmony and other benefits). Rava also said that in reward for Avraham refusing to accept \"מחוט ועד שרוך נעל\" – from a thread to a shoestrap, from the king of Sodom, his descendants merited the mitzvos of the thread of techeiles and the strap of tefillin. The Gemara explains their benefits."
      },
      {
        "id": 2,
        "title": "Requirements for writing the sotah scroll – must use erasable ink",
        "paragraph": "The next Mishnah teaches that the sotah scroll must be written on parchment, because the Torah calls it a \".ספר\" It must be written with דיו – ink, because the Torah says, \" ומחה\" – and he shall erase, requiring כתב שיכול למחות – a writing which can be erased. Rava teaches six cases where the writing is invalid:מגילת סוטה שכתבה בלילה פסולה – A sotah scroll which he wrote at night is invalid, because it is compared to judgments, which are performed by day. כתבה למפרע פסולה – If he wrote it backwards, it is invalid, because \"האלה\" – these, implies it must be written in order. כתבה קודם שתקבל עליה שבועה פסולה ­– If he wrote it before she accepted the oath, it is invalid, because the acceptance appears before the commandment to write it. כתבה איגרת פסולה – If he wrote it as a letter (as Rashi explains, without etching lines for writing), it is invalid, because the Torah describes it as a \"ספר\" and a sefer Torah requires etching lines. He adds two more cases on the next Daf."
      }
    ],
    "siman": {
      "title": "Siman - Used Car Salesman",
      "paragraph": "The used car salesman in the red suit who tried to charm the elderly couple by telling them that they looked like the Shechinah was between them, while telling them to ignore the עפר ואפר all over the used car that even Avraham Avinu would want to buy, pulled out a sales contract that looked like a sefer, and proceeded to fill it in with erasable ink."
    }
  },
  {
    "daf": 18,
    "data": [
      {
        "id": 0,
        "title": "Questions about erasing two sotah scrolls into one cup",
        "paragraph": "Rava inquired: כתב ב' מגילות לשתי סוטות ומחקן לתוך כוס אחד – If he wrote two sotah scrolls for two women and erased them into a single cup, what is the halachah? כתיבה לשמה בעינן והאיכא – Is only writing for her sake required, and there is in this case, או דילמא בעינן נמי מחיקה לשמה – or perhaps erasing for her sake is also required, and in this case it is not. (Rashi explains it must be recognizably hers, and in the cup it is not). He inquired further: If they must be erased into separate cups, מחקן בב' כוסות וחזר ועירבן מהו – if he erased them into two cups and then mixed them, what is the halachah? Is it valid, since the erasure was done separately, or do we say: הא לאו דידה קא שתיא והא לאו דידה קא שתיא – this one is not drinking her personal cup, and this one is not drinking her personal cup? If this is not valid, חזר וחלקן מהו – if he then redivided them, what is the halachah? יש ברירה או אין ברירה – is there the concept of bereirah (determination after the fact), or is there no concept of bereirah? [Tosafos notes this is not the usual application of bereirah, since they were determined before mixing]"
      },
      {
        "id": 1,
        "title": "Additional possibilities of sin that are included in the oath",
        "paragraph": "The next Mishnah states: על מה היא אומרת אמן אמן – To what is she saying “Amen, amen,” (the double term)? אמן על האלה, אמן על השבועה – She is saying “amen” to accept the curse, and “amen” to accept the oath. אמן מאיש זה, אמן מאיש אחר - Furthermore, she is saying “amen” regarding this man (about whom she was warned not to be secluded with), and “amen” regarding another man, אמן שלא שטיתי ארוסה ונשואה ושומרת יבם וכנוסה – and “amen” that I did not stray while an arusah, nesuah, while waiting for a yavam, or while married through yibum. The ability to force an oath beyond its original cause is called גלגול שבועה – lit. rolling of an oath. The Tannaim disagree if she must swear that she will not sin with another man in the future, but all agree that she does not swear about the period before marriage or after divorce. In the Gemara, Rebbe Yermiyah asks if she must swear regarding a former marriage to this husband, or if a married yevamah must swear regarding her marriage to the deceased brother. This is resolved from the Mishnah’s rule, that any relations which would not forbid her to the husband are not included in the oath. Since her current marriage would be forbidden through illicit relations in the above two states, she must swear about them."
      },
      {
        "id": 2,
        "title": "If a שומרת יבם who has illicit relations becomes forbidden to the yavam",
        "paragraph": "Rav Hamnuna said: שומרת יבם שזינתה אסורה ליבמה – A shomeres yavam who had relations with another man is forbidden to her yavam. He proves it from our Mishnah, which teaches that the sotah swears that she did not have relations as a shomeres yavam. If such relations would not prohibit her to the yavam, she would not swear about it, since the Mishnah taught that she only swears about relations which prohibit her to her husband. Still, in Eretz Yisroel they said: לית הילכתא כרב המנונא – the halachah does not accord with Rav Hamnuna. The Gemara deflects the proof from the Mishnah, because it is the opinion of Rebbe Akiva, who holds: אין קידושין תופסין בחייבי לאוין – kiddushin are not effective with those prohibited by negative commandments, ומשוי לה כי ערוה – and considers her like a full ervah (with a kares punishment). Therefore, Rebbe Akiva would hold that a shomeres yavam who has relations (prohibited with a lav) becomes forbidden to her yavam, like a fully married woman."
      }
    ],
    "siman": {
      "title": "Siman - Chuppah (בן י''ח לחופה)",
      "paragraph": "The kallah standing under the red Sotah chuppah was shocked when she was presented with two scrolls erased into one cup, and then the Rabbi told her to respond “Amen, Amen,” to an oath and swear that she did not have relations as a shomeres yavam which would forbid her to her yavam. "
    }
  },
  {
    "daf": 19,
    "data": [
      {
        "id": 0,
        "title": "The sotah’s minchah is waved by the Kohen and sotah together",
        "paragraph": "The third Perek begins by describing the offering of the sotah’s minchah: היה נוטל את מנחתה מתוך כפיפה מצרית – [The husband] would take her minchah from the basket of palm twigs,ונותנה לתוך כלי שרת – and he places it in a kli shares, ונותנה על ידה – and places it in her hand,וכהן מניח ידו מתחתיה ומניפה – and the Kohen places his hand under hers and waves it with her. He then brings it to the southwest corner of the mizbayach, does kemitzah and burns it on the mizbayach, and the remainder is eaten by Kohanim. Rebbe Elazar said to the Rebbe Yoshiyah of his generation: לא תיתב אכרעך עד דמפרשת לה להא מילתא – Do not sit down until you explain this matter to me. מנין למנחת סוטה שטעונה תנופה – From where do we derive that a minchas sotah requires waving? The Gemara explains he was asking for the source that the owner of the minchah (i.e., the woman) must wave, in addition to the Kohen taught in the passuk. He answered that there is a gezeirah shavah linking sotah and shelamim (where it states that certain parts are waved by the owner), teaching that both the owner and the Kohen must wave together, both by minchas sotah and shelamim."
      },
      {
        "id": 1,
        "title": "The order of drinking vs. offering the minchah",
        "paragraph": "In the Mishnah, the Tanna Kamma said: היה משקה ואחר כך מקריב את מנחתה – ­He would give her the sotah waters to drink and afterward offer her minchah. Rebbe Shimon said: מקריב את מנחתה ואח\"כ היה משקה – He would offer her minchah and afterward give her to drink. Still, he said:אם השקה ואחר כך הקריב את מנחתה כשרה – If he gave her to drink and then offered her minchah, it is valid, although it is not the correct order in his opinion. The Gemara explains that their machlokes revolves around three phrases describing giving her to drink, the first two of which have opposing implications about the order vis-à-vis the minchah. They argue which of the two is teaching the order, and which teaches something else. In a Baraisa, Rebbe Akiva also takes Rebbe Shimon’s position that the minchah is offered before she is given to drink, but Rashi says he does not agree that it is valid if done in the wrong order."
      },
      {
        "id": 2,
        "title": "If the sotah is compelled to drink if she refuses",
        "paragraph": "Rebbe Akiva taught: שאם נמחקה מגילה ואומרת איני שותה – If the scroll was erased and she says, “I am not drinking,” מערערין אותה ומשקין אותה בעל כרחה – we force her and make her drink against her will.This contradicts his statement in another Baraisa, in which Rebbe Yehudah said we place an iron tool in her mouth to force her to drink, but Rebbe Akiva said: כלום אנו צריכין אלא לבודקה – Do we need anything but to test her? והלא בדוקה ועומדת – Why, she stands “tested” by refusing to drink, indicating her guilt! We see that Rebbe Akiva holds she is not forced to drink!? The Gemara points out an internal contradiction in the Baraisa, in which he says that she may retract until the minchah is brought, but not after, indicating we would force her at that point!? The Gemara explains: הא דקהדרא בה מחמת רתיתא – This last statement is where she retracts out of trembling (fear of the waters), והא דקהדרא בה מחמת בריותא – and this first statement is where she retracts out of defiance. When she retracts in defiance, it is tantamount to a confession of guilt (she planned to refuse all along), and she does not drink no matter when she retracted. When she retracts because she became afraid (and does not indicate an admission), we allow a retraction if the minchah was not offered (because the scroll was not yet erased, or was erased incorrectly), but after it is erased properly, we force her to drink."
      }
    ],
    "siman": {
      "title": "Siman - Yacht",
      "paragraph": "The Kohen on the red Sotah yacht who had a challenging time doing tenufah of the minchas sotah together with the sotah as it rolled over big waves, then tried afterwards to give her the sotah waters to drink without spilling, which was especially difficult when she said she wasn’t drinking after the scroll was erased."
    }
  },
  {
    "daf": 20,
    "data": [
      {
        "id": 0,
        "title": "The guilty sotah’s death, merits delaying punishment",
        "paragraph": "The next Mishnah describes the death of the guilty sotah: אינה מספקת לשתות עד שפניה מוריקות ועיניה בולטות והיא מתמלאת גידין – She does not finish drinking before her face turns pale, her eyes bulge, and she appears filled with veins (from swelling), והם אומרים הוציאוה, שלא תטמא העזרה – and they say, “Take her out!” so she is not metamei the Courtyard. The Gemara will explain that the concern of tumah is that she may become a niddah from fear. The Mishnah continues: אם יש לה זכות היתה תולה לה – If she has a merit (defined on Daf 21), the merit suspends the punishment for her. Merits can enable suspensions for one, two, or three years. [The Gemara will bring other opinions of Tannaim about the potential duration of the suspension]. Based on this, Ben Azzai said: חייב אדם ללמד את בתו תורה – A man is obligated to teach his daughter Torah,שאם תשתה תדע שהזכות תולה לה  – so that if she drinks and is unharmed despite her guilt, she will know that merit suspends her punishment, and not doubt the waters’ efficacy. Rebbe Eliezer says:כל המלמד בתו תורה (כאילו) לומדה תפלות  – Anyone who teaches his daughter Torah, (is as if he) teaches her intimacy, because her enhanced intelligence helps her hide immoral activities."
      },
      {
        "id": 1,
        "title": "Rebbe Meir’s putting kankantom into his ink, and the sequence of whom he studied under",
        "paragraph": "Rebbe Meir related that when he studied under Rebbe Akiva, he would put kankantom (a substance which makes the writing indelible) into the ink he used for writing sifrei Torah, and Rebbe Akiva said nothing. But when he came to Rebbe Yishmael, and told him he was a scribe, Rebbe Yishmael said: בני הוי זהיר שמלאכתך מלאכת שמים היא – “My son, be careful, for your work is the work of Heaven, and an error of a single letter could have disastrous consequences. Rebbe Meir responded, as the Gemara explains, that he was an expert in the letters of the Torah, and even avoided incidental erasures by adding kankantom to his ink. Rebbe Yishmael objected that the Torah teaches regarding sotah that the words must be erasable (and he holds that the verses may be erased from a sefer Torah). The Gemara asks a contradiction from another Baraisa which indicates that Rebbe Meir studied first under Rebbe Yishmael, and then Rebbe Akiva. It answers that he went to study under Rebbe Akiva but could not discern his true opinion (since he defended both sides of a question), so he went to Rebbe Yishmael וגמר גמרא – and learned the traditions (the laws), and then returned to Rebbe Akiva to fully understand them."
      },
      {
        "id": 2,
        "title": "Machlokes about using a sefer Torah for a sotah, or another sotah’s scroll",
        "paragraph": "Rebbe Yehudah quoted Rebbe Meir: לכל מטילין קנקנתום לתוך הדיו – For all of the Torah we may put kankantom into the ink, חוץ מפרשת סוטה בלבד – except for the sotah section (so it may be erased). Rebbe Yaakov quoted Rebbe Meir as only disallowing it in a scroll written for a sotah in the Mikdash. The Gemara explains that they dispute if the pesukim of a sefer Torah may be used for a sotah, despite their not being written for that purpose. The Gemara first suggests this machlokes reflects another:אין מגילתה כשירה להשקות בה סוטה אחרת  – The scroll [of one sotah] is not valid to use for waters to give another sotah to drink, because it was not written for her. Rebbe Achai bar Yoshiyah says it is valid for another sotah’s use. The comparison is rejected: This second Tanna Kamma’s reasoning may be that it was written for a different woman, but he might allow a sefer Torah to be used. Rebbe Achai may allow a scroll that was at least written for a sotah’s use (albeit a different one), but not a sefer Torah, which was not written for that purpose at all."
      }
    ],
    "siman": {
      "title": "Siman - Café",
      "paragraph": "As the sotahrelaxing at the Post Drinking Mei Sotah Café started to get bloated not knowing that her zechusim were up, the young sofer with two Rebbes who realized what was happening, ran out with his kankatom he used for writing sifrei Torah, and with his small bottle of erasable ink he used to write the parshas sotah."
    }
  },
  {
    "daf": 21,
    "data": [
      {
        "id": 0,
        "title": "Pshatim in the passuk, “כי נר מצוה ותורה אור” – For a mitzvah is a lamp, and the Torah is light",
        "paragraph": "Rebbe Menachem bar Yose darshened the pasuk: \"כי נר מצוה ותורה אור\" – For a mitzvah is a lamp, and the Torah is light. He observed that a mitzvah is compared to a lamp, and the Torah to light itself. This teaches:מה נר אינה מגינה אלא לפי שעה  – Just as a lamp only protects (through its illumination) temporarily, אף מצוה אינה מגינה אלא לפי שעה – so the mitzvah protects only temporarily. Torah is compared to light: מה אור מגין לעולם, אף תורה מגינה לעולם – Just as light protects forever, so Torah protects forever. Alternatively, the Gemara explains: עבירה מכבה מצוה – an aveirah extinguishes the reward of a mitzvah, just as water extinguishes a lamp, ואין עבירה מכבה תורה – but an aveirah cannot extinguish the reward of Torah, just as light cannot be extinguished, as it says regarding Torah: מים רבים לא יוכלו לכבות את האהבה ­– Many waters cannot extinguish love."
      },
      {
        "id": 1,
        "title": "Which merit suspends the punishment of a sotah - Torah or mitzvos?",
        "paragraph": "The Gemara asked which merit protects a sotah, since she is not commanded in Torah study, and mitzvos do not afford that much protection, as taught above (the protection is “temporary”- i.e., only while actually performing it). Rava ultimately answers: תורה בעידנא דעסיק בה מגנא ומצלא – Regarding Torah study, while he is involved in it, it protects him from punishment and saves him from sinning. בעידנא דלא עסיק בה אגוני מגנא אצולי לא מצלא ­– While he is not involved in it, it protects from punishment but does not save from sin. Regarding mitzvah observance, both while he is and is not involved in it,אגוני מגנא אצולי לא מצלא – it protects from punishment but does not save from sin. Thus, the protection provided by mitzvos extends beyond the time of their performance (and so protect the sotah), and only their “saving” from sin is temporary. Ravina answers: לעולם זכות תורה – Actually, the merit of Torah study does protect the sotah, although she is not commanded in its study: באגרא דמקרין ומתניין בנייהו – In the reward of causing their sons to learn Torah and Mishnah by sending them off to study, ונטרן להו לגברייהו עד דאתו מבי מדרשא – and waiting for their husbands to return from the Bais Medrash, מי לא פלגאן בהדייהו – do they not take a share with them?"
      },
      {
        "id": 2,
        "title": "אני חכמה שכנתי ערמה",
        "paragraph": "Rebbe Avahu provides the source for Rebbe Eliezer’s opinion that one who teaches his daughter Torah is as if he taught her intimacy . Rashi explains that by studying Torah, the daughter will gain a certain cunning, which might embolden her to engage in immoral activities, confident she will not get caught. Rebbe Avahu brought a source, for it is written: \"אני חכמה שכנתי ערמה\" – I [the Torah] am wisdom, I dwelled with cunning, -כיון שנכנסה חכמה באדם נכנסה עמו ערמומית – which teaches us that once the Torah’s wisdom enters a person, cunning enters with it. The Gemara asks how the other Tanna of our Mishnah, who approves of teaching one’s daughter Torah, darshens this pasuk. It answers that it can be darshened the way Rebbe Yose bar Rebbe Chanina did: אין דברי תורה מתקיימין אלא במי שמעמיד עצמו ערום עליהן – The words of Torah only remain in one who allows himself to stand naked for them, abstaining from material pursuits and becoming poor (translating ערמה as nakedness). [Rashi quotes another explanation, that one must use “cunning” to retain his Torah, such as gradually building his knowledge, and learning from all people.] Relatedly, Rebbe Yochanan said: אין דברי תורה מתקיימין אלא במי שמשים עצמו כמי שאינו – The words of Torah only remain with one who makes himself as if he does not exist, as it says: \"והחכמה מאין תמצא\" – which he interprets: and wisdom “from nothingness” will be found."
      }
    ],
    "siman": {
      "title": "Siman - Car (Bostonians Pronounce it \"ca\")",
      "paragraph": "The mother driving the red racecar outfitted with a mitzvah lamp and Torah light, to take her sons to cheder to learn Torah and thereby gain zechusim, figured out a shortcut to avoid traffic because she was cunning from all the Torah her father had taught her."
    }
  },
  {
    "daf": 22,
    "data": [
      {
        "id": 0,
        "title": "קרא ושנה ולא שימש תלמידי חכמים",
        "paragraph": "The Gemara makes numerous statements regarding קרא ושנה ולא שימש תלמידי חכמים – one who studied Torah and Mishnah but did not serve Torah scholars to understand the reasons for the Mishnah. Rebbe Elazar said of such a person: הרי זה עם הארץ – He is an am haaretz (and is unreliable regarding taharah and maaser). Rebbe Shmuel bar Nachmani said: הרי זה בור – He is a boor (i.e., worse than an am haaretz). Rebbe Yannai said: הרי זה כותי – He is like a Kusi, whose wine and bread are forbidden, since he is not vigilant about what the Rabbis say. Rav Acha bar Yaakov said: הרי זה מגוש – He is like a sorcerer, who deceives people through illusions. He, too, creates the false impression that he is a true Torah scholar. Similarly, Rebbe Yitzchak explains the pasuk, \"ועם שונים אל תתערב\" – Do not mix with the “shonim” to mean: אלו ששונים הלכות – these are those who study only halachos (i.e., Mishnayos), without serving Torah scholars to properly understand them. A Baraisa states: התנאים מבלי עולם – Those who recite Mishnayos are ruiners of the world. Ravina explained: שמורין הלכה מתוך משנתן – Because they issue halachic rulings based on the Mishnah without serving Torah scholars to understand it."
      },
      {
        "id": 1,
        "title": "למדנו יראת חטא מבתולה וקיבול שכר מאלמנה",
        "paragraph": "Rebbe Yochanan said: למדנו יראת חטא מבתולה וקיבול שכר מאלמנה – We have learned fear of sin from a maiden, and receipt of reward from a widow. The Gemara explains the former, that Rebbe Yochanan once overheard a maiden who fell on her face and said: רבונו של עולם בראת גן עדן ובראת גיהנם – “Master of the world! You created Gan Eden and You created Gehinnom, בראת צדיקים ובראת רשעים – You created righteous people, and You created wicked people. יהי רצון מלפניך שלא יכשלו בי בני אדם ­– May it be Your will that people should not stumble through me” and inherit Gehinnom instead of Gan Eden. She thus displayed remarkable fear of sin. The latter is explained, that there was a widow who traveled daily to daven in Rebbe Yochanan’s Beis Medrash, although her own neighborhood had a synagogue. Rebbe Yochanan questioned her: בתי לא בית הכנסת בשיבבותך – “My daughter, is there not a synagogue in your neighborhood?” She responded: רבי ולא שכר פסיעות יש לי – “My master, is there not reward for the steps taken in the additional traveling?”"
      },
      {
        "id": 2,
        "title": "שבעה פרושין הן",
        "paragraph": "It was taught in a Baraisa: שבעה פרושין הן – There are seven types of false ascetics, and the Gemara explains them: פרוש שיכמי  – A Shechemite ascetic, זה העושה מעשה שכם – this is one who acts in the way of Shechem, who circumcised themselves for ulterior motives (this ascetic also acts this way for honor). פרוש נקפי – A knocking ascetic, זה המנקיף את רגליו ­– this is one who knocks his feet by shuffling in a show of humility, thus knocking his toes against stones. פרוש קיזאי – A bloodletting ascetic, which is explained: זה המקיז דם לכתלים – this is one who “lets blood” on walls when his head collides with it (from walking with closed eyes to avoid seeing women). פרוש מדוכיא – A “pestle” ascetic, which is explained: דמשפע כי מדוכיא – meaning one who is bent in false humility like a pestle. פרוש מה חובתי ואעשנה ­– An ascetic of “What is my obligation, and I will do it.” The Gemara asks: הא מעליותא היא – but this is a virtue, for he seeks to know what he must do! אלא דאמר מה חובתי תו ואעשנה – Rather, he says, “What else is my obligation and I will do it,” indicating that he has already performed everything. The final two, פרוש מאהבה פרוש מיראה – an ascetic out of love of reward and an ascetic out of fear of punishment, Abaye and Rava said to remove, because Rav taught: לעולם יעסוק אדם בתורה ובמצות אפילו שלא לשמה – One should always occupy himself with Torah and mitzvos even not for its own sake, שמתוך שלא לשמה בא לשמה – because from doing not for its own sake, comes about doing for its own sake."
      }
    ],
    "siman": {
      "title": "Siman - Cab",
      "paragraph": "The boortaxi-cab driver, who studied Torah but did not serve talmidei chachomim, got distracted when his almanah passenger told him that she travelled to the shul at the far end of town for extra reward, and almost crashed into a group of seven false פרושין."
    }
  },
  {
    "daf": 23,
    "data": [
      {
        "id": 0,
        "title": "Cases where the minchas sotah is burned",
        "paragraph": "The next Mishnah states: ואלו שמנחותיהן נשרפות – And these are [the sotahs] whose menachos are burned: האומרת טמאה אני לך – One who says, “I am defiled to you” (i.e., she admits her guilt), ושבאו לה עדים שהיא טמאה ­– and one about whom witnesses came and testified that she is defiled,והאומרת איני שותה – and one who says, “I will not drink,” ושבעלה אינו רוצה להשקותה – and one whose husband does not want to give her to drink, ושבעלה בא עליה בדרך – and one whose husband had relations with her on the way, invalidating her for the procedure, וכל הנשואות לכהנים  – and anyone married to Kohanim, מנחותיהן נשרפות – their menachos are burned. This last case refers to the rule that every valid minchah of a Kohen’s wife (not only that of a sotah) must be burned entirely and not eaten. The other five cases refer to invalidated menachos that cannot be offered."
      },
      {
        "id": 1,
        "title": "What is done with the minchah of a non-Kohenes married to a Kohen",
        "paragraph": "A Baraisa explains why the minchah of a non-Kohenes married to a Kohen is entirely burned: אין מנחתה נאכלת מפני שיש לו חלק בה – her minchah cannot be eaten, because [her husband, a Kohen,] has a share in it (since he funds her minchah), ואינה עולה כליל מפני שיש לה חלק בה – and it is not completely offered on the mizbayach (i.e., without kemitzah, as a Kohen’s minchah is), because she [a non-Kohenes] has a share in it (since it is her minchah). אלא הקומץ קרב בעצמו והשירים קריבין בעצמן – Rather, the kometz is offered by itself and the remainder is brought by itself. The Gemara asks that it should be prohibited to offer the remnants on the mizbayach, because of the principle כל שהוא ממנו לאישים הרי הוא בבל תקטירו – anything that a part of it is brought on the mizbayach, [the remnants] are prohibited to be burned on the mizbayach. Here, the remnants of the wife’s share (a non-Kohenes) would be forbidden to be burned. The Gemara ultimately answers: הקומץ קרב בעצמו – The kometz is offered by itself, והשירים מתפזרים על בית הדשן – and the remainder is scattered over the Place of Ashes (i.e., they are neither burned nor eaten)."
      },
      {
        "id": 2,
        "title": "Arusah and shomeres yavam do not drink sotah waters nor receive their kesubah",
        "paragraph": "The fourth Perek begins: ארוסה ושומרת יבם לא שותות ולא נוטלות כתובה – An arusah (a woman married with kiddushin but before nisuin) and a woman awaiting a yavam, do not drink [the sotah waters], nor do they receive their kesubah, because the Torah says: \"אשר תשטה אשה תחת אישה\" – when a woman will stray while under her husband, implying a full marriage status, פרט לארוסה ושומרת יבם – excluding an arusah and a shomeres yavam. The arusah forfeits her kesubah because her actions prohibited her to the husband (without the possibility of drinking to return to him). Rashi explains that a shomeres yavam, although she may not be prohibited to the yavam, forfeits her kesubah because the yavam can reasonably decline to marry such a woman. The Mishnah adds that for any union prohibited by a negative commandment, such as a widow to a Kohen Gadol, a divorcee or chalutzah (a woman who received chalitzah) to an ordinary Kohen, or a Yisroel marrying a mamzeres (or vice versa), the wife does not drink or receive her kesubah. Rashi explains that the sotah must be one who is otherwise fit to remain married."
      }
    ],
    "siman": {
      "title": "Siman - Kugelach (Game Children Play Similar to Jacks)",
      "paragraph": "The children playing with red kugelach who were coughing from all the smoke coming from minchas sotos that needed to get burned, as well as from the minchah of a non-Kohenes married to a Kohen which was entirely burned on the mizbayach, covered their ears because an arusah and shomeres yavam were wailing after they were told they don’t drink and also don’t receive their kesubah."
    }
  },
  {
    "daf": 24,
    "data": [
      {
        "id": 0,
        "title": "Disputes about if certain women are considered “fit to be married” re: sotah",
        "paragraph": "The Mishnah continues to discuss the eligibility of cases for the sotah waters: מעוברת חבירו ומניקת חבירו –The pregnant former wife of his friend, and the nursing former wife of his friend, do not drink according to Rebbe Meir, because there is a Rabbinic prohibition to marry either (lest she become pregnant while she is nursing the child), and she is not fit to be married to this husband. The Chachomim disagree:יכול הוא להפרישה ולהחזירה לאחר זמן – He can separate from her and take her back after the prescribed period of time, so she is fit to be married to this man. איילונית וזקינה ושאינה ראויה לילד – An aylonis (one who does not physically mature), an old woman, and a woman who cannot give birth do not drink according to the Tanna Kamma, because the husband must marry someone who can bear children (if he has not yet fulfilled his obligation). Rebbe Eliezer says:יכול הוא לישא אשה אחרת ולפרות ולרבות הימנה  – He can marry another one in addition and be fruitful and multiply from her, so he may also remain married to this woman."
      },
      {
        "id": 1,
        "title": "Machlokes if shomeres yavam drinks as a sotah",
        "paragraph": "The Gemara notes that our Mishnah, which teaches that both an arusah and shomeres yavam are not given to drink, reflects the view of Rebbe Yonasan. Rebbe Yoshiyah says: The words: \"תחת אישך\" – “under your husband,” \" פרט לארוסה- exclude an arusah who is not fully under her husband’s jurisdiction. Because one may have thought to exclude even a shomeres yavam, therefore the Torah said,\"איש איש\" – “any man,” to include it. Rebbe Yonasan says: \"תחת אישך\" פרט לשומרת יבם – “from under your husband” excludes a shomeres yavam. אוציא שומרת יבם ולא אוציא את ארוסה – Perhaps I should exclude a shomeres yavam but not exclude an arusah, therefore the Torah writes another exclusion ,\"אשר תשטה אשה תחת אישה\" פרט לארוסה – “when a woman will stray from under her husband,” to exclude an arusah as well. The Gemara notes that besides for the practical machlokes about shomeres yavam, they also argue which case should be excluded first. Rebbe Yonasan first excludes shomeres yavam, because regarding an arusah, דקידושי דידיה וסוקלין על ידו – it is the arus’ own act of kiddushin that established the bond, (as opposed to the yavam’s brother), and they stone for adultery because of him. Rebbe Yoshiyah first excludes arusah, because a shomeres yavam can be acquired with any relations, even not for the purpose of marriage."
      },
      {
        "id": 2,
        "title": "קדמה שכיבת בעל לבועל in the cases of arusah and shomeres yavam",
        "paragraph": "The Gemara asks, why a pasuk is needed to exclude an arusah and shomeres yavam from the law of sotah? But there is a principle taught by a Baraisa: \"מבלעדי אישך\" – “other than your husband,” which teaches משקדמה שכיבת בעל לבועל – only when the husband’s relations with her preceded the adulterer’s, ולא שקדמה שכיבת בועל לבעל – and not when the adulterer’s relations preceded the husband’s. An arusah has not yet had relations with her husband, so how could she possibly be a valid sotah? Rami bar Chama answers: כגון שבא עליה ארוס בבית אביה – in a case where the arus had relations with her at her father’s home, which do not effect nisuin. The Gemara persists that in the parallel case of shomeres yavam, if she had relations with the yavam while at her father’s home, she would be a full-fledged wife (and a valid sotah), because Rav said, about a yevamah who had relations not for the intent of yibum: קנה לכל – he acquired her for all matters. The Gemara answers that it follows the opinion of Shmuel, who said about this case: לא קנה אלא לדברים האמורים בפרשה – he only acquired her for the matters written in the section about yibum, and she is not a full-fledged wife."
      }
    ],
    "siman": {
      "title": "Siman - Jug",
      "paragraph": "The group of women ineligible for the “fit to be married” sotah jug, who first smirked when the jugs were knocked over by an arusah and shomeres yavam arguing which one of them would be excluded from sotah first, got queasy when the arusah was accused of having relations with her arus in her father’s house prior to becoming a sotah."
    }
  },
  {
    "daf": 25,
    "data": [
      {
        "id": 0,
        "title": "If an עוברת על דת requires a warning before forfeiting her kesubah",
        "paragraph": "The Gemara inquires: עוברת על דת צריכה התראה להפסידה כתובתה או אינה צריכה – Regarding [a woman] who transgresses the code of Jewish conduct (e.g., she goes to public places with her hair uncovered), does she require a warning to forfeit her kesubah, or does she not require a warning? It may be that she loses the kesubah for the actions themselves, even without warning, or perhaps she was given a chance to repent. After two attempts are rejected, a proof is brought from our Mishnah, which taught that Beis Din will warn a woman (not to be secluded with someone) on behalf of a husband who cannot do so himself (e.g., he became a deaf-mute, insane, or is imprisoned), and it concludes: ולא להשקותה אמרו אלא לפוסלה מכתובתה – they did not say this warning regarding giving her to drink (since the husband did not issue the warning), but only to disqualify her from her kesubah. This proves that a warning is required before forfeiting a kesubah for עוברת על דת."
      },
      {
        "id": 1,
        "title": "Can a husband wave his קינוי?",
        "paragraph": "The Gemara inquires: בעל שמחל על קינויו קינויו מחול או אינו מחול – A husband who waived his warning, is his warning waived or not? Is the efficacy of the warning dependent on the husband, allowing him to cancel it (and permit her to him), or not? Ultimately, the Gemara quotes Rebbe Yoshiyah, who testified he heard three things from Zeira of Yerushalayim: בעל שמחל על קינויו קינויו מחול ­– A husband who waived his warning, his warning is waived; וזקן ממרא שרצו בית דין למחול לו מוחלין לו – a rebellious elder whom Beis Din wished to pardon, they may pardon him; ובן סורר ומורה שרצו אביו ואמו למחול לו מוחלין לו – and a wayward and rebellious son whom his father and mother wished to pardon, they may pardon him. His colleagues in the South disagreed in the case of the rebellious elder: שלא ירבו מחלוקת בישראל – so that disputes should not increase in Yisroel. This Baraisa proves that a husband may cancel his warning. Rav Acha and Ravina argued if the husband is only able to cancel the warning before she secludes herself, but not afterwards (when she is already forbidden), or if he can do so even afterwards. The Gemara supports the first opinion from a Baraisa from Daf 7, where the Rabbonon argued that a husband is more trustworthy regarding a niddah, who will become permitted, than a sotah, who will not. This indicates she can never become permitted again, even through canceling the warning."
      },
      {
        "id": 2,
        "title": "Rav Nachman says an aylonis is unanimously ineligible for sotah",
        "paragraph": "In the Mishnah, the Tanna Kamma and Rebbe Eliezer argued if women who could not bear children were eligible for sotah, since the husband is required to have children (or if we say he can marry another at the same time). Here, Rav Nachman says in the name of Rabba bar Avahu: מחלוקת בעקרה וזקינה – The argument is only in the cases of a barren woman and an elderly woman, אבל איילונית דברי הכל לא שותה ולא נוטלת כתובתה – but regarding an aylonis, everyone agrees she neither drinks nor collects her kesubah, because the pasuk says: \"ונקתה ונזרעה זרע\" – Then she will be innocent and bear seed (children), teaching that only מי שדרכה להזריע – one whose way is to bear seed is eligible for drinking, יצאה זו שאין דרכה להזריע – excluding this [aylonis] whose way is not to bear children from birth, as opposed to the elderly woman or barren woman (who lost the ability to bear children through injury)."
      }
    ],
    "siman": {
      "title": "Siman - Silver Anniversary (25 years)",
      "paragraph": "It was an awkward moment at the red-themed silver anniversary party when after the husband warned his wife she would lose her kesubah if she was an  עוברת על דת and then publicly was mochel his recent קינוי, his wife responded indignantly and revealed that she was an aylonis and ineligible to drink the sotah waters anyway."
    }
  },
  {
    "daf": 26,
    "data": [
      {
        "id": 0,
        "title": "Machlokes about a possible blessing for an exonerated sotah",
        "paragraph": "The Gemara quotes a Baraisa which explicitly says an aylonis is eligible to drink sotah waters, not like Rav Nachman had said. He answers that it is a machlokes Tannaim and quotes a Tanna who darshens\"ונקתה ונזרעה זרע\" – then she shall be proven innocent and will bear seed, as he did, to exclude an aylonis who was incapable of bearing children. The Gemara explains that the other Tannaim darshen this pasuk the way it is taught in a Baraisa: Rebbe Akiva says that \"ונקתה ונזרעה זרע\" – she shall be proven innocent and bear seed teaches שאם היתה עקרה נפקדת – that if she was barren, she will be remembered and bear a child. Rebbe Yishmael objected that if so, all barren women will intentionally make themselves sotahs in order to reap the benefits of this blessing, and a modest woman who does not engage in immoral behavior will not!? Rather, the pasuk teaches more minor blessings (which would not be an incentive to become a sotah): שאם היתה יולדת בצער יולדת בריוח – that if she formerly gave birth with pain, she will give birth with ease; נקבות יולדת זכרים – if she had females, she will bear males; קצרים יולדת ארוכים – if she had short children, she will bear tall ones; שחורים יולדת לבנים – if she had swarthy children, she will bear fair ones."
      },
      {
        "id": 1,
        "title": "עובד כוכבים מקנין על ידו ופוסל בתרומה",
        "paragraph": "Rav Hamnuna said: עובד כוכבים מקנין על ידו ופוסל בתרומה – Regarding an idolator, one can warn his wife [not to be secluded] with him, and he disqualifies a woman from eating terumah if he has relations with her. The Gemara explains the novelty in the first clause: מהו דתימא \"נטמאה\" \"נטמאה\" שתי פעמים – One would think, since it says “she became defiled,” “she became defiled,” two times, אחד לבעל ואחד לבועל – one teaching she is prohibited to the husband, and one teaching she is prohibited to the adulterer, היכא דקמיתסרא בהא זנות – so the sotah laws only apply where she becomes forbidden to the adulterer with this suspected adultery, אבל הא הואיל ואסורה וקיימא – but here, since she is already forbidden to [the idolator], perhaps the laws of sotah do not apply (and she would not become prohibited to the husband). Therefore, Rav Hamnuna taught that they do. The novelty of the second law is explained: The pasuk which teaches that relations with someone unfit to marry her disqualify her from terumah uses the words: כי תהיה לאיש זר – she shall “be” to a strange man (meaning relations), so one might think דבר הויה אין דלאו בר הויה לא – someone who is capable of “being” (i.e., kiddushin) does disqualify from terumah, but someone (such as an idolator) who is not capable of “being” (kiddushin) does not. Rav Hamnuna taught that this is not so, based on a derashah."
      },
      {
        "id": 2,
        "title": "אין זנות לבהמה",
        "paragraph": "The Mishnah had taught that the husband cannot warn against “one who is not a man.” After rejecting the first two interpretations, the Gemara concludes: למעוטי בהמה דאין זנות בבהמה – It means to exclude an animal, because there is no harlotry regarding relations with an animal (meaning, they are not considered relations, despite incurring the death penalty). Our Mishnah is teaching that warning against seclusion with an animal would not render her a sotah. The source for this concept is from the pasuk: \"לא תביא אתנן זונה ומחיר כלב\" – You shall not bring a harlot’s hire or an exchange for a dog as a korban, and a Mishnah teaches: אתנן כלב ומחיר זונה מותרין – the reverse cases, hire for a woman to have relations with a dog, and exchange for a harlot, are permitted to be used as a korban, because the pasuk says: \"גם שניהם\" שנים ולא ארבעה – both of them, implying two cases of payments cannot be used for a korban, but not four (i.e., the latter pair of cases)."
      }
    ],
    "siman": {
      "title": "Siman - Military Coup",
      "paragraph": "The tall, fair skinned soldiers in red uniforms, children of an exonerated sotah, who were on a mission to find the idolater their mother had been warned against, found him hiding behind her dog."
    }
  },
  {
    "daf": 27,
    "data": [
      {
        "id": 0,
        "title": "דומה vs. בת דומה, רוב בעילות אחר הבעל",
        "paragraph": "Shmuel says: If a person has no other choice: ישא אדם דומה ואל ישא בת דומה – a person should sooner marry a woman of ill repute (i.e., she is broadly suspected of immoral activities), and not marry the daughter of a woman of ill repute, שזו באה מטיפה כשרה וזו באה מטיפה פסולה – because [the mother] comes from fit seed, while [the daughter] possibly comes from unfit seed (the mother, who is suspected of promiscuity, may have conceived from a mamzer or Gentile, rendering the child unfit for marriage). Rebbe Yochanan says the reverse: ישא אדם בת דומה ואל ישא דומה – A person should sooner marry the daughter of a woman of ill repute, and not marry a woman of ill repute,שזו עומדת בחזקת כשרות וזו אינה עומדת בחזקת כשרות – because [the daughter] stands with a presumption of fitness (i.e., she is not herself suspected of adultery), and [the mother] does not stand with a presumption of fitness (she is suspected of adultery, and may become forbidden to her husband without his knowledge). The halachah accords with Rebbe Yochanan, based on a Baraisa: אשה מזנה בניה כשרין – A woman who is mezaneh (has illicit relations), her children are nonetheless fit for marriage to regular Jews, because רוב בעילות אחר הבעל – most relations are with the husband, so the children are presumed to be his."
      },
      {
        "id": 1,
        "title": "Excluding the blind, crippled, and mute from sotah",
        "paragraph": "It was taught in a Baraisa, when the pasuk says: \"אשר תשטה אשה תחת אישה\" – When a woman shall stray while under her husband, the juxtaposition teaches to compare a man to a woman and a woman to a man in the laws of sotah. כשם שאם הוא סומא לא היה משקה – Just as if he (the husband) is blind, he would not cause her to drink, because the pasuk describes her activities as “hidden from her husband’s eyes,” implying sight, כך היא אם היתה סומא לא היתה שותה – so too if she is blind, she does not drink. כשם שחיגרת וגידמת לא היתה שותה – Just as if she is lame or missing hands, she would not drink (because the sotah is described as “standing” before Hashem and waving the minchah on her “palms”), so too if he is lame or missing hands, he does not cause her to drink. כשם שאילמת לא היתה שותה – Just as if she is mute, she does not drink, because she must answer “Amen” to the oaths, so too if he is mute, he does not cause her to drink."
      },
      {
        "id": 2,
        "title": "כשם שאסורה לבעל כך אסורה לבועל",
        "paragraph": "In the first Mishnah of the fifth Perek, Rebbe Akiva says: כשם שאסורה לבעל כך אסורה לבועל – Just as she is prohibited to the husband, so too she is prohibited to the adulterer through the adultery, even after her husband’s death or divorce. He darshens it from the extra “vav” in \"ונטמאה\". Rebbi offers a different source: שני פעמים האמורים בפרשה נטמאה ונטמאה – Twice in the portion it is said, “she is defiled,” “she is defiled,” אחד לבעל ואחד לבועל – one teaching she is prohibited to the husband, and one teaching she is prohibited to the adulterer. The Mishnah continues with several other derashos which were made on the day Rebbe Elazar ben Azaryah was installed as nasi."
      }
    ],
    "siman": {
      "title": "Siman - Kazoo (a toy instrument that children blow into that makes a buzzing sound)",
      "paragraph": "The red-kazoo band playing at the chasunah of a man and the daughter of a woman of ill repute, while the blind, crippled and mute, sotah-exempt Bubby and Zaidy clapped along, did not cheer up the miserable adulterer who was prohibited to the sotah even after her husband’s death."
    }
  },
  {
    "daf": 28,
    "data": [
      {
        "id": 0,
        "title": "Machlokes about the source that the waters test the adulterer",
        "paragraph": "In the Mishnah, Rebbe Akiva taught: המים בודקין אותו – the waters test him, which the Gemara here explains to mean the suspected adulterer will also die. The Gemara proves that Rebbe Akiva’s derashah is from the extra “vav” in the word \"ובאו\" – and [the waters] shall enter and explains what he learns from all three instances of the word \"ובאו\" and their extra vav’s. Rebbi, who does not darshen the extra vav’s, provides another source that the waters test the adulterer: \"לצבות בטן ולנפיל ירך\" – to cause the stomach to distend and thigh to fall, בטנו ויריכו של בועל – this refers to the adulterer’s stomach and thigh. It cannot refer to hers, because that is mentioned later. Rebbe Akiva explains that this pasuk teaches that the Kohen informs her of the order of her punishment (which is the reverse of the apparent order in the pesukim), so no one should discredit the effectiveness of the water."
      },
      {
        "id": 1,
        "title": "The source that a sotah is forbidden to her husband out of doubt",
        "paragraph": "It was taught in a Baraisa: מה תלמוד לומר \"והיא נטמאה\" \"והיא לא נטמאה\" – What is the pasuk teaching by saying “and she had become defiled,” and “and she had not become defiled”? They have opposite implications whether she is known to have been defiled, or known not to have been defiled, and the pasuk follows by requiring the test of the waters. אם נטמאה למה שותה – If she was known to be defiled, why does she drink? אם לא נטמאה למה משקה – If it is known she was not defiled, why does he cause her to drink? Either way, the test should not be required! Rather, her guilt or innocence must be unknown.מגיד לך הכתוב שהספק אסורה ­– The pasuk tells you that the case of doubt is forbidden, meaning she is forbidden to her husband until drinking the waters. Tosafos adds that the Torah is teaching that she is definitely forbidden to her husband during the time of doubt, even if in truth she is innocent."
      },
      {
        "id": 2,
        "title": "Laws of safek tumah are derived from a sotah",
        "paragraph": "The Baraisa continues: מכאן אתה דן לשרץ – From here you can compare to sheretz (i.e., tumah). If regarding sotah, who does not become forbidden to her husband if she had illicit relations against her will or through error (where she thought it was her husband), עשה בה ספק כודאי – yet the Torah treated a case of doubtful defilement like definite defilement, then sheretz, which is metamei through contact regardless of intent, certainly cases of doubtful tumah should be treated as definite tumah.Limitations of this principle are also derived from sotah: מה סוטה רשות היחיד – Just as sotah is prohibited only if she is secluded in a private domain, אף שרץ רשות היחיד – so too the law of doubtful tumah from sheretz is only in a private domain. ומה סוטה דבר שיש בו דעת לישאל – And just as sotah is something with the intelligence to be asked if she became defiled, אף שרץ דבר שיש בו דעת לישאל – so too the law of doubtful tumah from sheretz is only when the potential recipient of tumah is something with the intelligence to be asked if it became tamei. But if the doubtful contact with tumah occurred in a public domain, or if it occurred to something lacking intelligence, the doubtful tumah is ruled tahor."
      }
    ],
    "siman": {
      "title": "Siman - Strong Man",
      "paragraph": "When the strong man adulterer working out in the gym began to swell and then exploded, the husband who had been forbidden to his wife because of a safek came in to see because he heard a commotion and found a dead sheretz with a picture of his sotah wife inside a reshus hayachidin its mouth."
    }
  },
  {
    "daf": 29,
    "data": [
      {
        "id": 0,
        "title": "Defilement for terumah is relevant during husband’s lifetime. Defilement for Kehunah is only after his death.",
        "paragraph": "In a Baraisa on the previous Daf, after Rebbe Akiva darshened that a suspected sotah is forbidden to the husband, the adulterer, and terumah, Rebbe Yishmael added that she should be disqualified for marriage to Kehunah as well, based on a kal vachomer from terumah. The Gemara explains that Rebbe Akiva has four pesukim to darshen (the word \"נטמאה\" written three times, and one with a “vav,” which Rebbe Akiva darshens), the fourth being for Kehunah. Rebbe Yishmael, who does not darshen the extra vav, derives Kehunah from a kal vachomer. The Gemara asks how Rebbe Yishmael can assume that the third נטמאה includes terumah, allowing him to derive Kehunah from a kal vachomer, when perhaps the third נטמאה comes to include only Kehunah itself, and terumah would be permitted to a suspected sotah?It answers: מסתברא דומיא דבעל ובועל – It is reasonable that the third “defilement” is similar to the first two, those of the husband and the adulterer. מה בעל ובועל מחיים אף תרומה נמי מחיים – Just as the defilements to the husband and adulterer are relevant [even] during the husband’s lifetime, so too defilement for terumah is relevant during his lifetime, לאפוקי כהונה דלאחר מיתה – as opposed to Kehunah, which is only relevant after the husband’s death. While he is alive, she is either married to him or a divorcee, and forbidden to Kehunah regardless."
      },
      {
        "id": 1,
        "title": "The source for shelishi by terumah",
        "paragraph": "In the Mishnah on Daf 27b, Rebbe Akiva darshened that a sheini of tumah can be metamei even chullin, making it a shelishi. Rebbe Yehoshua noted that Rebbe Yochanan ben Zakkai used to say that a later generation would rule a shelishi is tahor even regarding terumah, since he had no Scriptural source. The Gemara here asks that if there is no source, why then is a shelishi tamei for terumah? Rav answers that although there is no passuk, there is a kal vachomer: ומה טבול יום שמותר בחולין פוסל בתרומה – If a tevul yom, who is permitted to eat chullin (including maaser sheini, which is prohibited to a tamei), still is unfit to eat terumah, ככר שני שפסול בחולין – then a loaf which is a sheini, which is unfit as chullin (i.e., if it is maaser sheini, it is prohibited in consumption), אינו דין שיעשה שלישי בתרומה – is it not logical that it would make a shelishi of terumah? Ultimately, the Gemara concludes that it is derived through a tzad hashaveh (common denominator) from tevul yom and an earthenware utensil."
      },
      {
        "id": 2,
        "title": "The source for revii of kodesh, and its possible rebuttal",
        "paragraph": "Rebbe Yose teaches that kodesh (meat of kodshim) can become a revii based on a kal vachomer from mechusar kippurim (one who requires a korban to complete his taharah process, after he has immersed and night has fallen, whose tumah is weaker than that of a tevul yom): מה מחוסר כיפורים – If even a mechusar kippurim, שמותר בתרומה פסול בקודש – who is permitted to eat terumah, yet is unfit to eat kodesh, שלישי שפסול בתרומה אינו דין הוא שיעשה רביעי בקודש – then a shelishi, which is unfit to be eaten regarding terumah (as derived above), is it not logical that it should make a revii of kodesh?Rebbe Yochanan declared he could not understand Rebbe Yose’s reasoning, because the rebuttal of his logic is at its side: אוכל הבא מחמת טבול יום יוכיח – Food which became [tamei] through a tevul yom proves otherwise, שפסול בתרומה ואינו עושה רביעי בקודש – because it is unfit for terumah, yet it does not make a revii even of kodesh! The Gemara presents a machlokes Tannaim if food which became tamei from a tevul yom can make a revii of kodesh or not and explains how Rebbe Yochanan knew that Rebbe Yose holds it does not."
      }
    ],
    "siman": {
      "title": "Siman - Cot",
      "paragraph": "The sotah who became assur on the terumah that was placed on the red cot during the lifetime of the בעל and the בועל, got upset when she heard the ככר  שני touched the  תרומה making it a שלישי, so she quickly ran to save the  קודש meat and prevented it from becoming a רביעי."
    }
  },
  {
    "daf": 30,
    "data": [
      {
        "id": 0,
        "title": "Taking challah from a tahor dough on a tamei dough",
        "paragraph": "Rav lists five Tannaim who hold that a sheini cannot make a shelishi in chullin. Among them is Rebbe Eliezer, who explained in a Mishnah how to take challah from a tahor dough for a tamei dough without being metamei the tahor dough: נוטל כדי חלה מעיסה שלא הורמה חלתה – He takes a challah-amount from the [tahor] dough from which challah has not yet been removed (if it was, it would be ineligible to permit the tamei dough). ונותן פחות מכביצה באמצע כדי ליטול מן המוקף – He then puts less than an egg-volume [of tahor dough] in the middle, connecting the two, in order to take [challah] from “near” the dough becoming permitted, as required whenever taking challah. Because the center dough is smaller than a k’beitzah, it cannot be metamei the dough becoming challah. In a Baraisa, Rebbe Eliezer is quoted as allowing the center dough to be a k’beitzah, yet it will not be metamei the tahor dough, because the center dough is a sheini, which he holds does not make a shelishi in chullin (which is the tahor dough’s current status). Rebbe Eliezer of the Mishnah agrees with this point but requires less than k’beitzah for other reasons. The Chachomim do not allow this method, and the Gemara discusses their dispute."
      },
      {
        "id": 1,
        "title": "Machlokes how the שירה was recited by the Yam Suf",
        "paragraph": "A Baraisa records a machlokes on the way Moshe and the nation recited the שירה by the Yam Suf. Rebbe Akiva says: כגדול המקרא את הלל – It was performed like an adult leading Hallel for a congregation,והן עונין אחריו ראשי פרקים – and they respond after him with the chapter headings (since their obligation is fulfilled by listening to his recitation). Accordingly, Moshe said: \"אשירה לה'\" – I will sing to Hashem, and the nation responded, \"אשירה לה'\". Moshe then said: \"כי גאה גאה\" – for he is exalted above the arrogant, and the nation again responded, \"אשירה לה'\", and so on. Rebbe Eliezer, son of Rebbe Yose Haglili, says: כקטן המקרא את הלל – It was performed like a minor leading Hallel for a congregation, והן עונין אחריו כל מה שהוא אומר – and they respond after him by repeating everything he says, since they cannot fulfill their obligation through hearing his recitation. He holds Moshe said, \"אשירה לה'\", and the nation repeated it, then Moshe said, \"כי גאה גאה\", and the nation repeated it, and so on. Rebbe Nechemyah says: כסופר הפורס על שמע בבית הכנסת – It was performed like a chazzan (lit., teacher) leading the berachos before Shema in the synagogue, שהוא פותח תחילה והן עונין אחריו – that he begins first and they respond after him with the opening phrase, and they recite the rest together. Here, too, Moshe began with \"אשירה לה'\", which the nation repeated, and they said the rest together through Ruach Hakodesh."
      },
      {
        "id": 2,
        "title": "Infants recited the שירה",
        "paragraph": "Rebbe Yose Haglili darshened: עולל מוטל על ברכי אמו ותינוק יונק משדי אמו – Even an infant lying on its mother’s knees, and a suckling nursing at its mother’s breasts, כיון שראו את השכינה – when they saw the Shechinah at the Sea, עולל הגביה צוארו ותינוק שמט דד מפיו – the infant lifted its neck and the suckling removed the breast from its mouth, ואמרו \"זה קלי ואנוהו\" – and said, “This is my G-d and I will glorify Him.” Rebbe Meir added: מנין שאפי' עוברים שבמעי אמן אמרו שירה – From where do we know that even fetuses in their mother’s wombs recited the שירה? Because it says: במקהלות ברכו אלקים ה' ממקור ישראל – In congregations bless G-d, Hashem, from the “source” of Yisroel, which is interpreted as the womb, a person’s “source.”"
      }
    ],
    "siman": {
      "title": "Siman - Rebbe (Melamed)",
      "paragraph": "The Rebbe in the red classroom who did such a fascinating demonstration for parents on how to take challah from a tahor dough for a tamei dough without being metamei the tahor dough, as his talmidim reenacted how the shirah was sung at Yam Suf, that even the infants on their parents’ laps started to sing too."
    }
  },
  {
    "daf": 31,
    "data": [
      {
        "id": 0,
        "title": "The difference between serving Hashem out of fear or love",
        "paragraph": "The Gemara says that since the phrase \"ירא אלקים\" is written both by Iyov and Avraham, this teaches: מה ירא אלקים האמור באברהם מאהבה – Just as the “fearing of Hashem” said regarding Avraham stemmed from love of Hashem (since he is called \"אברהם אוהבי\" – Avraham who loved Me”), אף ירא אלקים האמור באיוב מאהבה – so too the “fearing of Hashem” said regarding Iyov stemmed from love of Hashem. The Gemara explains the difference between one who acts out of fear or love of Hashem: Rebbe Shimon ben Elazar said, גדול העושה מאהבה יותר מן העושה מיראה – Greater is one who acts out of love of Hashem than one who acts out of fear of Hashem, שזה תלוי לאלף דור וזה תלוי לאלפים דור – for the merit of [he who acts out of fear] lasts for a thousand generations, and the merit of this [he who acts out of love] lasts for two thousand generations, because one pasuk says: לאלפים לאהבי ולשומרי מצותי – “for thousands of generations to those who love Me and those who guard my mitzvos,” and another says: ולשומרי מצותיו לאלף דור – “and to those who guard His mitzvos [i.e., those who act out of fear], for a thousand generations” (the number of generations is understood to refer to the closest phrase)."
      },
      {
        "id": 1,
        "title": "One witness to טומאה is sufficient to prevent the sotah from drinking and receiving her kesubah",
        "paragraph": "The first Mishnah in the sixth Perek teaches that although there is a machlokes regarding how many witnesses are required to establish their seclusion, tumah is different: אמר עד אחד אני ראיתיה שנטמאת – If one witness said, “I saw her become defiled,” לא היתה שותה – she would not drink because he is believed, and she loses her kesubah as well. A Baraisa establishes the source: since the Torah elsewhere refers to a single witness as \"עד אחד\" – one witness, instead of simply עד, this teaches thatכל מקום שנאמר עד הרי כאן שנים – anywhere it says \"עד\" in the Torah, it really means there are two witnesses, עד שיפרוט לך הכתוב אחד – unless the Torah specifies “one” as it did above. Based on this principle, the pasuk about sotah which says: \"ועד אין בה\" – there is no “witness” about her means: תרי לית בה אלא חד – two witnesses to her defilement there are not, but one witness there is, and about this the Torah says \"והיא לא נתפשה\" אסורה – “and she was not forced” for relations and is therefore forbidden. Thus, a single witness is relied upon to establish her tumah."
      },
      {
        "id": 2,
        "title": "Conflicting testimony from single witnesses about tumah",
        "paragraph": "The Mishnah says that if one witness says she was defiled and one says she was not, the sotah drinks (meaning it remains in doubt). The Gemara asks, having proven that a single witness is believed that she had relations, how can a single witness contradict that testimony? But Ulla taught: כל מקום שהאמינה תורה עד אחד – Wherever the Torah believed a single witness, הרי כאן שנים – it has the equivalence of two witnesses (that are normally required), ואין דבריו של אחד במקום שנים – therefore (since the second witness has no special status), the words of this one witness are not considered next to those of “two” (the single believed witness), so her tumah should be established. Because of this question, Ulla and Rav Yitzchak emended the Mishnah to read: לא היתה שותה – She would not drink, i.e., the first testimony is accepted, and her adultery is confirmed. Rebbe Chiya, however, did not emend the Mishnah, and explains: כאן בבת אחת – [The Mishnah] is a case where the witnesses testified at the same time (before the first one’s testimony was accepted), כאן בזה אחר זה – but [Ulla’s statement] is a case where the witnesses testified one after the other, so the first witness’s testimony was accepted and attained the force of two witnesses."
      }
    ],
    "siman": {
      "title": "Siman - Judge (based on association to law)",
      "paragraph": "The judge who banged his red heart-shaped gavel and declared that serving Hashem from love is greater than serving from fear, proceeded to listen to one witness say, “I saw the woman become tamei,” followed immediately by a conflicting witness who said she was not."
    }
  },
  {
    "daf": 32,
    "data": [
      {
        "id": 0,
        "title": "The description of the ברכות and קללות on הר גריזים and הר עיבל",
        "paragraph": "The seventh Perek begins by listing seven statements that one may say in any language which he understands, including the parsha of sotah in the Torah, and eight statements which must be made in the original לשון הקודש text, including the ברכות and קללות which were declared and accepted when Klal Yisroel entered Eretz Yisroel. The Mishnah describes the procedure of the Blessings and Curses: After the Mishnah identifies its location (which is a point of dispute discussed on Daf 33), it states: ששה שבטים עלו לראש הר גריזים – Six tribes ascended to the peak of Mount Gerizim, וששה שבטים עלו לראש הר עיבל – and six tribes ascended to the peak of Mount Eival, והכהנים והלוים והארון עומדים למטה באמצע – and the Kohanim, Leviim, and the Aron stood in the center, with the Kohanim surrounding the Aron, and the Leviim surrounding the Kohanim. The Kohanim and Leviim then turned towards Har Gerizim and declared the first Blessing, and everyone on both mountains responded, “Amen!” They then turned towards Har Eival and declared the first Curse, and everyone on both mountains responded, “Amen!” and so on until the end. They then took the stones out of the Jordan, built a mizbayach, coated it with plaster, and wrote the Torah on it in seventy languages."
      },
      {
        "id": 1,
        "title": "אדם אומר שבחו בקול נמוך וגנותו בקול רם",
        "paragraph": "Rebbe Shimon ben Yochai said: אדם אומר שבחו בקול נמוך – A person should say his praise in a low voice, וגנותו בקול רם – and his disgrace in a loud voice. שבחו בקול נמוך מן וידוי המעשר – His praise in a low voice can be derived from the maaser confession, where the reciter declares his having performed the mitzvos properly, and the Torah does not use the word \"ענה\" – speak up. גנותו בקול רם ממקרא ביכורים – His disgrace in a loud voice can be derived from the bikkurim recitation, which includes the wickedness of our ancestor Lavan, about which the Torah says \"וענית ואמרת\" – You should speak up and say. The Gemara asks that Rebbe Shimon ben Yochai himself said one should not declare his shortcoming in a loud voice: מפני מה תקנו תפלה בלחש – Why did they institute prayer to be recited quietly? כדי שלא לבייש את עוברי עבירה – In order not to shame sinners who confess during their prayer. Therefore, the Gemara emends his statement to read \"צערו\" – his trouble, as a Baraisa teaches about a metzora and elsewhere: וכל מי שאירע בו דבר צריך להודיע לרבים – Anyone to whom a misfortune occurred must inform the public, ורבים מבקשים עליו רחמים – and the public will beseech Heaven for mercy for him."
      },
      {
        "id": 2,
        "title": "Machlokes about which language for Shema",
        "paragraph": "The Mishnah taught that Shema may be said in any language. A Baraisa records a machlokes on this subject. Rebbi says: קרית שמע ככתבה – The recital of Shema must be done as it is written in the Torah (in Lashon HaKodesh). The Chachomim say: בכל לשון – in any language he understands. Rebbi darshens \"והיו\" – and they shall be, to teach בהווייתן יהו – they shall always be the way they are, in Lashon HaKodesh. The Chachomim say that the word \"שמע\" – Hear, implies  בכל לשון שאתה שומע- in any language you understand. The Chachomim darshen Rebbi’s pasuk (והיו) to teach: שלא יקראנה למפרע – that he cannot read it backwards (which Rebbi darshens from elsewhere). Rebbi darshens the Chachomim’s pasuk (שמע) to teach: להשמיע לאזניך מה שאתה מוציא מפיך – to make heard to your ears that which you express with your mouth (i.e., it must be audible). The Chachomim hold like the opinion that one is yotzei without saying it audibly."
      }
    ],
    "siman": {
      "title": "Siman - Scientist in a Lab",
      "paragraph": "The two red labs set up on top of two mountains facing each other, tried to detect if the person speaking softly down in the valley below was expressing his own praise or disgrace, and picked up instead that he was reciting the Shema in Swahili, a language he could understand."
    }
  },
  {
    "daf": 33,
    "data": [
      {
        "id": 0,
        "title": "Contradiction if tefillah can be in any language",
        "paragraph": "The Mishnah taught that tefillah can be said in any language. The Gemara explains: רחמי היא – It is a request for Hashem’s mercy, therefore כל היכי דבעי מצלי – however he wants, he can pray. Rashi adds that in the language he understands, he will better focus. The Gemara asks that Rav Yehudah said: לעולם אל ישאל אדם צרכיו בלשון ארמית – A person should never ask for his needs in Aramaic, because Rebbe Yochanan said that malachim do not attend to his tefillah in Aramaic, because they do not know it. The Gemara answers: הא ביחיד הא בצבור – This advice against praying in Aramaic is for a single person praying alone, whose prayer requires the help of malachim, whereas this Mishnah’s statement that one can pray in any language is for a congregation, whose prayers do not require assistance. The Gemara challenges Rebbe Yochanan’s statement, that malachim do not know Aramaic, by relating two incidents in which the Kohen Gadol heard a bas kol from the Kodesh Hakadashim speaking in Aramaic. It answers either that a bas kol is different, since its role is to convey messages, or that it was Gavriel, who knows all languages (since he taught them to Yosef)."
      },
      {
        "id": 1,
        "title": "Machlokes about the location of Har Gerizim and Har Eival",
        "paragraph": "The Mishnah stated that Har Gerizim and Har Eival are near Shechem. This is the subject of a machlokes in a Baraisa. The passuk lists numerous identifying features of these mountains: \"בעבר הירדן\" – across the Yarden, \"אחרי דרך מבוא השמש\" – far from the direction of the sun’s coming, \"בארץ הכנעני הישב בערבה\" – in the land of the Canaanite who dwells in the plain, \"מול הגלגל\" – opposite Gilgal, \"אצל אלוני מרה\" – near Elon Moreh. Rebbe Yehudah holds like our Mishnah and interprets the passuk: “Across the Yarden” means מעבר לירדן והלאה – across the Yarden and far beyond. “The sun’s coming” meansמקום שחמה זורחת – the place of the sun’s rising (east), so “far from” its coming means far to the west. He then identifies their location as in the land of the כותים, near Shechem, which we derive from a gezeirah shavah that Elon Moreh is near Shechem. Rebbe Elazar bar Rebbe Yose declared he disproved the כותים’s philosophy (of believing תורה שבכתב and not תורה שבעל פה) by challenging them how they determined the identity of Elon Moreh.  Rebbe Elazar disagreed with Rebbe Yehudah and explained “across the Yarden” to mean סמוך לירדן – near the Yarden (on its western side), because the passuk instructs them to perform the Blessings and Curses \"בעברכם את הירדן\" – when you cross the Yarden, implying shortly thereafter. Accordingly, he explains “the sun’s coming” to mean מקום שהחמה שוקעת – the place of the sun’s setting, so “far from” its setting would mean to the east, closer to the Yarden. He further challenged Rebbe Yehudah by asking that the area he described is mountainous, not “plains.”"
      },
      {
        "id": 2,
        "title": "How Klal Yisroel crossed the Yarden re: how the Aron was carried",
        "paragraph": "A Baraisa describes how Klal Yisroel crossed the Yarden: בכל יום ארון נוסע אחר שני דגלים – Every day, the Aron traveled behind two groups, והיום נסע תחילה – but today, it traveled first, as the passuk describes the Aron as \"עובר לפניכם\" – passing before you. בכל יום ויום לוים נושאין את הארון – Every day, Leviim carried the Aron, והיום נשאוהו כהנים – but today, Kohanim carried it, as is seen from the passuk’s description of the Aron’s entering the Yarden. Rebbe Yose says: בשלשה מקומות נשאו כהנים את הארון – In three places the Kohanim carried the Aron:  כשעברו את הירדן- When they crossed the Yarden, as above, וכשהסיבו את יריחו – when they surrounded Yericho during their conquest of Eretz Yisroel, וכשהחזירוהו למקומו – and when they returned it to its place in the Beis Hamikdash when it was built by Shlomo."
      }
    ],
    "siman": {
      "title": "Siman - Peg-Leg Pirate",
      "paragraph": "The peg-leg pirate on the red pirate ship mistakenly praying in Aramaic for help because his ship got lost at sea trying to follow the confusing directions to two distant mountains, thought he was seeing a mirage in the distance of a golden box being carried on dry land across a river."
    }
  },
  {
    "daf": 34,
    "data": [
      {
        "id": 0,
        "title": "The height of the waters when the Yarden split",
        "paragraph": "The Gemara relates that as soon as the Kohanim’s feet were inside the Yarden, חזרו מים לאחוריהם – the waters reversed course. The passuk describes the water as \"קמו נד אחד\" – they rose up in one column, and Tannaim dispute the dimensions of this column of water. Rebbe Yehudah says it was twelve mil by twelve mil, כנגד מחנה ישראל – equal to the size of the camp of Yisroel. He holds they entered the river in their usual encampment formation, and that was the height of the rising water column. Rebbe Elazar bar Rebbe Shimon argued that surely water travels much faster than people, and if it returned to its course after rising twelve mil, it would have crashed upon them and swept them away. Rather,שהיו מים נגדשין ועולין כיפין על גבי כיפין יתר משלש מאות מיל – the waters piled up higher, crests above crests, עד שראו אותן כל מלכי מזרח ומערב – until all the kings of the East and West saw them. The passuk describes their reaction: וימס לבבם ולא היה בהם עוד רוח מפני בני ישראל – Their hearts melted, and they no longer had any spirit in them because of Bnei Yisroel."
      },
      {
        "id": 1,
        "title": "The stones raised from the Yarden, and the enormous size of the fruit brought by the מרגלים",
        "paragraph": "While they were in the Yarden, Yehoshua instructed them: הרימו לכם איש אבן אחת על שכמו – Every man raise a stone upon his shoulder, למספר שבטי ישראל – according to the number of the tribes of Yisroel. Rashi says they were placed at the feet of the Kohanim in the Yarden. The Gemara explains their purpose: סימן לבנים שעברו אבות את הירדן – to be a sign for the descendants that the ancestors crossed the Yarden. He instructed them to remove an additional set of stones, the ones described by our Mishnah, which had the Torah inscribed upon them, to be later brought to where they lodged that night. These stones were later measured to be about forty se’ah, and we know by tradition that a person is capable of loading onto himself one-third of what he can bear when someone else loads him. From here, one can calculate the size of the cluster of grapes carried by the spies, which were carried by eight of them (40 x 3 x 8 = 960 se’ah). One spy carried a peach, and one carried a fig. Yehoshua and Calev did not carry anything, either because it was beneath their dignity, or because they did not participate in the spies’ plot."
      },
      {
        "id": 2,
        "title": "Calev’s tefillah in Chevron to escape the spies’ plot, and Yehoshua’s extended name",
        "paragraph": "The passuk says: ויעלו בנגב ויבא עד חברון – and they ascended to the south, and “he” arrived in Chevron. Rava explained the switch to the singular form: מלמד שפירש כלב מעצת מרגלים – It teaches that Calev separated from the plot of the spies, והלך ונשתטח על קברי אבות – and went and prostrated himself on the graves of the Patriarchs. אמר להן אבותי בקשו עלי רחמים שאנצל מעצת מרגלים – He said to them, “My fathers, ask for mercy for me that I should be saved from the spies’ plot!” Only Calev, then, went to Chevron. The Gemara explains why Yehoshua did not do the same: יהושע כבר בקש משה עליו רחמים – Regarding Yehoshua, Moshe already asked for mercy for him, as it says: ויקרא משה להושע בן נון יהושע – and he called Hoshea bin Nun, Yehoshua, meaning to say: י-ה יושיעך מעצת מרגלים – Hashem should save you from the plot of the spies. The Gemara continues to say that Calev was granted Chevron as an inheritance in reward and describes the quality of the land of Chevron, which despite being a comparatively stony area of Eretz Yisroel (as evidenced by its use for burial), was still seven times more fertile than the choicest land of Mitzrayim, which was better than all other lands."
      }
    ],
    "siman": {
      "title": "Siman - Ladder",
      "paragraph": "The foreign kings sitting on top of extremely tall red ladders who felt their hearts melt when they saw the waters of a river off in the distance pile high to the sky for a people carrying huge stones and massive grape clusters didn’t notice the spy sneak by who began to daven."
    }
  },
  {
    "daf": 35,
    "data": [
      {
        "id": 0,
        "title": "Why the spies said, “ארץ אוכלת יושביה היא” and what Hashem had intended",
        "paragraph": "Among the reports of the spies, they said: ארץ אוכלת יושביה היא – It is a land which consumes its inhabitants. Rava darshened that Hashem said: אני חשבתיה לטובה והם חשבו לרעה – I intended it for good, and they interpreted it for bad. Hashem arranged that wherever the spies went, an important Canaani died (some say that Iyov died), and the people were preoccupied with the burial and did not inquire after the spies. The spies interpreted it as an indication that “it is a land which consumes its inhabitants.” They also said: ונהי בעינינו כחגבים וכן היינו וגו' – “And we were like grasshoppers in our eyes, and so we were in [the giants’] eyes.” Rav Mesharshiya said this demonstrates the spies were liars, for although they may have seen themselves as grasshoppers, how could they know that the giants viewed them as grasshoppers? The Gemara rejects this proof, and explains that when they saw the giants coming, they climbed up cedar trees, and overheard the giants saying: קחזינן אינשי דדמו לקמצי באילני – We see men like grasshoppers in the trees. The people accepted the spies report for the passuk states: “ותשא כל העדה ויתנו את קולם ויבכו” – And all the congregation raised and gave their voices, and the people wept on that night. Rabbah said in the name of Rebbe Yochanan: The day on which the spies returned was erev Tisha b’Av. Hakadosh Boruch Hu said: הן בכו בכיה של חנם ואני אקבע להם בכיה לדורות – They wept a weeping without cause, and I will establish for them a weeping for generations."
      },
      {
        "id": 1,
        "title": "נשא ארון את נושאיו and Uzza’s mistake",
        "paragraph": "The Gemara relates that when Klal Yisroel finished crossing the Yarden, the Kohanim bearing the Aron, who had been standing in the eastern side of the river, stepped back onto that east bank, across from Klal Yisroel. נשא ארון את נושאיו ועבר – The Aron then carried its bearers and crossed. Uzza was punished regarding this concept, when he reached out to take hold of the Aron when it shook during its transport to Yerushalayim. Hashem said: עוזא נושאיו נשא עצמו לא כל שכן – Uzza, it [the Aron] carried its bearers, how much more so itself! Hashem struck him and he died there. Still, the Gemara tells that he came to Olam Haba, because he is described as dying \"עם ארון האלקים\" – with the Aron of Hashem, indicating endurance. The Gemara adds that Dovid erred in transporting the Aron on a drawn wagon (instead of being carried by men), and this was a punishment for calling the Torah “songs,” as it says: זמירות היו לי חוקיך – Your laws were [as] songs to me. Hashem said to him: דברי תורה שכתוב בהן \"התעיף עיניך בו ואיננו\" – Words of Torah, about which it is written “Close your eyes to it and it is gone, אתה קורא אותן זמירות – you call them songs?!” I will cause you to stumble in something even schoolchildren know! Rashi explains that if one allows his Torah learning to lapse, what one has learned will be lost at once."
      },
      {
        "id": 2,
        "title": "Machlokes how the Torah was inscribed on the stones",
        "paragraph": "The Gemara tells that there were three sets of stones in total; in addition to the two sets of Yehoshua described earlier, Moshe erected stones and inscribed the Torah thereon. Tannaim dispute the sequence of inscribing the Torah onto the stone at Har Eival. Rebbe Yehudah says: על גבי אבנים כתבוה – They inscribed it directly on the stones, as it says, \"וכתבת על האבנים את כל דברי התורה הזאת\" – And you shall inscribe on the stones all the words of this Torah. The Maharsha explains that the passuk implies the writing be done directly on the stones. ואחר כך סדו אותן בסיד – and afterwards they coated them with plaster on top of the writing. Rebbe Shimon asked: לדבריך היאך למדו אומות של אותו הזמן תורה – According to your words, how did the nations of that time learn Torah? It was written in seventy languages so the nations could understand it, but it was covered with plaster!? Rebbe Yehudah responded that Hashem granted them extra insight, and they sent scribes who peeled off the plaster and brought back copies of the writing. He added: ועל דבר זה נתחתם גזר דינם לבאר שחת – And about this matter their decree was sealed to condemn them to the pit of destruction (Gehinnom), שהיה להן ללמד ולא למדו – because they should have learned the Torah that was accessible to them, yet they did not learn. Rebbe Shimon himself held: על גבי סיד כתבוה – They inscribed it on top of the plaster, not under it."
      }
    ],
    "siman": {
      "title": "Siman - Childrens Choir Singing La-La",
      "paragraph": "The children’s choir dressed in cute little red grasshopper costumes and singing a dirge for kids pretending to die, almost got knocked over by the choirmaster flying by holding onto a golden box, above a large stone inscribed with seventy languages."
    }
  },
  {
    "daf": 36,
    "data": [
      {
        "id": 0,
        "title": "The נסים on the day Yisroel  entered Eretz Yisroel, and the lost potential of the ביאה שניה",
        "paragraph": "It was taught in a Baraisa: בא וראה כמה נסים נעשו באותו היום – Come and see how many miracles were done on that day they entered Eretz Yisroel. עברו ישראל את הירדן – They crossed the Yarden miraculously (as described on Daf 34), ובאו להר גריזים ולהר עיבל יתר מששים מיל – and they came to Har Gerizim and Har Eival that same day, a distance of more than sixty mil, ואין כל בריה יכולה לעמוד בפניהם – and no creature could stand against them, וכל העומד בפניהם מיד נתרז – and anyone who stood against them immediately lost control of his bodily functions from terror, as it says: \"את אימתי אשלח לפניך והמותי את כל העם אשר תבא בהם\" – I shall send My fear before you, and I shall confuse the entire people among whom you will come. A passuk is darshened to refer to both the first entering Eretz Yisroel under Yehoshua, and the second entering under Ezra. This comparison teaches: ראויין היו ישראל לעשות להם נס בביאה שניה כביאה ראשונה – Yisroel was fit to perform a miracle for them in the second entering like in the first entering, when they came with miracles and of their own accord, אלא שגרם החטא – but sin during the first Beis Hamikdash caused the loss of this benefit, and they required permission to return."
      },
      {
        "id": 1,
        "title": "Yosef’s refusal of Potiphar’s wife",
        "paragraph": "Rebbe Shimon Chasida said that Yosef, who sanctified Hashem’s name in private (when he resisted Potiphar’s wife), merited to have a letter of Hashem’s name added to his, in the passuk עדות \"ביהוסף\" שמו – He appointed it as a testimony for Yehoseph. The sanctification is described: ויבא הביתה לעשות מלאכתו – And he entered the house to his “work.” Rav and Shmuel dispute the meaning of this word. One says: לעשות מלאכתו ממש – He came to literally do his ordinary work. The other says: לעשות צרכיו נכנס – he entered to perform his needs, i.e., it is a euphemism for relations. The passuk says no one was home that day, and Rebbe Yishmael’s academy explains that it was a pagan holiday, and everyone went to their temple. Potiphar’s wife feigned illness, saying: אין לי יום שניזקק לי יוסף כיום הזה – I have no better day than today for Yosef to be intimate with me! The Gemara relates that when she grabbed hold of his garment, his father’s visage appeared to him in the window and said: יוסף עתידין אחיך שיכתבו על אבני אפוד ואתה ביניהם – Yosef! Your brothers are destined to be inscribed on the stones of the ephod, and you among them. רצונך שימחה שמך מביניהם ותקרא רועה זונות – Do you want your name to be erased from among them and to be called “a companion of harlots”?!"
      },
      {
        "id": 2,
        "title": "Yosef learns the seventy languages",
        "paragraph": "Rebbe Yochanan says that when Yosef rose to power, Pharaoh’s astrologers protested that a servant bought for twenty coins should rule over them. Pharaoh responded that he detected royal character traits in Yosef, and they persisted that he must know the seventy languages. Gavriel came that night to teach them to him, but Yosef was unsuccessful. הוסיף לו אות אחת משמו של הקדוש ברוך הוא ולמד – [Gavriel] added one letter (the “hei”) from Hashem’s name to Yosef’s (as above), and he mastered them. The next day, Yosef responded in every language Pharaoh spoke to him. When Yosef spoke to Pharaoh in לשון הקדש, Pharaoh did not know it, and although he instructed Yosef to teach it to him, he could not learn it. He made Yosef swear not to reveal this information. Later, when Yosef requested leave to bury Yaakov in Eretz Yisroel, he explained that he swore to his father he would do so. Pharaoh told him to void his oath, and Yosef responded that he would then void his oath concerning Pharaoh, which forced Pharaoh to allow him to go."
      }
    ],
    "siman": {
      "title": "Siman - Lulav",
      "paragraph": "The nation flying miraculously on lulavim from a river on the way to mountains over sixty mil away, caught the attention of a worker in a house alone with his master’s wife, who was rushing out to take his course on how to learn seventy languages."
    }
  },
  {
    "daf": 37,
    "data": [
      {
        "id": 0,
        "title": "Rebbe Meir: Shevet Binyomin jumped first into the Yam Suf",
        "paragraph": "Rebbe Meir says that when Klal Yisroel stood by the Yam Suf, the shevatim were arguing who would go in first. קפץ שבטו של בנימין וירד לים תחילה – Then the shevet of Binyomin jumped forward and descended first into the sea, as it says: \"שם בנימין צעיר רודם\" – there, Binyomin the youngest rules them,” which the Gemara darshens as \"רד ים\" – he descended into the sea. והיו שרי יהודה רוגמים אותם – The officers of Yehudah began stoning them, as that passuk concludes: \"שרי יהודה רגמתם\" – the officers of Yehudah stoned them. לפיכך זכה בנימין הצדיק ונעשה אושפיזכן לגבורה – Therefore, Binyomin Hatzaddik merited to be host for the Shechinah (because the Aron was in the Kodesh Hakodoshim, in his territory), as it says in Moshe’s berachah to Binyomin: \"ובין כתפיו שכן\" – and between [Binyomin’s] shoulders [Hashem] rests."
      },
      {
        "id": 1,
        "title": "Rebbe Yehudah: Nachshon ben Aminadav jumped in first",
        "paragraph": "Rebbe Yehudah disputes Rebbe Meir’s account: לא כך היה מעשה – The incident was not that way.אלא זה אומר אין אני יורד תחילה לים וזה אומר אין אני יורד תחילה לים – Rather, this [shevet] was saying, “I will notdescend first, and this one was saying, “I will not descend first,” קפץ נחשון בן עמינדב וירד לים תחילה – Nachshon ben Aminadav jumped forward and descended first. The Gemara quotes pessukim describing Nachshon’s desperate tefillah. Moshe, too, was davening at length, until Hashem said: ידידיי טובעים בים ואתה מאריך בתפלה לפני – “My dear ones are drowning in the sea, and you are davening at length before Me?” Moshe said: רבונו של עולם ומה בידי לעשות – Master of the World, but what is in my power to do? Hashem told him to travel forth and lift his staff and split the sea. He concludes: לפיכך זכה יהודה לעשות ממשלה בישראל - Therefore, Yehudah merited to establish sovereignty in Yisroel, as it says: \"היתה יהודה לקדשו ישראל ממשלותיו\" – Yehudah became [Hashem’s] sanctified one to rule over Yisroel his dominions, the reason for which is given in the following passuk: משום ד\"הים ראה וינוס\" – because the sea saw and fled when Nachshon jumped in."
      },
      {
        "id": 2,
        "title": "Machlokes about the number of covenants for each mitzvah, and arvus",
        "paragraph": "A Baraisa teaches that at Har Gerizim and Har Eival, there was a general blessing (ברוך אשר יקים את דברי התורה הזאת – Blessed is he who will uphold the words of this Torah) and a general curse (ארור אשר לא יקים וגו'), as well as a specific blessing and corresponding curse for each of the mitzvos. Additionally, each mitzvah includes four commandments: ללמוד וללמד לשמור ולעשות – to learn, to teach, to guard, and to perform, for a total of sixteen. These sixteen covenants were made at two other times: in Sinai, and in the plains of Moav. נמצא מ\"ח בריתות על כל מצוה ומצוה – It emerges that there are a total of forty-eight covenants for each and every mitzvah (16x3=48). Rebbe Shimon does not consider the covenants of Har Gerizim and Har Eival (he maintains that Yehoshua only said the mitzvos listed there), and inserts instead the אהל מועד, and holds that all mitzvos were repeated there. The Gemara explains their machlokes. Another Tanna quotes Rebbe Shimon as adding that every mitzvah had forty-eight covenants multiplied by 603,550, the number of adult males present, because every Jew accepted responsibility (\"ערבות\") for every other Jew’s observing the commandments. Rebbi goes further and says that each of these must be in turn multiplied by an additional 603,550, and the Gemara explains that Rebbi holds that each Jew was an ערבא דערבא – a guarantor for a guarantor, meaning he even accepted responsibility for every other Jew’s responsibility for each other’s mitzvos."
      }
    ],
    "siman": {
      "title": "Siman - Laser Tag",
      "paragraph": "The fierce laser tag competition by the sea saw some teams shoot lasers at one team about to jump in the water first, when the captain of another team suddenly leaped in before them, to win the coveted 48 Covenant Prize."
    }
  },
  {
    "daf": 38,
    "data": [
      {
        "id": 0,
        "title": "Birchas Kohanim in the Mikdash and elsewhere",
        "paragraph": "The next Mishnah teaches how Birkas Kohanim is performed: במדינה אומר אותה שלש ברכות ובמקדש ברכה אחת – In the provinces (i.e., outside the Mikdash), he says it as three separate berachos, and in the Mikdash, as one berachah. במקדש אומר את השם ככתבו ובמדינה בכינויו – In the Mikdash, he says [Hashem’s] Name the way it is written (Yud-Kay-Vav-Kay) and in the provinces, with its substitute (Aleph-Dalet-Nun-Yud). במדינה כהנים נושאים את ידיהן כנגד כתפיהן ובמקדש על גבי ראשיהן – In the provinces, the Kohanim raise their hands parallel to their shoulders, and in the Mikdash, above their heads. (Rashi explains because they are pronouncing Hashem’s Name, and the Shechinah rests above their fingers). The Mishnah then records a machlokes if the Kohen Gadol does the same or cannot raise his hands above the ציץ. The Gemara brings the sources for many halachos of Birkas Kohanim, among them our Mishnah’s distinction of when to use the שם המפורש: \"ושמו את שמי\" – Let them place My Name [upon Bnei Yisroel] implies שמי המיוחד לי – My Name which is unique to Me. A gezeirah shavah teaches that this only applies in the Mikdash. Rebbe Yoshiyah gives a different source, from a passuk he reinterprets to say: בכל מקום אשר אבוא אליך וברכתיך שם אזכיר את שמי – Everywhere that I will come to you and bless you, meaning the Mikdash, there I will permit mention of My Name."
      },
      {
        "id": 1,
        "title": "The trait of miserliness",
        "paragraph": "Rebbe Yehoshua ben Levi said: אין נותנין כוס של ברכה לברך אלא לטוב עין – We do not give the Cup of Blessing for bentching except to a generous person. He also said: מנין שאפילו עופות מכירין בצרי העין – From where do we know that even birds recognize misers? Because a passuk about misers says: כי חנם מזורה הרשת בעיני כל בעל כנף – Because for nothing he scatters food in the net, to the eye of every winged creature (because they will not eat the miser’s food). He also said: כל הנהנה מצרי העין עובר בלאו – Anyone who benefits from a miser transgresses a prohibition, as it says: אל תלחם את לחם רע עין וגו' – Do not eat the bread of a miser etc., כי כמו שער בנפשו כן הוא אכול ושתה יאמר לך וגו' – because he is like one whose soul is embittered. “Eat and drink” he will tell you, but his heart is not with you. Rav Nachman bar Yitzchak added another lav. Finally, Rebbe Yehoshua ben Levi faults misers for the death of the traveler that requires an עגלה ערופה, based on the elders of the city declaring they are not responsible for his death because they did not send him away without food."
      },
      {
        "id": 2,
        "title": "An all-Kohanim congregation, and who is not included in the berachah",
        "paragraph": "Rebbe Simlai said: בית הכנסת שכולה כהנים כולן עולין לדוכן – A synagogue that is entirely made up of Kohanim, they all ascend the platform for Birkas Kohanim. Since there is no one else present, Rebbe Zeira explains whom they are blessing: לאחיהם שבשדות – to their brothers working in the fields. This is challenged from a Baraisa, which states: עם שאחורי כהנים אינן בכלל ברכה – the people standing behind the Kohanim are not included in the berachah, because they must face the Kohanim to receive the berachah. The Gemara answers: הא דאניסי הא דלא אניסי – This law that those in the field are included is for those who are forced by their work not to attend, and this Baraisa that those standing behind the Kohanim are not included, is for those who are not forced to do so, but do not value the berachah enough to change position."
      }
    ],
    "siman": {
      "title": "Siman - Chicken Soup (דבר לח)",
      "paragraph": "The man who was shaken by hearing the Birchas Kohanim in the Mikdash with the שםהמפורש, did not accept the red bowl of chicken soup from the miser who told him \"eat and drink\" while voluntarily standing behind the all-Kohanim congregation as they said Birchas Kohanim."
    }
  },
  {
    "daf": 39,
    "data": [
      {
        "id": 0,
        "title": "One may not speak once the sefer Torah has been opened",
        "paragraph": "Rava bar Rav Huna said: כיון שנפתח ספר תורה אסור לספר אפילו בדבר הלכה – Once the sefer Torah has been opened, it is forbidden to speak, even about a halachic matter, as it says: \"ובפתחו עמדו כל העם\" – and when [Ezra] began to read from the Torah, all the people stood, and the word עמידה can be shown elsewhere to mean to be silent. Rebbe Zeira brought a different source in the name of Rav Chisda: \"ואזני כל העם אל ספר התורה\" – And the ears of all the people were listening to the sefer Torah."
      },
      {
        "id": 1,
        "title": "The berachah and tefillos of the Kohanim during Birkas Kohanim",
        "paragraph": "Rebbe Elazar ben Shamua’s talmidim asked him how he merited long life, and among his answers was: ולא נשאתי כפי בלא ברכה – I never raised my hands for Birkas Kohanim without first reciting the berachah. The berachah is: אשר קדשנו בקדושתו של אהרן – “…Who has sanctified us with the kedushah of Aharon, וצונו לברך את עמו ישראל באהבה – and commanded us to bless his nation Yisroel with love.” When the Kohen leaves his place to approach the platform, he says: יהי רצון מלפניך ה' אלקינו שתהא ברכה זו שצויתנו לברך את עמך ישראל לא יהא בה מכשול ועון – “May it be the will before You, Hashem our G-d, that this blessing that You commanded us to bless your nation Yisroel should not have in it a stumbling block or sin.” When he turns away from the congregation at the conclusion of Birkas Kohanim, he says: רבונו של עולם עשינו מה שגזרת עלינו – “Master of the world! We have done what You have decreed upon us.עשה עמנו מה שהבטחתנו – Do for us that which You have promised us (that You will bless Klal Yisroel when we do), השקיפה ממעון קדשך מן השמים וגו' – ‘Look down from Your sacred dwelling, from the Heavens, and bless Your people, Yisroel, etc.’”"
      },
      {
        "id": 2,
        "title": "The sequence of events of Birkas Kohanim",
        "paragraph": "The Gemara presents a series of seven halachos of Birkas Kohanim in which the next step cannot proceed before the previous one is completed. Rav Chisda begins: אין הכהנים רשאים לכוף קישרי אצבעותיהן עד שיחזרו פניהם מן הצבור – The Kohanim may not bend their finger joints after finishing the berachah until they turn their faces away from the congregation. Rebbe Zeira quoted six more halachos from Rav Chisda:1.The chazzan cannot call out “Kohanim” until the congregation finishes responding “Amen” to the berachah of מודים.2.The Kohanim cannot begin the berachah on the mitzvah (taught above) until the chazzan finishes calling out “Kohanim.”3.The congregation may not answer “Amen” until the Kohanim complete the berachah.4.The Kohanim cannot begin Birkas Kohanim until the congregation finishes saying “Amen” to the berachah.5.The Kohanim cannot turn away from the congregation after completing Birkas Kohanim until the chazzan begins שים שלום.6.The Kohanim cannot leave the platform until the chazzan finishes שים שלום."
      }
    ],
    "siman": {
      "title": "Siman - Letter (Mailman)",
      "paragraph": "The mailman holding the red letter waited in silence as the Torah was read and then ran over to the very old sage who always said the berachah before reciting Birkas Kohanim and handed him the note about the Birkas Kohanim sequence."
    }
  },
  {
    "daf": 40,
    "data": [
      {
        "id": 0,
        "title": "The humility of Rebbe Abba of Acco and Rebbe Abahu",
        "paragraph": "Rebbe Abahu commented: מריש הוה אמינא עינותנא אנא – Originally, I would have said I am a humble person, until witnessing the humility of Rebbe Abba of Acco: Rebbe Abba was delivering a shiur and gave one explanation to his “speaker” (whose role was to repeat the shiur loudly to the audience), who insolently said aloud a different explanation to the audience, and Rebbe Abba did not take offense. Thereafter, Rebbe Abahu did not consider himself a humble person by comparison. The Gemara illustrates the humility of Rebbe Abahu: The wife of Rebbe Abahu’s speaker once told Rebbe Abahu’s wife that her husband does not need Rebbe Abahu to give him the shiur, and the reason he bends over Rebbe Abahu to hear the shiur to relay is only to give him respect. When Rebbe Abahu’s wife told this to her husband, he responded: ומאי נפקא ליך מינה– “What difference does it make to you? מיני ומיניה יתקלס עילאה – Through me and him, the One Above shall be praised!” The Gemara relates another incident demonstrating Rebbe Abahu’s humility."
      },
      {
        "id": 1,
        "title": "לעולם תהא אימת צבור עליך",
        "paragraph": "Rebbe Yitzchak said: לעולם תהא אימת צבור עליך – The awe of a congregation should always be upon you, שהרי כהנים פניהם כלפי העם ואחוריהם כלפי שכינה – for we find that the Kohanim’s faces are toward the people during Birkas Kohanim, and their backs are toward the Shechinah. Rav Nachman gave another source: ויקם המלך דוד על רגליו ויאמר שמעוני אחי ועמי – Dovid Hamelech stood up on his feet and said, “Hear me, my brothers and my people.” Rebbe Elazar explained Dovid’s intent with the apparently contradictory terms of “brothers” (implying equals) and “people” (implying subjects):אם אתם שומעין לי אחי אתם – If you heed me in fully serving Hashem, you are my brothers, ואם לאו עמי אתם ואני רודה אתכם במקל -  but if not, you are my people, and I will subjugate you with the rod. The Gemara suggests another source, from the law that Kohanim may not wear their sandals when performing Birkas Kohanim, which it assumed was because of the dignity of the congregation (who would see the often-dirty sandals when the Kohanim raised their hands, causing their garments to be lifted). Rav Ashi responds that the reason for this enactment is in case a strap of his sandal is torn, he may descend to tie it (to avoid people seeing it) and miss Birkas Kohanim, leading people to suspect he is a chalal and ineligible to perform Birkas Kohanim."
      },
      {
        "id": 2,
        "title": "The kriah and berachos of the Kohen Gadol on Yom Kippur",
        "paragraph": "The Mishnah describes the kriah of the Kohen Gadol on Yom Kippur in the Beis Hamikdash. The chazzan (i.e., shamash) of the synagogue near the Beis Hamikdash took the sefer Torah and handed it to the head (i.e., gabbai) of the synagogue, who handed it to the deputy Kohen Gadol, who in turn handed it to the Kohen Gadol. The Kohen Gadol then read the portion in the Torah detailing the Avodah of Yom Kippur, as well as the nearby portion discussing the prohibition against מלאכה or eating on Yom Kippur. Then, because the final portion is too far away to roll the Torah to, and he read it by heart, he rolled up the Torah and held it against his chest and declared: יתר ממה שקריתי לפניכם כתוב כאן – “More than what I have read before you is written here” (lest one think this final portion is missing from the sefer Torah). He then recited eight berachos. The Gemara infers from the order of the passing of the Torah that חולקין כבוד לתלמיד במקום הרב – we provide honor to a disciple in the presence of the teacher, for otherwise the chazzan should hand the Torah directly to the Kohen Gadol. Abaye answers: כולה משום כבודו דכ\"ג הוא – It is all for the honor of the Kohen Gadol, by showing how many ranks are beneath him."
      }
    ],
    "siman": {
      "title": "Siman - Pool (Swim Instructor)",
      "paragraph": "The humble swim instructor who didn’t mind when his assistant gave different instructions to the class on how to swim across the red water and turned his back on him to face the students, had the children pass from one to another the “How to Be a Good Swim Buddy” sign which he then read aloud for all to hear."
    }
  },
  {
    "daf": 41,
    "data": [
      {
        "id": 0,
        "title": "The king’s kriah at Hakheil, and the incident of flattering King Agrippas",
        "paragraph": "The next Mishnah describes the mitzvah of Hakheil. The day after the first day of Succos following Shemittah, they built a wooden platform in the Azarah on which the king would sit. The sefer Torah was passed to the king, who would stand to receive it, but read it sitting. King Agrippas read while standing, and the Sages praised his conduct. The Gemara will explain that although the king cannot forego his honor, he can for the honor of a mitzvah. When Agrippas reached the passuk, \"לא תוכל לתת עליך איש נכרי\" – You shall not place a foreigner over you to be king, זלגו עיניו דמעות – his eyes flowed with tears (because as a descendant of the slave, Herod, he was disqualified from being king). They said to him: אל תתירא אגריפס אחינו אתה אחינו אתה – “Do not fear, Agrippas! You are our brother! You are our brother!” The Gemara says that they deserved destruction for this flattery of Agrippas. The Mishnah concludes by detailing the passages which the king reads, and the berachos he recites thereafter."
      },
      {
        "id": 1,
        "title": "Flattering the wicked in this world",
        "paragraph": "Rebbe Yehudah of the West darshened: מותר להחניף לרשעים בעולם הזה – It is permitted to flatter the wicked in this world, because it says regarding the times of Moshiach: לא יקרא עוד לנבל נדיב ולכילי לא יאמר שוע – A vulgar person will no longer be called generous, and about a lustful person it will not be said that he is noble. This implies that nowadays this is permitted. Reish Lakish gave a source from Yaakov’s statement to Eisav: כראות פני אלהים ותרצני – “[I have seen your face,] which is like seeing the face of an angel, and you were appeased by me.” We see, then, that Yaakov flattered Eisav.This interpretation disagrees with Rebbe Levi’s, who said a parable illustrating Yaakov’s intent: לאדם שזימן את חבירו והכיר בו שמבקש להורגו – It is comparable to someone who invited his fellow, and [the guest] discerned that [the host] sought to kill him. אמר לו טעם תבשיל זה שאני טועם כתבשיל שטעמתי בבית המלך – So he said to [the host], “The taste of this dish that I am tasting is like the dish which I tasted  in the king’s palace.” אמר ידע ליה מלכא – [The host] said to himself, “The king knows him!” מיסתפי ולא קטיל ליה – He became afraid and did not kill him. Yaakov, too, was not attempting to flatter Eisav, but to hint to him that he was accustomed to seeing angels."
      },
      {
        "id": 2,
        "title": "The evils of flattery",
        "paragraph": "Rebbe Elazar made several statements about a person who possesses the trait of flattery: כל אדם שיש בו חנופה מביא אף לעולם – Anyone who has in him the trait of flattery brings anger to the world, as it says: \"וחנפי לב ישימו אף\" – And those with flattering hearts bring on anger. ולא עוד אלא שאין תפלתו נשמעת – And not only this, but his prayer is not heeded, as it says there: \"לא ישועו כי אסרם\" – they will not cry out to Hashem when He afflicts them. He also said about those possessing the trait of flattery: אפילו עוברין שבמעי אמן מקללין אותו – Even fetuses in their mothers’ wombs curse him, and: נופל בגיהנם – He falls into Gehinnom. He added: כל המחניף לחבירו סוף נופל בידו – One who flatters his fellow ultimately falls into his hand. He concluded that even if he does not fall into his hand, he will fall into his son’s hand, or at least the hand of his son’s son, as we find that Yirmiyah, who flattered the false prophet Chananyah, fell into the hands of Chananyah’s grandson."
      }
    ],
    "siman": {
      "title": "Siman - Grandma",
      "paragraph": "The proud Grandma with the red walker kvelling over her grandson, the King, when he did krias haTorah, even though he was a descendant of a foreigner, told the rasha standing next to her, who flattered her saying that seeing her face is like seeing the face of an angel, that he’s going to fall into her grandson’s hands, and ultimately go to Gehinnom."
    }
  },
  {
    "daf": 42,
    "data": [
      {
        "id": 0,
        "title": "The משוח מלחמה addressing the people going to war",
        "paragraph": "The eighth Perek begins by describing the words spoken to the nation by the משוח מלחמה before going to battle, which were in לשון הקודש. He told them they were heading to war \"על אויביכם\" – against your enemies, meaning ולא על אחיכם – and not against your brothers. לא יהודה על שמעון ולא שמעון על בנימין – This is not Yehudah against Shimon, nor Shimon against Binyomin, שאם תפלו בידם ירחמו עליכם – that if you fall into their hands they will have mercy on you, as we find in the aftermath of Pekach ben Remalyahu’s victory over Achaz, that the captives were clothed, fed, cared for, and returned home. על אויביכם אתם הולכים – Rather, you are going to war against your enemies, שאם תפלו בידם אין מרחמין עליכם – that if you fall into their hands, they will not have mercy on you. The משוח מלחמה makes four exhortations not to be afraid, and the Mishnah explains he referred to four practices their enemies would do to frighten them. He concludes with the passuk declaring that Hashem goes with them, saying: הם באין בנצחונו של בשר ודם ואתם באים בנצחונו של מקום – They come with the strength of flesh and blood, but you come with the strength of Hashem. He gives as examples the victories against the warriors Golias and Shovach."
      },
      {
        "id": 1,
        "title": "Golias’s challenge and mistaken language",
        "paragraph": "Rebbe Yochanan darshens the name \"גלית\" as saying שעמד בגילוי פנים לפני הקדוש ברוך הוא – that he stood brazenly before Hashem when he said\"ברו לכם איש וירד אלי\"  – Choose for yourselves a “man” and let him come down to me, by which he meant Hashem, who is called an \"איש מלחמה\". Hashem responded: הריני מפילו על יד בן איש – I hereby will fell him through a “son of man,” i.e., a young man (which is how Dovid is described). Rebbe Yochanan quoted Rebbe Meir: בשלשה מקומות לכדו פיו לאותו רשע – In three places, the mouth of that wicked one (Golias) ensnared him. Aside from sayingברו לכם  איש (as described above), he also said \"וירד עלי\" – and he will come down to me, implying Dovid would come upon him and vanquish him. And he said \"אם יוכל להלחם אתי והכני\" – If he will succeed in battle against me and smite me, implying Dovid would smite him."
      },
      {
        "id": 2,
        "title": "The descendants of Orpah falling to Dovid, and the praising of Golias",
        "paragraph": "The Gemara explains why the four warriors (Saf, Madon, Golias and Yishbi) fell before Dovid. The passuk says: ותשק ערפה לחמותה ורות דבקה בה – And Orpah kissed her mother-in-law, but Rus cleaved to her. Rebbe Yitzchak said: אמר הקדוש ברוך הוא יבואו בני הנשוקה ויפלו ביד בני הדבוקה – Hashem said, “Let the sons of the one who was kissed (Orpah) come and fall in the hand of the sons of the one who cleaved (Rus).” Rava darshened that Orpah merited for these four warriors to descend from her in reward for the four tears she shed when parting from Naomi, as it says \"ותבכינה עוד\" – and they wept again, indicating it was a second weeping (with a tear falling from each eye). The passuk describes Golias’s spear as \"חץ חניתו\" – the shaft of his spear, but it is written as \"עץ\" – the wood. Rebbe Elazar explained: עדיין לא הגיענו לחצי שבחו של אותו רשע – We have not yet reached half (חצי) the praise of that wicked one (Golias). מכאן שאסור לספר בשבחן של רשעים – From here we see it is forbidden to relate the praises of the wicked. As to why any praises are described, that isלאודועי שבחיה דדוד  – to inform of the praise of Dovid who was prepared to fight this great warrior."
      }
    ],
    "siman": {
      "title": "Siman - Mobster",
      "paragraph": "The mobster giving a pep talk to his men who were about to go out and fight with another crime family, was shocked when his brazen giant fighter got felled by a young man, who killed four warriors, all descendants of a woman who cried four tears."
    }
  },
  {
    "daf": 43,
    "data": [
      {
        "id": 0,
        "title": "Pinchas was descended from both Yosef and Yisro",
        "paragraph": "It was taught in a Baraisa: לא לחנם הלך פינחס למלחמה – Not for naught did Pinchas go to battle against Midian, אלא ליפרע דין אבי אמו – rather, to take revenge for his mother’s father, Yosef, who was sold as a slave by Midianites. The Gemara questions Pinchas’s descent from Yosef from a passuk identifying his mother as \"מבנות פוטיאל\" – from the daughters of Putiel. מאי לאו דאתי מיתרו – Is this not because they descended from Yisro, who was called Putiel, שפיטם עגלים לעבודת כוכבים – because he fattened calves for idolatry (פיטם אל)? The Gemara answers: לא מיוסף שפיטפט ביצרו – No, they descended from Yosef, called Putiel because he scorned and conquered his desire. The Gemara objects that when Pinchas killed Zimri, the other shevatim disgraced him, saying: ראיתם בן פוטי זה – Have you seen this son of Puti, בן שפיטם אבי אמו עגלים לעבודת כוכבים – a son whose mother’s father fattened calves for idolatry, יהרוג נשיא מישראל – yet he kills a nasi of Yisroel?! Clearly, he descended from Yisro!? The Gemara answers that he descended from both, one from his mother’s father and one from his mother’s mother. This is supported by the yud in \"פוטיאל\", which indicates multiple meanings."
      },
      {
        "id": 1,
        "title": "The three exemptions from going to war",
        "paragraph": "The next Mishnah teaches about the officers declaring the three exemptions from going to battle: One who built a new house and did not inaugurate it, one who planted a vineyard and did not redeem it (in the fourth year), and one who married a woman and did not complete the marriage. The Mishnah details the applications of each exemption and concludes: כל אלו ואלו שומעין דברי כהן מערכי מלחמה וחוזרין – All these hear the words of the Kohen about the war regiments,ומספקין מים ומזון ומתקנין את הדרכים – and provide water and food to the army and repair the roads for the army’s passage. The Mishnah then lists those who do not qualify for the above exemptions and teaches that there are those who do not leave their homes at all, nor provide sustenance to the troops nor repair the roads: בנה בית וחנכו – One who built a house and inaugurated it, נטע כרם וחללו – one who planted a vineyard and redeemed its fruit, הנושא את ארוסתו - one who performed nisuin with his arusah, הכונס את יבמתו – and one who married his yevamah, and in all these cases did not enjoy their benefits for a full year."
      },
      {
        "id": 2,
        "title": "The case of grafting which grants an exemption from going to war",
        "paragraph": "The Mishnah taught that in addition to planting, grafting a plant also exempts from going to war. Rebbe Zeira explains that this refers to permitted grafting. The Gemara wonders what the case is, since if a young tree (i.e., less than three years old) was grafted onto a young tree, he is exempt anyway because of the first tree. If it was grafted onto an old tree, Rebbe Abahu taught:בטלה ילדה בזקינה ואין בה דין ערלה – the young tree is nullified in the old tree and does not have a law of orlah; thus, the graft cannot provide an exemption. Rebbe Yirmiyah explained that he grafted it onto a young tree which was not subject to orlah: וכגון דנטע להך קמייתא לסייג ולקורות – in a case where he planted the first tree as a fence or for beams, which is exempt from orlah. Therefore, only the graft exempts the owner from going to war. This graft does not become “nullified” to the permitted host, because if he would change his mind and designate it for fruit production, it would revert to an orlah state, since its primary function is to produce fruit. Rav Nachman bar Yitzchak answered: במבריך אילן בירק – The Mishnah is where he grafted a tree onto an herb, and the Mishnah follows the opinion that this is permitted. Herbs are not subject to orlah, and only the graft exempts from army service."
      }
    ],
    "siman": {
      "title": "Siman - Magazine",
      "paragraph": "The most recent issue of “Ancient Midianite Battles\" Magazine captivated the attention of the great Ben Puti general, who was sitting on his porch while exempt from war due to his recent engagement, behind a young tree he had grafted onto another tree which was planted as a fence."
    }
  },
  {
    "daf": 44,
    "data": [
      {
        "id": 0,
        "title": "The meaning of הירא ורך הלבב and machlokes about which aveiros exempt one from battle",
        "paragraph": "The next Mishnah records a machlokes about the meaning of \"הירא ורך הלבב\" – one who is frightened and fainthearted, who also returns home from war. Rebbe Akiva explains: כמשמעו שאינו יכול לעמוד בקשרי המלחמה ולראות חרב שלופה – like its simple meaning, that he is unable to stand in the joined ranks in battle and see a drawn sword. Rebbe Yose Haglili says: זהו המתיירא מן העבירות שבידו – this means one who is afraid because of his aveiros. He adds: לפיכך תלתה לו התורה את כל אלו שיחזור בגללן – Therefore, the Torah hangs on this exemption all these other exemptions (of building, planting, and marrying), so that he can appear to return because of them and not be ashamed for leaving because of his aveiros.Rebbe Yose says that forbidden marriages (such as a widow to a Kohen Gadol) cause one to return home. The Gemara explains that he holds any Biblical aveirah causes one to return home, but not an aveirah d’Rabbonon. Rebbe Yose Haglili holds one returns home even for an aveirah d’Rabbonon, such as שח בין תפילה לתפילה – one who speaks between placing tefillin of the arm and tefillin of the head."
      },
      {
        "id": 1,
        "title": "The distinction of מלחמת מצוה, and three types of war",
        "paragraph": "The Mishnah taught: במה דברים אמורים במלחמות הרשות – When are these [exemptions] said? Regarding discretionary wars, אבל במלחמות מצוה הכל יוצאין – but regarding wars of mitzvah, everyone goes out to battle, אפילו חתן מחדרו וכלה מחופתה – even a groom from his chamber and a bride from her chuppah. Rebbe Yehudah limits the exemptions of our Mishnah to \"מלחמות מצוה\" – wars of mitzvah and says they do not apply to \"מלחמות חובה\" – obligatory wars. Rebbe Yochanan explains that Rebbe Yehudah is actually discussing the same two categories as the Rabbonon, and there is no argument where the exemptions apply. Rava explains their machlokes: מלחמות יהושע לכבש דברי הכל חובה – The wars of Yehoshua to conquer Eretz Yisroel, all agree were obligatory. מלחמות בית דוד לרווחה דברי הכל רשות – The wars of the House of Dovid whose purpose was for expansion, all agree were discretionary. Their machlokes concerns wars whose purpose is למעוטי עובדי כוכבים דלא ליתי עלייהו – to diminish nearby idolators, so they will not come upon [Yisroel] to wage war. Although this is not a full-fledged mitzvah, and all agree that the exemptions apply, Rebbe Yehudah calls it a “mitzvah” for another halachah: לעוסק במצוה שפטור מן המצוה – he is considered one occupied with a mitzvah, who is exempt from performing another mitzvah."
      },
      {
        "id": 2,
        "title": "Machlokes how many judges measure to the cities around a corpse for עגלה ערופה",
        "paragraph": "The ninth Perek of Sotah discusses the procedure of עגלה ערופה. The Tanna Kamma says:שלשה מבית דין הגדול שבירושלים היו יוצאין – Three judges from the Great Beis Din of Yerushalayim would go out to measure from the surrounding cities to the corpse. Rebbe Yehudah says: חמשה – Five, because it says \"זקניך\" שנים – “your elders,” implying two judges, \"ושופטיך\" שנים – “your judges,” implying two additional judges, ואין בית דין שקול – and a beis din cannot be an even number of judges, מוסיפין עליהן עוד אחד – so we add one more to them, totaling five. The Gemara explains that the Tanna Kamma, which a Baraisa identifies as Rebbe Shimon, holds that the word \"ושופטיך\" does not teach about the number of judges, because it is teaching the qualification of the judges: למיוחדין שבשופטיך – the select among your judges, meaning members of Sanhedrin. The Gemara ultimately says that Rebbe Yehudah agrees with this but holds the extra vav in \"ושופטיך\" teaches to add two more judges."
      }
    ],
    "siman": {
      "title": "Siman - Mud",
      "paragraph": "The scared soldier who was trudging home in the reddish mud when suddenly he heard that the war was a milchemes mitzvah and he must return to battle, asked five judges measuring the distance from a meis in the mud to the nearest city for some chizuk."
    }
  },
  {
    "daf": 45,
    "data": [
      {
        "id": 0,
        "title": "Rebbe Elazar ben Yaakov: King and Kohen Gadol come, if entire Sanhedrin comes",
        "paragraph": "The Gemara notes that our Mishnah does not accord with Rebbe Elazar ben Yaakov, who says: \"זקניך\" זו סנהדרין – “Your elders,” this refers to Sanhedrin, \"שופטיך\" זה מלך וכהן גדול – “your judges,” this refers to the King and Kohen Gadol. The Gemara inquires if he holds like one of the Tannaim of our Mishnah regarding the number of judges required, or if he requires the entire Sanhedrin to come. Rav Yosef brought a Baraisa which teaches that a זקן ממרא – the rebellious elder, who received Sanhedrin’s ruling outside of the לשכת הגזית and later ignores it, is not punished. Now, the case must be where the entire Sanhedrin was there, because otherwise, he obviously could not be liable, since it is possible the other members would agree with him. But since at least twenty-three members must always be in the לשכת הגזית, how would this occur? It must be that they left for a mitzvah that required the entire Sanhedrin, presumably to measure for an עגלה ערופה!? The Gemara answers that the entire Sanhedrin is required for a different purpose: להוסיף על העיר ועל העזרות – to add to the city of Yerushalayim or to the azaros of the Beis Hamikdash. However, the Gemara brings another Baraisa which clearly states that Sanhedrin leaves for the purpose of measuring for עגלה ערופה."
      },
      {
        "id": 1,
        "title": "Two corpses on top of each other",
        "paragraph": "Abaye once declared: הריני כבן עזאי בשוקי טבריא – Today I am prepared to answer questions with depth and clarity like Ben Azzai did in the markets of Tiveria. He was asked: שני חללים זה על גבי זה – Two corpses which are found one on top of the other, מהיכן הוא מודד – from where does one measure to surrounding cities? מין במינו הוי טמון ומין במינו לא הוי צף – Do we say something covered by its own type (another corpse) is considered “covered”(and exempt from עגלה ערופה), but something raised on its own type is not considered “floating” (and is subject to עגלה ערופה), ומעליון מודד  - thus one would only measure from the top corpse? Or perhaps the top corpse is considered floating, and the bottom is not considered covered, and we would only measure from the bottom. It is also possible that neither is subject to עגלה ערופה (if they are considered covered and floating, respectively), and Rashi adds the possibility that they may both be subject to עגלה ערופה. Abaye offered a resolution from a Baraisa regarding שכחה, where one sheaf of grain lay atop another (which are the same type). The Tanna Kamma says the bottom is שכחה and the top is not, and Rebbe Shimon says neither is שכחה, because the bottom has a “covered” exemption. The Gemara says they do not necessarily argue if the bottom is considered covered but may disagree if there is a “covered” exemption regarding שכחה."
      },
      {
        "id": 2,
        "title": "Machlokes from which part of the corpse to measure",
        "paragraph": "The next Mishnah records a machlokes from where to measure. Rebbe Eliezer says: מטיבורו – From his navel. Rebbe Akiva says: מחוטמו – From his nose. Rebbe Elazar ben Yaakov says: ממקום שנעשה חלל מצוארו – From where he becomes a corpse, i.e., from his neck. The Gemara explains that Rebbe Akiva holds: עיקר חיותא באפיה – his primary life element is in his nose (i.e., breathing). Rebbe Eliezer holds: עיקר חיותא בטיבוריה – his primary life element is in his navel (i.e., the digestive organs). The Gemara suggests this parallels a machlokes if a fetus is formed from the head or from the navel, but says that even Abba Shaul, who says a fetus is formed from the navel, can agree that after formation, breathing is the primary life element. Rebbe Elazar ben Yaakov says to measure from the neck, based on a passuk which says: \"צוארי חללי רשעים\" – the necks of the corpses of the wicked, relating “corpses” with “necks.”"
      }
    ]
  },
  {
    "daf": 46,
    "data": [
      {
        "id": 0,
        "title": "The disqualifications of עגלה ערופה and פרה אדומה",
        "paragraph": "Although a blemish disqualifies a פרה אדומה, it does not disqualify an עגלה ערופה, because the word \"בה\" written by פרה אדומה excludes עגלה ערופה from this disqualification. The Gemara asks that a similar exclusion written by עגלה, where any work is disqualifying, should exclude פרה from any work disqualifying (except for a ‎yoke, which is written by פרה).  Yet Rav said: הניח עליה עודה של שקין פסולה – If he placed a bundle of sacks on the cow it is disqualified!? The Gemara answers that the law of עגלה is derived from פרה with a gezeirah shavah (and the exclusion written by עגלה teaches that work does not disqualify a korban). Rav’s statement concludes: ובעגלה עד שתמשוך – With regard to עגלה, it is valid until it pulls the bundle. The Gemara asks, since the broader work disqualification of פרה is derived from עגלה, why is it disqualified as soon as the bundle is placed on it, when an עגלה is only disqualified after it pulls the bundle? It answers that this reflects the opinion of another Tanna, who includes other work disqualification of a פרה. Rebbe Yochanan defined the amount of “pulling” to disqualify an עגלה to be the full width of a yoke, which is a tefach."
      },
      {
        "id": 1,
        "title": "The importance of providing escort, as seen by עגלה ערופה, and its limitless reward",
        "paragraph": "A Baraisa restates the previous Mishnah: The passuk states:\"ואמרו ידינו לא שפכו את הדם הזה ועינינו לא ראו\" – And [the elders] say, “Our hands did not spill this blood, and our eyes did not see.” וכי על לבנו עלתה שב\"ד שופכין דמים – Did it enter our minds that elders of Beis Din are spillers of blood?! אלא לא בא לידינו ופטרנוהו בלא מזונות – Rather, they mean that [the victim] did not come to us and we sent him off without food, ולא ראינוהו והנחנוהו בלא לויה – and we did not see him and leave him to go without escort. Rebbe Meir said: כופין ללויה ששכר הלויה אין לה שיעור – We force a person regarding escort, because its reward is without limit. This is demonstrated from the incident where a Canaani wordlessly indicated the hidden entrance of Beis El to the army of shevet Yosef, enabling it to be conquered. This man and his family were spared. He founded the city of Luz, which produced techeiles, escaped Sancheiriv’s and Nevuchadnezzar’s conquests, ואף מלאך המות אין לו רשות לעבור בה – and even the Angel of Death has no permission to pass through it."
      },
      {
        "id": 2,
        "title": "The incident of Elisha and the bears",
        "paragraph": "Rebbe Yochanan said in the name of Rebbe Meir: כל שאינו מלוה ומתלוה כאילו שופך דמים – Whoever does not escort, or is not escorted, is as if he has spilled blood, שאילמלי ליווהו אנשי יריחו לאלישע – ­for if the men of Yericho had escorted Elisha from their city, לא גירה דובים לתינוקות – he would not have incited bears against the children for ridiculing him (who would not have done so had he been escorted).The Gemara explains that when they called out, \"עלה קרח עלה קרח\" – Go away, bald one, go away, bald one, they meant: עלה שהקרחת עלינו את המקום – Go away, for you have made this place “bald” for us by curing the city’s bitter waters (making their importing services unnecessary). Rebbe Elazar says they were called \"נערים\" –youths, שמנוערים מן המצות – because they were emptied of mitzvos, and \"קטנים\" – little, שהיו מקטני אמנה – because they were of little faith. A Baraisa teaches they were youths, butובזבזו עצמן כקטנים – they belittled themselves like children. The passuk says Elisha “saw” them and cursed them, and four interpretations are offered: (1) He gazed at them for punishment, which causes either death or poverty; (2) he discerned that they were conceived on Yom Kippur (when relations are prohibited); (3) he saw that they had a pagan hairstyle; or (4) that he perceived that they did not have a trace of mitzvah in them, nor in their descendants."
      }
    ]
  },
  {
    "daf": 47,
    "data": [
      {
        "id": 0,
        "title": "לעולם תהא שמאל דוחה וימין מקרבת",
        "paragraph": "It was taught in a Baraisa: לעולם תהא שמאל דוחה וימין מקרבת – It should always be the left hand which pushes away, and the right should bring close, לא כאלישע שדחפו לגחזי בשתי ידיו – unlike Elisha, who pushed Geichazi away with both hands, ולא כיהושע בן פרחיה שדחפו לאחד מתלמידיו בשתי ידיו – and unlike Yehoshua ben Perachyah, who pushed one of his students away with both hands. After Elisha declined reward for miraculously curing Naaman, Geichazi followed Naaman and said Elisha had decided to accept reward. Elisha discerned Geichazi’s actions, and castigated him forcefully, cursing him and his descendants with tzaraas. Later, Elisha went to him to convince him to repent, but Geichazi refused, quoting Elisha’s teaching: כל מי שחטא והחטיא את הרבים – Anyone who sins and causes others to sin,אין מספיקין בידו לעשות תשובה – is not given the opportunity to do teshuvah. When Rebbe Yehoshua ben Perachyah was traveling with his students, he lauded the hostess of their inn: כמה נאה אכסניא זו – How nice is this hostess, referring to her good deeds. A student said: רבי עיניה טרוטות – Rebbi, but her eyes are round! Rebbe Yehoshua responded strongly and put him in cheirem. Rebbe Yehoshua did not accept his requests to return, until one day he intended to accept him but motioned to him while reciting Shema, which the student misinterpreted as pushing him away."
      },
      {
        "id": 1,
        "title": "What happens if the murderer’s identity becomes known",
        "paragraph": "The next Mishnah states: נמצא ההורג עד שלא נערפה העגלה – If the murderer was found before the calf was decapitated, תצא ותרעה בעדר – it goes out and grazes with the flock (and is permitted in use, because this Tanna holds that benefit from the עגלה only becomes prohibited after its decapitation). If the murderer was discovered after the calf was already decapitated, it is buried in its place like an ordinary עגלה ערופה, although the murderer became known, שעל ספק באתה מתחילתה – because [the עגלה] originally came to atone for a circumstance of uncertainty, כיפרה ספיקה והלכה לה – it atoned for the uncertainty and went on, meaning it achieved its purpose at the time the killer’s identity was unknown. The Mishnah adds that the murderer is still executed. The Gemara says even the testimony of a single witness who claims to know the murderer’s identity is accepted, because the passuk says: לא נודע מי הכהו – it is unknown who struck him. This implies that if it is known to anyone, they do not perform an עגלה ערופה. Rebbe Akiva adds that if Beis Din witnessed a murder, even if they cannot identify the murderer, they do not perform עגלה ערופה."
      },
      {
        "id": 2,
        "title": "Sotah waters and עגלה ערופה ended when wickedness increased",
        "paragraph": "The Mishnah had taught: משרבו הרוצחנין בטלה עגלה ערופה – When the murderers increased, עגלה ערופה ceased. A Baraisa explains: לפי שאינה באה אלא על הספק – Because it only comes to atone for cases of uncertainty of the murderer’s identity; משרבו הרוצחנין בגלוי בטלה עגלה ערופה – when murderers who killed in the open increased, עגלה ערופה ceased. The Mishnah had taught: משרבו המנאפים פסקו המים המרים – When adulterers increased, the bitter waters were discontinued. A Baraisa explains the reason: The passuk states: \"ונקה האיש מעון\" – The man will be innocent of iniquity, teaching בזמן שהאיש מנוקה מעון המים בודקין את אשתו – when the man is innocent of iniquity of illicit relations, the waters examine his wife, אין האיש מנוקה מעון אין המים בודקין את אשתו – but if the man is not innocent of iniquity, the waters do not examine his wife. The Baraisa quotes another passuk: לא אפקוד על בנותיכם כי תזנינה – I will not punish because of daughters when they commit harlotry, and the Gemara explains this teaches that even the immorality of one’s sons and daughters prevent the waters from examining his wife. A Baraisa proceeds to list the consequences of an increase in many negative behaviors."
      }
    ],
    "siman": {
      "title": "Siman - Maze",
      "paragraph": "The talmid who got pushed into the red maze of doom by his Rebbe’s left hand, ended up discovering the murderer after the eglah arufah had already been decapitated, and then realized when he saw many murderers hanging out there as well that the era of the eglah arufah was probably over. ה"
    }
  },
  {
    "daf": 48,
    "data": [
      {
        "id": 0,
        "title": "The takanah of demai",
        "paragraph": "The Mishnah on Daf 47a had taught that Yochanan Kohen Gadol abolished the maaser declaration, and the Gemara explains this is because maaser is no longer given to Leviim, but to Kohanim.The Gemara asks that this implies that maaser was being taken during Yochanan’s days, yet a Baraisa indicates it was not: Yochanan Kohen Gadol enacted the law of demai, because he discovered that although people separated terumah (since it incurs מיתה בידי שמים), many did not separate maaser, thinking that its tevel does not incur death. Yochanan told them: בני בואו ואומר לכם – My sons! Come, and I will tell you that כשם שתרומה גדולה יש בה עון מיתה – just as eating terumah gedolah is a sin punished by death, כך תרומת מעשר וטבל יש בהן עון מיתה – so too, eating terumas maaser and tevel are sins punishable by death. He then decreed: הלוקח פירות מע\"ה – One who purchases produce from an am haaretz, מפריש מהן מעשר ראשון ומעשר שני – separates from them maaser rishon and maaser sheni (or maaser ani). He separates terumas maaser and gives it to a Kohen and brings the maaser sheni to Yerushalayim. Maaser rishon and maaser ani, which are permitted to be eaten by anyone, he keeps for himself, since המוציא מחבירו עליו הראיה – the burden of proof is on the Levi and ani to prove they were not taken. The Gemara answers that there are two enactments: one for those who were careful to tithe (not to recite the maaser confession), and one regarding demai, to separate from produce bought from an am haaretz."
      },
      {
        "id": 1,
        "title": "The loss of אורים ותומים after the early prophets’ death, and incidents of bas kol",
        "paragraph": "The next Mishnah states: משמתו נביאים הראשונים בטלו אורים ותומים – From when the early prophets died, the Urim V’Tumim ceased to function. The Gemara ultimately identifies the “early” prophets, as those before Chaggai, Zechariah, and Malachi, the “final” prophets. A Baraisa teaches that when these three died, ruach hakodesh left Klal Yisroel, but they would still at times experience a bas kol. The Gemara records two incidents in which the Rabbis heard a bas kol declare: יש בכם אדם אחד שראוי שתשרה שכינה עליו – There is a man among you who is deserving that the Shechinah should rest upon him, אלא שאין דורו ראוי לכך – but his generation is not worthy of this. In the first incident, the Rabbis realized it referred to Hillel Hazakein. When he died, they eulogized him: הי חסיד הי עניו תלמידו של עזרא – “Woe, such a pious man is no more! Woe, such a humble man is no more! A disciple of Ezra!” In the later incident, the Rabbis realized that Shmuel HaKatan was the one intended. When he died, they eulogized him similarly, concluding with \"תלמידו של הלל\" – a disciple of Hillel Hazakein."
      },
      {
        "id": 2,
        "title": "Machlokes how the Beis Hamikdash was built and where the shamir was used",
        "paragraph": "The Mishnah stated:  משחרב בית המקדש בטל השמיר – When the Beis Hamikdash was destroyed, the shamir ceased. In a Baraisa, Rebbe Yehudah says: שמיר שבו בנה שלמה את בית המקדש – The shamir is [the creature] with which Shlomo built the Beis Hamikdash, as the pasuk calls the stones \"אבן שלמה מסע\" – complete quarry stones, which he understands literally- that no iron tools were used even to cut them from the mountains, and only the shamir was used. Rebbe Nechemiah responded: וכי אפשר לומר כן – Is it possible to say so? והלא כבר נאמר כל אלה אבנים יקרות וגו' מגוררות במגרה – But does it not say, “All these were of valuable stones…filed with a file”!? Although the pasuk says about iron tools that ”לא נשמע בבית בהבנותו\" – were not heard in the [Beis Hamikdash] while it was being built, Rebbe Nechemiah explains: שהיה מתקין מבחוץ ומכניס מבפנים – that they would prepare stones outside the Mikdash and bring them inside. The Gemara explains that according to Rebbe Nechemiah, the shamir was used to engrave the stones of the choshen and ephod, which had to be engraved but also were required to remain complete."
      }
    ],
    "siman": {
      "title": "Siman - Brainiacs",
      "paragraph": "The red-haired brainiacs who finally gave up on trying to conceive of an easy way to teach people how to separate demai, got busy working on their Bas Kol detector, using fossils they believed were the preserved remains of the ancient shamir."
    }
  },
  {
    "daf": 49,
    "data": [
      {
        "id": 0,
        "title": "Qualities lost with the passing of Tannaim",
        "paragraph": "The next Mishnah lists qualities which were lost with the passing of numerous Tannaim: משמת ר\"מ בטלו מושלי משלים – Once Rebbe Meir died, there ceased composers of parables. משמת בן עזאי בטלו השקדנים – Once Ben Azzai died, there ceased the diligent. משמת בן זומא בטלו הדרשנים – Once Ben Zoma died, there ceased experts in derashos. משמת ר\"ע בטל כבוד התורה – Once Rebbe Akiva (who darshened even points of letters) died, honor of Torah ceased. משמת ר' חנינא בן דוסא בטלו אנשי מעשה – Once Rebbe Chanina ben Dosa died, there ceased people of miraculous deeds.  It continues: Once Rebbe Yose Katonta died, there ceased to be pious men. Why was he called “Katonta”? Because he was the lesser of the pious men. Once Rebbe Yochanan ben Zakkai died, the shine of wisdom ceased. Once Rabban Gamliel the Elder died, honor of Torah ceased, and purity and abstinence died. Once Rebbe Yishmael ben Pavi died, the shine of Kehunah ceased. Once Rebbi died, humility and fear of sin ceased. A Baraisa near the end of the mesechta provides an additional list."
      },
      {
        "id": 1,
        "title": "The signs of the footsteps of Moshiach",
        "paragraph": "Rebbe Eliezer Hagadol said: בעקבות משיחא – During the “footsteps of Moshiach” (the period just before his arrival), חוצפא יסגא – insolence will increase, ויוקר יאמיר – prices will rise, הגפן תתן פריה והיין ביוקר – and the vine will bear its fruit, yet wine will be expensive. He continues: The government will turn to heresy, and there will be no reproof, the former meeting place of sages will be used for harlotry, the Galilee will be destroyed and the Gavlan will be desolated, people on the border will wander from town to town but not be helped, the wisdom of scribes will decay, those who fear sin will be despised, truth will be absent, youths will shame the elders, and elders will stand before minors. “A son disgraces his father; a daughter stands against her mother, and a daughter-in-law to her mother-in-law; a man’s enemies are people of his household.” He concludes: פני הדור כפני הכלב – The face of the generation is like the face of a dog; הבן אינו מתבייש מאביו – a son is not ashamed from his father. ועל מה יש לנו להשען על אבינו שבשמים – And upon what can we rely? On our Father in Heaven!"
      },
      {
        "id": 2,
        "title": "The story of the pig sent up the wall of Yerushalayim and the decree against Greek wisdom",
        "paragraph": "The Rabbis taught: When the Chashmonai descendant Hyrkanos was besieging his brother Aristobolus in Yerushalayim, a basket with money would be lowered to the besiegers, who would send back up a lamb for that day’s korban tamid. An old man, who was familiar with Greek wisdom (a secretive method of communication used by aristocrats), secretly informed those outside: כל זמן שעוסקים בעבודה אין נמסרין בידכם – As long as they are occupied with the avodah, they will not be delivered into your hands. The next day, the besiegers put a pig into the basket, which stuck its hooves into the wall, and Eretz Yisroel shook over four hundred parsah. At that time, they declared:ארור אדם שיגדל חזירים – Cursed is the man who raises swine, וארור אדם שילמד לבנו חכמת יוונית – and cursed is the man who teaches his son Greek wisdom! The Gemara clarifies that using the Greek language is acceptable, and they only forbade learning “Greek wisdom.” The Gemara adds that even learning Greek wisdom was permitted for those of Rabban Gamliel’s household, דקרובין למלכות הוו – because they were closely involved with the government."
      }
    ],
    "siman": {
      "title": "Siman - Meat (Butcher)",
      "paragraph": "The butcher who closed his Red Meat Butcher shop to attend levayas of many Rabbanon, when all good things seem to cease realized he was living in the  עיקבתא דמשיחאbecause chutzpah increased when he returned to his store and found a pig in a basket which stuck its hooves in the wall, but instead of lamenting he sponsored the kosher meat for the tens of thousands of lomdei Daf Yomi making a siyum on Maseches Sotah."
    }
  }
]
