[
  {
    "daf": 2,
    "data": [
      {
        "id": 0,
        "title": "Why the Tanna used the term פסולה for a Succah whose s’chach is above twenty amos",
        "paragraph": "The opening Mishnah of the Masechta states: סוכה שהיא גבוהה למעלה מעשרים אמה פסולה ורבי יהודה מכשר – A succah whose s’chach is above twenty amos high, is passul. Rebbe Yehudah says it is kosher. The Gemara asks what is unique about the case of a Succah, where the Tanna uses the word פסולה, whereas in a Mishnah in Eruvin, regarding a korah at the entrance of a mavoi תני תקנתא – the Tanna states a remedy on how to adjust the korah that is too high, by lowering it? Two answers are given. Since a succah is a d’Oraysa, meaning that the halachah was taught at Har Sinai, the Tanna used the language of פסולה, since it was not made according to its proper specification. However, the halachah requiring the adjustment of a mavoi is a d’Rabbanon, therefore, the Tanna can only state a remedy. Rashi explains that the term פסולה is inappropriate here since there is no preexisting restriction on the height of the korah. The Mishnah itself is the very source of the “twenty-amos” pessul. An alternative answer is that it would be appropriate to state a remedy for a d’Oraysa as well, except that in regard to a succah דנפישין מיליה – whose details are numerous, the Mishnah would be too lengthy if it would state a remedy for each case. Whereas regarding a mavoi, of which there is only one case, the Tanna can concisely state a remedy."
      },
      {
        "id": 1,
        "title": "Three sources that s’chach cannot be above twenty amos",
        "paragraph": "The Gemara asks for the source that a succah whose s’chach is above twenty amos is פסול:● Rabbah said that the passuk states: \"למען ידעו דרתיכם כי בסכות הושבתי את בני ישראל\"- So that your generations will know that I caused bnei Yisroel to dwell in succos. Until twenty amos a person is aware he is in a Succah. However, if the s’chach is higher than twenty amos, a person is not aware that he is dwelling in a Succah משום דלא שלטא בה עינא – because the eye does not notice the s’chach.● Rebbe Zeira said that the passuk states: \"וסכה תהיה לצל יומם מחרב\" – And a Succah will be for shade in the daytime from the heat. Until twenty amos a person sits in the shade of a Succah. However, if the s’chach is above twenty amos, a person is not sitting in the shade of the Succah אלא בצל דפנות – but in the shade of the walls.● Rava said that the passuk states: \"בסכת תשבו שבעת ימים\" – In succos you shall dwell for seven days. The Torah is telling us that for all seven days צא מדירת קבע ושב בדירת עראי – leave your fixed dwelling and sit in a temporary dwelling. Until a height of twenty amos, a person can make a temporary dwelling, but above twenty amos he must make it a דירת קבע – a fixed dwelling."
      },
      {
        "id": 2,
        "title": "בשאין דפנות מגיעות לסכך",
        "paragraph": "Rebbe Yoshiyah said in the name of Rav that the machlokes in the Mishnah is only בשאין דפנות מגיעות לסכך – where the walls do not reach the s’chach. If they do, the Tanna Kamma would agree that a succah higher than twenty amos is kosher. The Gemara asks which opinion this goes with, and answers that is in accord with Rabbah, who disqualified a succah more than twenty amos high because the eye does not notice the s’chach. Here, since the walls reach the s’chach, the eye will surely notice it. The Gemara continues with two more versions of how Rav qualified the machlokes between the Tanna Kamma and Rebbe Yehudah."
      }
    ],
    "siman": {
      "title": "House",
      "paragraph": "The above twenty amah succah that looked like a house and was next to a mavoi was declared passul because it didn’t remind people of the succos in the midbar, and its walls did not reach the s'chach"
    }
  },
  {
    "daf": 3,
    "data": [
      {
        "id": 0,
        "title": "Machlokes Beis Shammai and Beis Hillel on the minimum size of a succah",
        "paragraph": "Rav Shmuel bar Yitzchak said: הלכה צריכה שתהא מחזקת ראשו ורובו ושולחנו – The halachah is that a succah must be large enough to accommodate one’s head, most of his body and his table. When asked according to whom he is ruling, he answered that he was going according to Beis Shammai, who argues later in a Mishnah with Beis Hillel. Beis Hillel holds that if the table was inside the house, the succah is still valid. Rav Nachman bar Yitzchak challenged Rav Shmuel bar Yitzchak’s premise that Beis Shammai and Beis Hillel were debating a succah’s minimum dimensions. Perhaps they were arguing in a matter of a large succah וכגון דיתיב דמטולתא ושולחנו בתוך הבית – where one sits at the entrance of the succah and his table in his house. Beis Shammai holds גזרינן שמא ימשך אחר שולחנו – we prohibit this lest he is drawn after his table and eats inside the house, and Beis Hillel says we do not prohibit this? After a lengthy analysis, the Gemara concludes that they are arguing in both cases."
      },
      {
        "id": 1,
        "title": "Exemptions for a house that is not four by four amos squared",
        "paragraph": "The Gemara brings a Baraisa that teaches that a house that does not contain an area that is four by four amos, is patur from many halachos. It begins פטור מן המזוזה ומן המעקה ואין מטמא בנגעים – it is patur from the mitzvah of mezuzah, and from the mitzvah of a protective fence, and does not become tamei from tzaraas, ואינו נחלט בבתי ערי חומה – and is not irredeemably sold as are the houses of walled cities, ואין חוזרין עליו מעורכי המלחמה –  and we do not return on its account from the battle front. What is the reason?  Because the word \"בית\" is written in the Torah with reference to all of them, and a dwelling less than four amos squared is not considered a bayis. The Baraisa continues, ואין מערבין בו ואין משתתפין בו ואין מניחין בו עירוב – and we do not make an eruv chatzeiros with such a house, nor do we make a shitufei mevo’os with it, and we do not place an eruv chatzeiros in it. What is the reason? דלא חזי לדירה – Because a structure less than four amos squared is not fit for dwelling. Rashi explains that since the residents of the chatzeir are regarded as dwelling in the house that the eruv is placed in, it stands to reason that the house must be fit for habitation."
      },
      {
        "id": 2,
        "title": "A shituf may be placed in a house that is less than four by four",
        "paragraph": "The Baraisa above stated that an eruv may not be placed in house that is less than four by four amos and infers from this that we may place a shituf in it. What is the reason for the distinction between an eruv and a shituf? דלא גרע מחצר שבמבוי – Because a house smaller than four by four amos squared is no worse than a chatzeir in a mavoi. Rashi explains that if we were to view the house as though its roof and walls were removed it is now simply part of the surrounding open-air chatzeir. The difference between a shituf and an eruv is that an eruv symbolically allows all the residents of a chatzeir to be legally viewed as dwelling in one house. Therefore, the house must be fit for habitation. The function of a shituf, on the other hand, is to merge all the courtyards of the mavoi for their use, not for habitation. As long as the shituf is located in a protected space, the shituf is valid, even if that space is less than by four by four."
      }
    ],
    "siman": {
      "title": "Camel",
      "paragraph": "The huge camel sticking out from his small succah was trying to pull his table into it from his tiny house that was too small to be chayav for mezuzah and maakeh and was only suitable to keep a shituf."
    }
  },
  {
    "daf": 4,
    "data": [
      {
        "id": 0,
        "title": "הוצין",
        "paragraph": "The Gemara presents several halachos pertaining to the Mishnah’s ruling that a succah above twenty amos is passul. If the succah was taller than twenty amos והוצין יורדין בתוך עשרים אמה – and the leaves of the palm branches that comprise its s’chach, were dangling into the airspace of the succah, within twenty amos of the floor, אם צלתם מרובה מחמתם כשרה – if the shade provided by these tips, is greater than their sunlight – it is kosher. If not, it is passul.If the succah was exactly ten tefachim tall, the minimum height of a succah, והוצין יורדין לתוך עשרה – and the palm branch leaves were dangling within the ten tefachim, Abaye thought to say, if their sunlight is greater than their shade, it is kosher. Rava said to Abaye, הא דירה סרוחה היא ואין אדם דר בדירה סרוחה – But this is a dwelling that is uncomfortable to live in, and a person does not live in such a dwelling."
      },
      {
        "id": 1,
        "title": "בנה בה איצטבא",
        "paragraph": "The Gemara presents another case of a succah that is taller than twenty amos ובנה בה איצטבא – and one built in it a platform opposite the entire face of the succah’s middle wall, so that the platform abuts all three walls ויש בה הכשר סוכה כשרה – and this platform contains the minimum required area for a succah, which is seven by seven tefachim, the succah is kosher. If he built the platform on the side of the succah, which Rashi explains means that it runs along one wall, part of the middle wall, but is distant from the third wall, then if there is from the edge of the platform until the opposite wall, a distance of four amos, it is passul. If the distance is less than four amos it is kosher. Rashi explains that it is kosher based on the Halachah l’Moshe M’Sinai of דופן עקומה – a bent wall. This law allows us to qualify a succah by “bending” up to slightly less than four amos of its wall. That is, we view the s’chach that abuts the distant wall, as part of the wall itself. We then measure the succah’s height from the edge of the platform until the head of the curved extension, for a distance of twenty amos or less.The Gemara clarifies that even though the law of דופן עקומה is already taught elsewhere, this case of the platform is coming to teach that even though the third wall was not a valid wall to begin with, because it was above twenty amos, we can still apply the halachah of דופן עקומה to it to remedy the disqualification."
      },
      {
        "id": 2,
        "title": "When to apply גוד אסיק מחיצתא",
        "paragraph": "The Gemara presents another case of a succah taller than twenty amos, and one built in it a pillar that is ten tefachim tall and is seven by seven tefachim. Abaye thought to say גוד אסיק מחיצתא – that we would extend and raise the partition on each of the pillar’s sides, to the s’chach above, creating a valid succah on the pillar’s top. Rashi explains that since the pillar’s sides are themselves partitions ten tefachim in height, the top of the pillar can be viewed as though it were surrounded by the partitions rising from below. Rava said to Abaye, בעינן מחיצות הניכרות וליכא – We need noticeable walls for a succah and there are none here. The Rishonim explain that although גוד אסיק would work for hilchos Shabbos, to consider the top of the pillar a reshus hayachid, it does not apply here, since the area of a succah must be a דירה – a dwelling place. This can only be attained through noticeable walls."
      }
    ],
    "siman": {
      "title": "Door",
      "paragraph": "The owners took the door off the twenty-one amah succah where the dangling hutzin didn’t provide the majority of shade, and used it as a platform instead, after they were told their גוד אסיק idea with a ten tefachim pillar wouldn’t work."
    }
  },
  {
    "daf": 5,
    "data": [
      {
        "id": 0,
        "title": "The source that a succah must be at least ten tefachim in height",
        "paragraph": "The Gemara asks what the source is for the Mishnah’s ruling that סוכה שאינה גבוהה עשרה טפחים פסולה – a succah that is not at least ten tefachim high, is invalid. Rav, Rebbe Chanina, Rebbe Yochanan and Rav Chaviva taught: ארון תשעה וכפורת טפח הרי כאן עשרה – The aron was nine tefachim tall and the thickness of the kapores was one tefach; which is a total of ten tefachim. And it is written: \"ונועדתי לך שם ודברתי אתך מעל הכפרת\" – It is there that I will set My meetings with you, and I shall speak with you from atop the Kapores. And it was taught in a Baraisa: Rebbe Yose says: מעולם לא ירדה שכינה למטה ולא עלו משה ואליהו למרום – The Shechinah never descended below, into the human domain, and Moshe and Eliyahu never ascended into the Heavens, as it is stated, השמים שמים לה' והארץ נתן לבני אדם\"” – As for the heavens, the heavens are Hashem’s, but the earth, He has given to mankind. Since Hashem spoke to Moshe from atop the kapores, it follows that ten tefachim from the ground begins a separate domain. Accordingly, ten tefachim is the minimum height of a partition."
      },
      {
        "id": 1,
        "title": "The one tefach thickness of the Kapores is learned from the border of the Shulchan",
        "paragraph": "The Gemara notes that it is correct to say that the aron was nine tefachim tall, since the passuk states its height was an amah and a half, which equals nine tefachim, but where is it known that the kapores was a tefach thick? It is stated in a Baraisa that Rebbe Chanina taught, כל הכלים שעשה משה – All the keilim that Moshe made, the Torah gave their length, width and height measurements, whereas in the case of the kapores, the Torah gave its length and width, but it did not give its height measurement. Rather צא ולמד מפחות שבכלים – go and learn the height of the kapores from the least of the keilim, for it is stated with regard to the Shulchan, \"ועשית לו מסגרת טפח סביב\" – You shall make for it a border of one tefach, all around. Just as there, the border was a tefach high, say here also the kapores measured a tefach high."
      },
      {
        "id": 2,
        "title": "The ten tefachim of airspace requirement is learned from the Keruvim",
        "paragraph": "After establishing that the minimum height of a succah was derived from the Aron and Kapores that were ten tefachim tall, the Gemara asks וממאי דחללה עשרה בר מסככה – from what evidence do you say that the interior space for a succah must be ten tefachim in height, excluding the thickness of its s’chach? Say, rather, that the ten tefachim are measured with its s’chach? Rashi explains that if it is learned from the combination of the aron and the kapores, then the ten tefachim is a combination of the nine tefachim of airspace and one tefach of the kapores, which in the case of the succah would be represented by one tefach of s’chach. The Gemara therefore presents a different source for the ten tefachim height requirement for a succah, from the height of Moshe’s Keruvim. The Gemara determines that the Keruvim were ten tefachim from head to toe, and it is written, \"והיו הכרבים פרשי כנפים למעלה סככים בכנפיהם על הכפרת\" – The Keruvim shall be with wings spread above, sheltering the Kapores with their wings. קרייה רחמנא סככה למעלה מעשרה – Here we see that the Torah call this sheltering a succah covering because it occurs above an airspace of ten tefachim."
      }
    ],
    "siman": {
      "title": "Hay",
      "paragraph": "When the boys who filled the nine tefachim box with hay and then covered it with a tefach thick cover they made from the border of their kitchen table were about to be caught by their mom, they raised their arms up in unison and covered it, pretending to be little angels."
    }
  },
  {
    "daf": 6,
    "data": [
      {
        "id": 0,
        "title": "שיעורין הלכה למשה מסיני",
        "paragraph": "Rav  Chiya bar Ashi said in the name of Rav, שיעורין חציצין ומחיצין הלכה למשה מסיני – the halachos of shiurim, chatzitzahs and mechitzas, are Halacha l’Moshe m’Sinai. The Gemara challenges this, stating that shiurim are in fact d’Oraysas, and brings the passuk of the ז' מינים as proof, as Rav Chanin said: כל הפסוק הזה לשיעורין נאמר – This entire passuk was stated for the purpose of teaching shiurim; that is, each of the seven fruits is a unit of measure for some law. For example, עצם כשעורה מטמא במגע ובמשא ואינו מטמא באהל – a human bone fragment the size of a barley kernel, is metamei through contact, or to a person who carries it, even if he does not touch it directly, and it is not metamei through being under a common roof. גפן teaches the size of a reviis of wine for a nazir. תאנה teaches כגרוגרת להוצאת שבת – the size of a dried fig is the minimum amount of food for which one is chayav for hotza’ah on Shabbos. The Gemara rejects this challenge to Rav, since these shiurim are not written explicitly in the Torah. Rather, קרא אסמכתא בעלמא הוא – the Rabbanon only linked these shiurim to the passuk as a support for them."
      },
      {
        "id": 1,
        "title": "Clarifying which laws of chatzitzah are Halachah l’Moshe m’Sinai",
        "paragraph": "The Gemara challenges Rav’s assertion that laws of chatzitzah are הלכה למשה מסיני, proving that they are d’Oraysa from the passuk from the parshah of Metzora, \"ורחץ את בשרו במים\" – and he shall immerse his flesh in the water. שלא יהא דבר חוצץ בינו לבין המים – This teaches that there should be no extraneous matter that is a chatzitzah between him and the mikveh water. The Gemara clarifies that Rav was referring to a halacha which Rebbe Yitzchok taught, דבר תורה רובו ומקפיד עליו חוצץ – According to Torah law, (meaning Halacha l’Moshe m’Sinai), something on one’s hair is only a chatzitzah if it covers the majority of the hair, and one objects to it being there. Rashi gives the examples of dried blood, ink, clay or tar , and explains that if one does not object to the object being on his hair, it is considered as part of the body. The Rabbanon decreed that even if only one factor exists, meaning that it covers most of one’s hair, or if he objects to it being on his hair, the tevillah is invalid."
      },
      {
        "id": 2,
        "title": "שאין לה שלש דפנות פסולה",
        "paragraph": "The Mishnah stated, ושאין לה שלש דפנות פסולה – that a succah that does not have three walls, is passul. It was taught in a Baraisa, שתים כהלכתן ושלישית אפילו טפח – A succah must have two proper walls, and a third wall even a tefach long. Rebbe Shimon says: שלש כהלכתן ורביעית אפילה טפח – It must have three proper walls, and a fourth wall even a tefach long. The Gemara explains their machlokes is based on which has primacy when expounding on a word from the Torah, its written form or pronounced form? The Rabbanon hold יש אם למסורת – the written form has primacy. Therefore, they expounded the three words בסכת in the Torah, twice written without a vav and once written with a vav, as four allusions to a succah. Subtract one, which is required to introduce the mitzvah of succah itself, and three allusions remain. Of these, two must be proper walls ואתא הלכתא וגרעתה לשלישית – and the oral law comes and reduces the length of the third wall and establishes it as a tefach. Rebbe Shimon maintains יש אם למקרא – the pronounced form has primacy, and therefore there are six allusions to a succah. Since the first mention of succos is needed for the mitzvah, only four allusions remain. Three must be proper walls and the oral law teaches the fourth wall can be a tefach. The Gemara presents three alternative explanations for the basis of the machlokes."
      }
    ],
    "siman": {
      "title": "Sword",
      "paragraph": "The sword salesman who masterfully used his high-priced sword to chop the ז' מינים according to their different shiurim, had tar on the majority of his hair and did his demonstrations out of a succah with two proper walls and a third wall that was just a tefach."
    }
  },
  {
    "daf": 7,
    "data": [
      {
        "id": 0,
        "title": "A succah with a tefach long third wall is permitted on Shabbos",
        "paragraph": "The Baraisa on Daf 6b stated שתים כהלכתן ושלישית אפילו טפח – A succah must have two proper walls, and a third wall even a tefach long. On this Daf, Rabbah said: וכן לשבת – And this tefach long wall is also effective for permitting carrying on Shabbos. מגו דהויא דופן לענין סוכה הויא דופן לענין שבת – Since it has the status of a wall in regard to hilchos succah, it has the status of a wall in regard to Shabbos as well. Rashi explains that since it has the status of a wall to qualify to be a succah for eating and sleeping, it also serves as a wall on Shabbos, to transform the succah into a reshus hayachid. This is so even though during any other Shabbos of the year such a structure would remain a reshus harabim, and even on the Shabbos during Succos, any non-succah structure with such walls would remain a reshus harabim. Abaye challenges this ruling but is unsuccessful."
      },
      {
        "id": 1,
        "title": "Machlokes whether the walls of the succah must provide shade like s’chach",
        "paragraph": "The Mishnah stated, ושחמתה מרובה מצלתה פסולה – that a succah whose sunlight is greater than its shade, is invalid. It was taught in a Baraisa, חמתה מחמת סיכוך ולא מחמת דפנות – Only where its sunlight is on account of the s’chach is the succah passul, not where the sunlight is on account of the walls. Rebbe Yoshiah says: אף מחמת דפנות – even sunlight on account of the walls invalidates the succah. Rav Yaimar bar Shelemyah said in the name of Abaye, that Rebbe Yoshiah’s reason is based on what is written: וסכת על הארן את הפרכת\"” – And screen (v’sakosa) the Aron with the Paroches. פרוכת מחיצה וקא קרייה רחמנא סככה – Now, the Paroches is a partition, yet the Torah calls it s’chach (v’sakosa). אלמא מחיצה כסכך בעינן – We see that a mechitzah is required to be as s’chach, and just as s’chach provides shade, so must the walls. The Gemara explains that the Rabbanon’s response would be ההוא דניכוף ביה פורתא דמחזי כסכך – This reference to the Paroches being as s’chach, teaches only that the Paroches should be bent over slightly on top, so that it appears roof-like."
      },
      {
        "id": 2,
        "title": "The Tannaim that hold a succah must be a דירת קבע",
        "paragraph": "Abaye listed several Tannaim and said כולהו סבירא להו סוכה דירת קבע בעינן – they all maintain that a succah must be fit to be a fixed dwelling.● Rebbe said: כל סוכה שאין בה ארבע אמות על ארבע אמות פסולה – Any succah that is not four by four amos in area is invalid. This is because Rebbe holds that only a structure of this size is fit for a דירת קבע, unlike those who hold that a succah can be seven by seven tefachim.● Rebbe Yoshiyah, as we have just learned, held that the walls of the succah may not allow in sunlight, just like the typical walls of a דירת קבע.● Rebbe Yehudah in the Mishnah, taught that the succah walls can be higher than twenty amos, indicating that there is no pesul if its walls would have to be erected in a fixed manner.● Rebbe Shimon, as we have learned, holds that a succah must have three proper walls and the fourth wall can be as narrow as a tefach. We see that he requires four walls, so that it is a דירת קבע.  Abaye also brings the opinions of Rabban Gamliel, Beis Shammai, Rebbe Eliezer and Acheirim, who also require a succah to be a דירת קבע."
      }
    ],
    "siman": {
      "title": "Gun (כלי זיין)",
      "paragraph": "The gun enthusiast, who used his tefach thick gun as the third wall even on Shabbos, enjoyed his meal in the succah with walls that let in plenty of light, while wondering how his neighbors were doing sitting inside their massive דירת קבע."
    }
  },
  {
    "daf": 8,
    "data": [
      {
        "id": 0,
        "title": "סוכה העשויה ככבשן",
        "paragraph": "On Daf 7b Rebbe Yochanan said: סוכה העשויה ככבשן – a succah that is made round like an oven, if there is enough space in the circumference to seat twenty-four people, it is valid. The Gemara asks who this teaching is like. If it goes according to Rebbe, who holds that a succah must be four by four amos, the measurement is not accurate, since a person occupies a space of an amah, and it is known כל שיש בו בהקיפו שלשה טפחים יש בו רוחב טפח – that any circular object whose circumference is three tefachim, has a diameter of one tefach. According to Rebbe, to yield a width of four amos, a circumference of twelve amos should suffice? The Gemara on this Daf goes through an extensive analysis of the measurements and concludes that Rebbe Yochanan’s case was where the twenty-four people are sitting outside the circle, and Rebbe Yochanan rounded off the measurements for a slightly larger circle than would fit the required square. The Gemara presents an alternative explanation, as well."
      },
      {
        "id": 1,
        "title": "שתי סוכות של יוצרים זו לפנים מזו",
        "paragraph": "Rebbe Levi reported in the name of Rebbe Meir, שתי סוכות של יוצרים זו לפנים מזו – Two potters huts, one within the other, הפנימית אינה סוכה וחייבת במזוזה והחיצונה סוכה ופטורה מן המזוזה – the inner one is not a valid succah and is chayav in mezuzah, while the outer one is a valid succah, and is patur from mezuzah. Rashi explains that it was common that the inner hut would serve as the potter’s dwelling as well as a place to store finished pottery, while the outer hut would be his workshop, as well as the place to sell his wares. The Gemara asks why the outer hut is patur from mezuzah, since it can be considered a gatehouse for the inner hut, and be chayav in mezuzah, and answers משום דלא קביע – because a potter’s hut is not a permanent structure. Rashi explains that the inner hut is considered too inconsequential to view a room which leads to it as a “gatehouse.”"
      },
      {
        "id": 2,
        "title": "סוכות גנב'ך ורקב'ש",
        "paragraph": "The Gemara brings two Baraisos that each present a group of succahs that are valid. The first group is referred to as the גנב'ך group, which is a siman for: סוכת גוים סוכת נשים סוכת בהמה וסוכת כותים – The succah made for nochrim to live in during the summer, for women to weave in, for animals to have shade, and a succah made by Kusim.  The second Baraisa presents סוכת רקב'ש – which is a siman for:  סוכת רועים סוכת קייצים סוכת בורגנין וסוכת שומרי פרות – a succah of shepherds, for fig watchers, city watchmen and produce watchers. Each Baraisa states that their succos, and inferior succos as well, are kosher, if they are covered k’halachah, which Rav Chisda defines as being built for shade.The Gemara clarifies that each Tanna referred to the other group as inferior and explains: The Tanna of the גנב'ך group considers his succos as being superior, since they are permanent, whereas the huts of the רקב'ש group are inferior, since they are temporary. Rashi explains that the flocks move from place to place, and the produce is eventually taken from the field. The Tanna of the רקב'ש group holds they are superior, since בני חיובא נינהו – they are used by Jewish men who are all chayav in the mitzvah, whereas the dwellers in the גנב'ך group, such as goyim, women, animals and Kusim, are not."
      }
    ],
    "siman": {
      "title": "Challah",
      "paragraph": "The annual challah bake sale taking place in the large round succah, right behind the two potter’s huts one within the other, attracted the attention of goyim, women, and Kusim, as well as shepherds, fig watchers and city watchmen."
    }
  },
  {
    "daf": 9,
    "data": [
      {
        "id": 0,
        "title": "A succah is אסור בהנאה all seven days",
        "paragraph": "The next Mishnah states: סוכה ישנה – An old succah, which Rashi explains is a succah that was built at least thirty days before Succos, and not made expressly for the chag, בית שמאי פוסלין ובית הלל מכשירין. The Gemara asks what Beis Shammai’s reason is for disqualifying the succah, and answers that the passuk states, \"חג הסכות שבעת ימים לה'\" – the Chag of Succos, for seven days, unto Hashem; סוכה העשויה לשם חג בעינן – this teaches that we require a succah built for the sake of the chag. Beis Hillel uses that passuk for the teaching of Rav Sheishess, who reported in the name of Rebbe Akiva: From where do we know that the wood of a succah is prohibited for הנאה all seven days of Succos? The Torah states, חג הסכות שבעת ימים לה'\"” – the Chag of Succos, for seven days, unto Hashem.” The Gemara concludes that Beis Shammai agrees with this ruling and really bases his opinion on a different passuk.The Gemara brings a similar teaching from a Baraisa: Rebbe Yehudah ben Beseirah says: כשם שחל שם שמים על החגיגה כך חל שם שמים על הסוכה –Just as the שם שמים attaches itself upon a korban chagigah, and it becomes prohibited from mundane use, so too it attaches itself upon a succah, as the passuk states, \"חג הסכות שבעת ימים לה'\" – the Chag of Sukkos for seven days, for Hashem. From the juxtaposition of the word chag, signifying the chagigah, and Succos, we learn that just as the chagigah is sanctified to Hashem, so too the succah is לה’."
      },
      {
        "id": 1,
        "title": "העושה סוכתו תחת האילן כאילו עשאה בתוך הבית",
        "paragraph": "The next Mishnah states: העושה סוכתו תחת האילן כאילו עשאה בתוך הבית – If one builds his succah under a tree, it is as though he built it inside his house, which means that it is invalid. Rava said: This was taught only in regard to a tree whose shade is greater than its sunlight, but if the tree is so sparse that its sunlight is greater than its shade, the succah is valid. This is derived from what the Mishnah teaches: Why does the Tanna teach כאילו עשאה בתוך הבית – it is as though it was built inside the house? – Let him just say “It is invalid.” Rather he informs us that the tree under discussion is like a house. Just as a house צלתו מרובה מחמתו so too the tree, צלתו מרובה מחמתו.The Gemara challenges Rava’s ruling, saying that if the tree’s sunlight is greater than its shade it should be invalid, since he is being מצטרף kosher s’chach with passul s’chach? Rav Pappa answers, בשחבטן – the Mishnah refers to a case where he lowered the tree branches and intermingled them indistinguishably with the kosher s’chach. Rashi explains that the greater amount of kosher s’chach is mevatel the lesser amount of passul s’chach. The Gemara will clarify that the Mishnah is coming to teach that lowering the branches can even be done לכתחילה."
      },
      {
        "id": 2,
        "title": "סוכה על גבי סוכה",
        "paragraph": "The Mishnah stated: סוכה על גבי סוכה העליונה כשרה והתחתונה פסולה – A succah built on top of another succah, the upper one is kosher and the lower one is passul. It was taught in a Baraisa, the passuk states \"בסכת תשבו\" – In succahs you shall dwell, which implies, but not in a succah beneath a succah, and not in a succah beneath a tree, and not in a succah beneath a house. When the Gemara suggests \"בסכת\" - in succos, being that it is in the plural form, implies two succahs, which seemingly permits even one succah beneath the other, Rav Nachman bar Yitzchak answers, that it is written, \"בסכת\" without a vav, suggesting a single succah."
      }
    ],
    "siman": {
      "title": "Teapot",
      "paragraph": "The little old ladies having a tea party in a סוכה ישנה who proudly reminded each other not to get hana'ah from its sanctified walls, had no idea they were sitting under a tree, and that their succah was under a succah as well."
    }
  },
  {
    "daf": 10,
    "data": [
      {
        "id": 0,
        "title": "How much space between the upper and lower succahs passuls the lower succah?",
        "paragraph": "Continuing with the sugya of סוכה על גבי סוכה, the Gemara asks how much space there must be between the s’chach layers of the lower succah and the upper succah, for the lower succah to be invalid. Rashi explains the question, that the s’chach layers have to be far enough apart to be considered two succahs, rather than one big succah.▪ Rav Huna said that the lower succah is passul if there is at least a tefach of space between the layers, שכן מצינו באהלי טומאה טפח – for we find in regard to roofs for tumah that their height is a tefach. Meaning, to qualify as an ohel, the overhang must be at least a tefach in each direction and positioned at least one tefach above the surface beneath it. Just as we find the measurement of one tefach above the surface in regard to tumah, so too here, the two layers of s'chach need to be separated by a tefach in order to be considered two succahs .▪ Rav Chisda and Rabbah bar Rav Huna said four tefachim of space שלא מצינו מקום חשוב פחות מארבעה – for we do not find a significant area of less than four tefachim. To be considered a reshus hayachid or a karmelis, an area must be at least four tefachim wide. Less than that, it is a makom petur.▪ Shmuel said ten tefachim כהשכרה כך פסולה – Just as the succah’s validation is dependent on it being ten tefachim, so too is its ability to cause a pesul is dependent on it being ten tefachim high. Rashi explains this to mean, that if the above sukkah is not ten tefachim high, it is not a kosher sukkah, and therefore it will not passul the bottom sukkah."
      },
      {
        "id": 1,
        "title": "נויי סוכה",
        "paragraph": "The next Mishnah states that if one spread a sheet over the s’chach because of the sun, or beneath it because of falling leaves, the succah is passul. In the Gemara, Rav Chisda said אבל לנאותה כשרה – but where it is spread to decorate the succah, the succah is valid. Rashi explains that a sheet spread for decorative purposes does not earn a s’chach designation, and therefore it will not invalidate the succah. The Gemara brings a machlokes Amoraim regarding נויי סוכה המופלגין ממנה ארבעה – succah decorations spread out beneath the s’chach, that are removed from the s’chach by four tefachim. Rav Nachman says that the succah is kosher, and Rav Chisda and Rabba bar Rav Huna hold that it is passul. Rashi explains that Rav Chisda and Rabba bar Rav Huna hold that any decoration four tefachim away from the s’chach, is viewed as independent of the s’chach above it, and therefore the person sleeping inside the sukkah is considered beneath a tent formed by the sheet, and not in the succah proper. Rav Nachman holds that since the sheets are hung for the purpose of decorating the sukkah, they are batel to the sukkah."
      },
      {
        "id": 2,
        "title": "מותר לישן בכילה בסוכה",
        "paragraph": "Rav Yehudah said in the name of Shmuel, מותר לישן בכילה בסוכה אף על פי שיש לה גג והוא שאינה גבוהה עשרה – One may sleep under a kilah-canopy spread around a bed in a succah, even though it has a flat roof, provided that  it is not ten tefachim high off the surface of the bed. Rav Tachlifa bar Avimi said in the name of Shmuel, הישן בכילה ערום מוציא ראשו חוץ לכילה וקורא קריאת שמע – One who sleeps naked within a kilah-canopy may poke his head outside the canopy and recite the Shema. Rashi explains that if the canopy was deemed an ohel and a self-defined area, then the person’s head would be in the area where the majority of his body is located, and he would not be permitted to recite the Shema while naked. Shmuel is coming to teach, that since this canopy is not deemed a tent, since it is lower than ten tefachim, it is seen as a mere covering of his body, like a garment, and therefore he may stick his head outside the canopy and recite the Shema."
      }
    ],
    "siman": {
      "title": "Minyan of Yidden",
      "paragraph": "The Minyan of Yidden planning to daven in the lower succah that was separated from the upper succah by a less than a tefach, were busy hanging decorative sheets four tefachim below the s’chach and installing nine tefachim kilah-canopy beds for reciting the Shema."
    }
  },
  {
    "daf": 11,
    "data": [
      {
        "id": 0,
        "title": "Question if קציצתן זו היא עשייתן and its application to tzitzis",
        "paragraph": "The next Mishnah states: הדלה עליה את הגפן ואת הדלעת ואת הקיסוס וסיכך על גבה פסולה – If one lifted on to the succah, a grapevine, or a gourd, or ivy, and covered it with valid s’chach, the succah is passul. ואם היה סיכוך הרבה מהן או שקצצן כשרה – But if there was more valid s’chach than them, or if he detached the vines from the ground, the succah is kosher. Rav Yosef said that Rav holds that after one detached the vines, צריך לנענע – he still must shake them, meaning lift them up and put them back down again, to make the succah kosher. This is based on the Torah’s command of \"הסכת תעשה\" – תעשה ולא מן העשוי – You shall make succos, meaning you shall make, and not use that which was made when it was passul. Rav Huna said to Rav Yosef that Shmuel was the one who held this ruling, and that Rav held that just cutting the vines would validate the succah, for once there was a case when one placed tzitzis on his family’s cloak but hung and knotted them without first severing their tips, so that the tzitzis were made in an invalid manner. He was told in the name of Rav, מפסקן והן כשרין – sever the tips and they are valid. אלמא פסיקתן זו היא עשייתן – We see from here that Rav maintains that severing is their making. So too regarding their vines, קציצתן זו היא עשייתן – detaching is their making. The Gemara brings a Baraisa that refutes Rav’s opinion and rules that these tzitzis would be passul."
      },
      {
        "id": 1,
        "title": "Does the machlokes of קציצתן זו היא עשייתן apply to cutting off berries from hadasim?",
        "paragraph": "The Gemara suggests that there is a machlokes Tannaim whether cutting an object represents an act of “making”, in the case of one who plucked the berries off hadasim because they outnumbered its leaves and made it passul. If one did this on Yom Tov, Rebbe Shimon ben Yehotzadak says that the hadasim are passul, and the Chochomim say that they are kosher. Now it was assumed that they agree that לולב צריך אגד – a lulav requires bundling of the dalet minim together, and that the mitzvah of lulav is learned from the halachos of succah, and requires תעשה ולא מן העשוי, and therefore a lulav must be valid at the time that it is bound. Therefore, the machlokes is between the Chochomim, who hold that with regard to a lulav לקיטתן זו היא עשייתן – plucking the berries is their “making,” and Rebbe Shimon ben Yehotzadak holds that plucking is not considered a “making.” The Gemara deflects this pshat and says that their machlokes is whether lulav is learned from succah and requires תעשה ולא מן העשוי. According to the Chochomim, it is not learnt from succah, and therefore, even though the mitzvah of lulav requires איגוד, the dalet minim do not need to be kosher at the time of bundling. Rebbe Shimon ben Yehotzadak holds that lulav does require תעשה ולא מן העשוי and therefore the dalet minim do need to be kosher at the time of bundling. The Gemara brings an alternative answer as well."
      },
      {
        "id": 2,
        "title": "The sources for וכל דבר שאינו מקבל טומאה וגידולו מן הארץ מסככין בו",
        "paragraph": "The Mishnah stated: זה הכלל כל שהוא מקבל טומאה ואין גידולו מן הארץ אין מסככין בו – This is the rule: We may not use as s’chach, whatever is mekabel tumah and whatever does not grow from the ground. The Gemara asks for the source for this ruling, and Reish Lakish, who holds that we dwell in succos to remind us of the ענני הכבוד, says that the passuk states, \"ואד יעלה מן הארץ\" – And a mist ascended from the earth. We learn from this, that just as mist (i.e. a cloud) is a דבר שאינו מקבל טומאה וגידולו מן הארץ, so too the s’chach of a succah (which is meant to remind us of clouds) must be דבר שאינו מקבל טומאה וגידולו מן הארץ. The Gemara notes that this source is sufficient for Rebbe Eliezer, who holds ענני כבוד היו, but what would be the source for Rebbe Akiva, who holds סוכות ממש עשו להם – the Jews made for themselves actual succos? On Daf 12a Ravin says in the name of Rebbe Yochanan that the passuk states, \"באספך מגרנך ומיקבך\" – with your gathering from your threshing floor and from your wine vat. בפסולת גורן ויקב הכתוב מדבר – Here, when alluding to the succah, the Torah speaks of their refuse, which are not mekabel  tumah and grow from the ground."
      }
    ],
    "siman": {
      "title": "Stars (Eleven stars in Yosef’s dream)",
      "paragraph": "The bochur who used a cutting utensil shaped like a star to detach vines on the s’chach that were tangled in his tzitzis, lent one to his friend to pluck berries from his hadasim who was standing in the mist."
    }
  },
  {
    "daf": 12,
    "data": [
      {
        "id": 0,
        "title": "חבילי קש והחוטט בגדיש",
        "paragraph": "The next Mishnah states, חבילי קש וחבילי עצים וחבילי זרדין אין מסככין בהן – Bundles of straw, bundles of wood and bundles of cane, may not be used for s’chach while they are bound together. וכולן שהתירן כשרות – But once he untied them, they are valid for s’chach. Rebbe Yaakov said that he heard two explanations from Rebbe Yochanan for two Mishnayos, but he could not remember which explanation goes with which Mishnah. One Mishnah, is this one, regarding tied bundles, and the other Mishnah, teaches: החוטט בגדיש לעשות לו סוכה אינה סוכה – If one hollows out a haystack to make a succah, it is not a succah .Rebbe Yirmiyah clarifies, based on a statement said in the name of Rebbe Yochanan, that the reason why the tied bundles may not be used for s’chach is משום גזירת אוצר – because of a Rabbinic decree against the use of a storage house. There are times when a person returns from the field in the evening, with his bundle on his shoulder, and he places it on top of his hut to dry it, and later, when succos arrives, he changes his mind and decides to use it as s’chach. Since this s’chach is invalid because of תעשה ולא מן העשוי, the Rabbanon wanted to prevent people from using such s’chach, and they therefore prohibited using bundles of any kind, even those placed on the succah to provide shade. The explanation for why the hollowed-out haystack is passul, is because of the d’Oraysa of תעשה ולא מן העשוי."
      },
      {
        "id": 1,
        "title": "סככה בחיצין זכרים כשרה בנקבות פסולה",
        "paragraph": "Rav Yehudah said in the name of Rav: סככה בחיצין זכרים כשרה בנקבות פסולה – If one covered a succah with “male” arrow-shafts, it is kosher, but if he covered it with “female” arrow-shafts, it is passul. A male arrow-shaft has a solid tip that is inserted into the arrowhead, whereas the female arrow-shaft has a cavity in which the arrow-head is inserted. Rashi explains that even though both are considered keilim, the male arrow-shaft is not mekabel tumah because it is made from wood and has no בית קיבול – receptacle. Flat wooden keilim are not mekabel tumah and therefore can be used as s’chach. Female arrow-shafts have a cavity and therefore are mekabel tumah, and therefore cannot be used as s’chach. Even though these halachos are obvious, the Gemara explains that with the first halacha , of סככה בחיצין זכרים כשרה, Rav was coming to teach that we are not gozeir against male shafts because of female shafts. And with the second halacha, of בנקבות פסולה, he was coming to clarify that one might have said בית קיבול העשוי למלאות לא שמיה קיבול – a receptacle made to be filled permanently, is not considered a receptacle, and since the female arrow-shaft is to be filled permanently, it should not be considered a receptacle and therefore is not mekabel tumah. Therefore, Rav teaches that it is considered a receptacle and cannot be used as s’chach."
      },
      {
        "id": 2,
        "title": "Using ferns and artemisia herbs for s’chach",
        "paragraph": "Rav Yehudah said: הני שושי ושווצרי מסככין בהו – One may use ferns and artemisia herbs for s’chach. Rashi explains that while foods are mekabel tumah and not fit for s’chach, these herbs are not fit for consumption and are therefore not mekabel tumah. Abaye said that one may use ferns for s’chach but not artemisia herbs, כיון דסרי ריחייהו שביק להו ונפיק – since their odor is offensive, one will abandon the succah and leave."
      }
    ],
    "siman": {
      "title": "Twelve brothers",
      "paragraph": "Six brothers quickly brought bundles of straw from the field to store and then hid in a hollowed-out haystack, after they pranked their other six brother’s succah with s’chach made of female arrow-shafts and plenty of smelly herbs."
    }
  },
  {
    "daf": 13,
    "data": [
      {
        "id": 0,
        "title": "אגד בידי שמים לא שמיה אגד",
        "paragraph": "The Mishnah on Daf 12a taught that one may not use even kosher s’chach, if it is tied into bundles. On our Daf, Rav Gidel said in the name of Rav, האי אפקותא דדיקלא מסככין בהו – One may use the offshoots of the date-palm for s’chach אף על גב דאגידי – although they are bound together at their base and resemble a bundle, אגד בידי שמים לא שמיה אגד – a natural bundle  (literally - “a bundle made by Heaven”) is not deemed an “אגד”. Rashi explains that the cluster of stalks growing out of the stump, resemble branches tied together at their base. It might have been thought that such a cluster should be passul for use as s’chach due to its similarity to the case of the bundles in the Mishnah. Rav Gidel continues, that even if one would bind the offshoots together, which Rashi explains is done to make these offshoots lay flat and smooth in a way that they cover the top of the succah and provide shade, it is still not deemed an אגד, because איגד בחד לא שמיה אגד – a binding of a single object is not deemed an אגד. The Gemara will discuss whether a bundle of two is deemed an אגד."
      },
      {
        "id": 1,
        "title": "When bird hunter huts are kosher for s’chach",
        "paragraph": "Rebbe Abba said הני צריפי דאורבני כיון שהותרה ראשי מעדנים שלהן כשרין – These huts made of aravos, once their upper knots are undone, they are kosher to be used as s’chach. Rashi explains that bird hunters would make small conical huts in which to lie in wait for their prey . Long pliable aravos were arranged upright in a wide circle, with their bottoms braided together with a rope to hold them in place. Their tops would then be bent towards the center of the circle and tied together. Once the binding that holds the upper ends of the branches is untied, they may be used as s’chach. When the Gemara asks why they are kosher, since they are still bound together below, Rav Pappa answered that we are discussing a case where he untied the rope holding them together below but left the braid intact. Rebbe Abba is teaching that even though the braiding is in place, the branches may be used as s’chach. Rav Huna brei d’Rav Yehoshua answered, that you can even say that he did not untie the bottom knot. The reason they are kosher for s’chach is because אגד שאינו עשוי לטלטלו לא שמיה אגד – any אגד that is not made in a manner that allows it to be carried, is not deemed an אגד, and is therefore fit for s’chach. Rashi explains that the branches would slip out of the braid once it is carried."
      },
      {
        "id": 2,
        "title": "Marror vegetables cannot be used as s’chach",
        "paragraph": "Rebbe Abba said in the name of Shmuel, ירקות שאמרו חכמים אדם יוצא בהן ידי חובתו בפסח – The vegetables which the Chochomim said that one may be yotzei his chiyuv of marror with them on Pesach, מביאין את הטומאה – can act as an ohel to make something tamei. Rashi explains that even though their leaves are flimsy, as long as they are fresh and moist and have enough substance to act as an ohel, they can bring the tumah to an object that is underneath it. ואין חוצצין בפני הטומאה ופוסלין בסוכה משום אויר - But they do not act as a chatzitzah against tumah, and they possel the succah when used as s’chach, as if they are open space כיון דלכי יבשי פרחי ונפלי כמאן דליתנהו דמי  – since when they dry up, they crumble and fall down, and cease to form a roof, it is as though they are not here even before they dry up."
      }
    ],
    "siman": {
      "title": "Bar Mitzvah Boy",
      "paragraph": "The guests at the succah-themed bar mitzvah party that featured bound date-palm stumps as center pieces, listened attentively to the bar mitzvah bachur speaking inside a conical bird hunter hut about the crumbling nature of marror leaves which make marror passul as s’chach."
    }
  },
  {
    "daf": 14,
    "data": [
      {
        "id": 0,
        "title": "למה נמשלה תפלתן של צדיקין כעתר",
        "paragraph": "Rebbe Elazar said: למה נמשלה תפלתן של צדיקים כעתר – Why are the tefillos of tzadikim compared to a pitchfork? Rashi explains that the Torah uses the word ויעתר to describe Yitzchak’s entreaties to Hashem regarding Rivkah’s barreness, as it says in the passuk, ויעתר יצחק לה' ...ויעתר לו ה' – Yitzchak entreated Hashem…Hashem allowed Himself to be entreated. To tell you, מה עתר זה מהפך את התבואה בגורן ממקום למקום אף תפלתן של צדיקים מהפכת דעתו של הקדוש ברוך הוא ממדת אכזריות למדת רחמנות – just as the pitchfork turns over the grain that is on a threshing floor, and tosses it from one place to another, so too the tefillos of tzadikim turn over, so to speak, the attitude of HaKadosh Baruch Hu from the Attribute of Harsh Judgment to the Attribute of Mercy."
      },
      {
        "id": 1,
        "title": "מסככין בנסרים",
        "paragraph": "The next Mishnah states, מסככין בנסרים דברי רבי יהודה ורבי מאיר אוסר – Rebbe Yehudah says we may cover a succah with boards, but Rebbe Meir prohibits them. Rav says that the machlokes is with boards that have a width of at least four tefachim דרבי מאיר אית ליה גזרת תקרה – for Rebbe Meir subscribes to the Rabbinic decree prohibiting boards that resemble those of the roof of a house. Rashi explains that the Rabbanon were concerned that if such boards were fit for s’chach, people might think that they can fulfill their chiyuv by staying under the roof of a house, and the Torah specifies that a succah needs to be a dwelling place which provides shade from the sun, not a house, which someone lives in all year round. Rebbe Yehudah does not hold of גזרת תקרה and therefore permits such boards. They both agree that boards that are less than four tefachim, are kosher. Shmuel says, as explained by Rav Pappa, that everyone agrees that boards four tefachim wide are passul, and that boards less than three tefachim are kosher, קנים בעלמא נינהו – they are mere sticks. They disagree regarding boards that are between three and four tefachim wide. Rebbe Yehudah holds that since they lack the size of a significant area, we are not gozeir that they are passul, while Rebbe Meir holds that since they are beyond the scope of lavud we are gozeir that they are passul."
      },
      {
        "id": 2,
        "title": "הפכן על צידיהן",
        "paragraph": "It was stated, הפכן על צידיהן – If one turned the boards on their sides, and covered the succah with them, Rav Huna says that they are passul, but Rav Chisda and Rabbah bar Rav Huna say that it is kosher. Rashi explains that Rav Chisda and Rabbah bar Rav Huna say it is kosher because the Rabbanon only prohibited boards that resemble the roof of a house, which is not the case here. When Rav Nachman visited Sura, Rav Chisda and Rabbah bar Rav Huna asked him what the halachah is and he told them that they are passul. נעשו כשפודין של מתכת – Such boards are treated like metal spits, which are passul for s’chach because they do not grow from the ground and also because they are keilim which are mekabel tumah . Rav Huna was upset with them for asking Rav Nachman since he had told them that Rav Nachman agreed with him, and if they had wanted to know the reason, they should have asked Rav Huna directly."
      }
    ],
    "siman": {
      "title": "Hand (Juggler)",
      "paragraph": "The juggler juggling pitchforks as he davened, while standing on succah boards that were less than four tefachim wide, dropped one between some succah boards that were standing on their sides."
    }
  },
  {
    "daf": 15,
    "data": [
      {
        "id": 0,
        "title": "תקרה שאין עליה מעזיבה",
        "paragraph": "The next Mishnah states, תקרה שאין עליה מעזיבה – A roof of boards that has no plaster on it, Rebbe Yehuda says that Beis Shammai and Beis Hillel disagree over what must be done to it to render it kosher as s’chach. Beis Shammai says מפקפק ונוטל אחת מבינתים – one loosens the boards and takes out one board from between every two boards. Rashi explains that מפקפק means that he loosens the boards and shakes them, which is the equivalent of a new installation. This resolves the problem of תעשה ולא מן העשוי. He then fills the spaces with valid s’chach. The Gemara clarifies that according to Beis Shammai, beams cannot be used as s’chach משום גזרת תקרה – because of a Rabbinic gezeirah against using boards that resemble a roof. Beis Hillel say, מפקפק או נוטל אחת מבינתים – one loosens them, or takes one board from between every two boards. Beis Hillel does not hold of גזירת תקרה and therefore only one of the two methods is necessary to overcome the problem that they were originally placed there for a house. Rebbe Meir says,  .נוטל אחת מבינתים ואינו מפקפקRebbe Meir holds that four tefachim boards are passul for s’chach and need to be replaced with kosher s’chach. Once that is done, no other action is necessary."
      },
      {
        "id": 1,
        "title": "המקרה סוכתו בשפודין או בארוכות המטה",
        "paragraph": "The next Mishnah states, המקרה סוכתו בשפודין או בארוכות המטה – One who makes a roof over his succah with spits, or with the sides of a bed, אם יש ריוח ביניהן כמותן כשרה – if there is space between them as wide as the items themselves, and he fills the gaps with kosher s’chach, the succah is kosher. The Gemara asks that the Mishnah is not in accordance with Rav Huna brei d’Rav Yehoshua, who holds פרוץ כעומד אסור – if the gaps in a partition equal the walled portion, it is forbidden to carry there, because we require that a majority of the partition be solid. It answers that Rav Huna would say that the Mishnah means a case of בנכנס ויוצא –where a spit would go in and out of each gap easily, meaning the gaps are wider than the spits. Therefore, when the gaps are filled with kosher s’chach, they will comprise the majority of the succah.Rava answers, that the Mishnah can even be a case where the gaps were not enlarged slightly more than the width of the spits. Rather, אם היו נתונים שתי נותנן ערב – if the spits were placed lengthwise, then he places the valid s’chach crosswise across the top of the spits, and if he placed the spits crosswise, he would place the valid s’chach lengthwise. In these cases, the valid s’chach will exceed the passul spits."
      },
      {
        "id": 2,
        "title": "סככה בבלאי כלים פסולה",
        "paragraph": "The Mishnah stated that the ארוכות המטה – the sides of a bed, are not valid as s’chach. The Gemara suggests that this supports the opinion of Rebbe Ami bar Tavyomei, who said, סככה בבלאי כלים פסולה – If one covered his succah with worn-out pieces of clothing, the succah is pasul. Although these pieces of fabric are no longer keilim, and should therefore be kosher, the Rabbanon were gozeir that since they were originally part of keilim that were mekabel tumah, they cannot be used as s’chach. The Gemara deflects this proof, for just as Rebbe Chanin said in the name of Rebbe, that a Mishnah in Keilim was referring to the long side of a bed with two short legs, or a short side with two legs, so too here, the Mishnah is dealing with the same case. Therefore, these sides of the bed are deemed keilim and are thus passul for s’chach."
      }
    ],
    "siman": {
      "title": "Fruit Bowl (Related to Tu b’Shevat)",
      "paragraph": "The fruit bowl display in the succah came crashing down when one bochur loosening the boards on top started shaking them, as another one knocked some over while inserting metal spits and tossing over some old clothes as s'chach."
    }
  },
  {
    "daf": 16,
    "data": [
      {
        "id": 0,
        "title": "החוטט בגדיש אם יש שם חלל טפח במשך שבעה",
        "paragraph": "The Mishnah on Daf 15a stated, החוטט בגדיש לעשות לו סוכה אינה סוכה – If one hollowed out a haystack to make a succah, the succah is passul. On our Daf, Rav Huna says: לא שנו אלא שאין שם חלל טפח במשך שבעה – They taught this halachah only regarding a case where there was no cavity inside the haystack one tefach high, for a length of seven tefachim. If there was a cavity one tefach high, for a length of seven tefachim, then it is a kosher succah. Rashi explains that for the straw to meet the definition of s’chach, it would have to cover an empty space of at least one tefach high, for that is the minimum height of an ohel. Therefore, if it is also has a length of seven tefachim, It would meet the requirement of kosher s’chach, and there would not be an issue of תעשה ולא מן העשוי. Although the cavity needs to be hollowed out further to a height of ten tefachim, that is necessary only in order that to make the walls kosher, and the requirement of תעשה ולא מן העשוי does not apply to succah walls."
      },
      {
        "id": 1,
        "title": "מחיצה תלויה מתרת",
        "paragraph": "In the next Mishnah, Rebbe Yose disagrees with the Tanna Kamma who holds that if one constructs succah walls from the top down, then if a wall is three tefachim above the ground, it is passul. Rebbe Yose says: כשם שמלמטה למעלה עשרה טפחים כך מלמעלה למטה עשרה טפחים – Just as a wall built from the bottom up, is kosher if it is ten tefachim, so too a wall built from the top down, is kosher. provided it is ten tefachim high, regardless of the gap between it and the ground. The Gemara explains that Rebbe Yose maintains thatמחיצה תלויה מתרת  – a suspended partition is a kosher mechitzah. The Gemara brings a Mishnah from Eruvin, where Rebbe Yehudah rules that in a case of a cistern between two chatzeiros, the wall running over the cistern should act as a mechitzah to legally divide the water, even if it does not enter the cistern’s cavity. Rabbah bar bar Chanah said in the name of Rebbe Yochanan that Rebbe Yehudah’s ruling is in accordance with the opinion of Rebbe Yose who holds, מחיצה תלויה מתרת in the case of the succah walls, and so too here, the wall going over the cistern, which is a מחיצה תלויה, is considered a full wall. The Gemara rejects this suggestion, pointing out that perhaps Rebbe Yehudah would only apply the principle to a d’Rabbanon, such as eruvin, but not to a d’Oraysa, such as a succah, and perhaps Rebbe Yose would only apply it to a succah, which is an איסור עשה, but not to a matter of Shabbos, which is an איסור סקילה."
      },
      {
        "id": 2,
        "title": "Lavud can be applied twice to the same mechitzah",
        "paragraph": "Rav Chisda said in the name of Avimi: מחצלת ארבעה ומשהו מתרת בסוכה משום דופן – A mat whose width is four tefachim and a bit, is a kosher wall for a succah. What does one do to render it a kosher wall? One suspends it midway between the s’chach and the ground, with a gap of less than three tefachim below it, and a gap of less than three tefachim above it, וכל פחות משלשה כלבוד דמי – And it is a kosher wall because any gap less than three tefachim wide, is treated as though it were closed, based on lavud. The Gemara explains that one might have thought, חד לבוד אמרינן תרי לבוד לא אמרינן קא משמע לן – that we apply the law of lavud to extend a mechitzah once, but not to apply lavud to extend it twice. Rav Chisda therefore teaches that we apply lavud twice to the same mechitzah."
      }
    ],
    "siman": {
      "title": "Toes",
      "paragraph": "The acrobat who did continuous backflips using his toes to hollow out a haystack that had a cavity one tefach high, landed with one foot under a מחיצה תלויה and the other under a suspended mat that was four tefachim and a bit in size."
    }
  },
  {
    "daf": 17,
    "data": [
      {
        "id": 0,
        "title": "אויר פוסל בשלשה סכך פסול פוסל בארבעה",
        "paragraph": "The next Mishnah states, הרחיק את הסיכוך מן הדפנות שלשה טפחים פסולה – If one distanced the s’chach three tefachim from one of the walls, leaving three tefachim of open space between it and the wall, the succah is passul. Rashi explains that the entire succah is passul because it is viewed as lacking a wall, on account of the gap. Rabbah said he once found the talmidim of Rav saying in the name of Rav אויר פוסל בשלשה סכך פסול פוסל בארבעה – A strip of open airspace is posel a succah when it is three tefachim wide, and a strip of invalid s’chach posels a succah when it is four tefachim wide. Rabbah challenged their ruling that passul s’chach invalidates if it is four tefachim wide, citing the same Mishnah, which also teaches בית שנפחת וסיכך על גביו – If the roof of a house was breached in the center and one placed s’chach on top of it, if there is a distance of four amos between the wall of the house and the s’chach, the succah is passul. This implies that if a gap narrower than four amos does not disqualify? The talmidim answered Rabbah, that this case is not relevant, as both Rav and Shmuel said that this ruling was based on the halachah of דופן עקומה, in which less than four amos of invalid s’chach can be viewed as part of a bent wall. Their ruling of four tefachim concerns passul s’chach in the middle of the succah."
      },
      {
        "id": 1,
        "title": "Rabbah’s challenge to the talmidim and their response",
        "paragraph": "Rabbah posed another challenge to the talmidim. The halachah is that if there is a strip of passul s’chach less than four tefachim wide, in the middle of the succah, and next to it there is a strip of open space less than three tefachim wide, the succah is kosher because there is not enough passul s’chach to invalidate it. Yet if one filled the open space with spits or other passul s’chach, the succah is passul because the width of the invalid material is now at least four tefachim .  ולא יהא אויר הפוסל בשלשה כסכך פסול הפוסל בארבעה – But should not  open space, which disqualifies a succah when just three tefachim wide, be as potent as passul s’chach, which disqualifies a succah when four tefachim wide? Since filling the gap with spits invalidates the succah, then leaving it empty should certainly invalidate it, for empty space is a more potent disqualifier than solid material. How, then, can they rule that when the gap is empty, it does not combine with the solid material to invalidate the succah? The talmidim responded that if the question is valid, then Rabbah would have the same challenge in a case of a strip of invalid s’chach less than four amos wide in the middle of a succah, next to an open space of less than three amos wide ."
      },
      {
        "id": 2,
        "title": "Rabbah’s response that the cases cannot be compared",
        "paragraph": "Rabbah responded to the challenge, by saying that there is no comparison. According to him, the Mishnah’s rule that four amos of passul s’chach invalidates the succah, is not based on דופן עקומה but is a Halachah LeMoshe MiSinai shiur that disqualifies a succah, whether the material is at the side of the succah or in the middle. And this strip of invalid material, which measures four amos wide only when it combines with open space, does not have the shiur to disqualify a succah, for since the shiurim for the invalid s’chach and open space are not equal, לא מצטרפי – they do not combine to make up the requisite minimum. But according to the talmidim, who state a shiur of four tefachim based on original reasoning that measurement is only significant משום הפלגה – because of a gap, they must therefore explain what difference it makes whether the separation is made through invalid s’chach alone or through a combination of invalid s’chach and open space."
      }
    ],
    "siman": {
      "title": "Used Car Salesman",
      "paragraph": "The used car salesman who sold used succos on the side with plenty of airspace and passul s’chach, tried to convince the shopper not to take the one with airspace next to less than four tefachim of fabric, but to buy the luxury Halacha Le Moshe MiSinai one with almost four amos of fabric instead since it doesn’t combine."
    }
  },
  {
    "daf": 18,
    "data": [
      {
        "id": 0,
        "title": " אויר שלשה בסוכה גדולה ובסוכה קטנה",
        "paragraph": "Abaye said: אויר שלשה בסוכה גדולה – If there is open space of three tefachim in the s’chach of a large succah, ומיעטו בין בקנים בין בשפודים – and he reduced it, either with sticks (which are valid as s’chach) or with spits (which are passul)הוי מיעוט  - it is an effective reduction, meaning the gap now lacks the width of three tefachim necessary to passul the succah. בסוכה קטנה – However. in a small succah, which is only seven by seven tefachim, if he reduced it with sticks it is effective, but if he reduced it with spits it is not effective. Rashi explains that sticks are effective in reducing the gap via lavud. The spits are not effective since the open space and spits together form a gap in the s’chach of three tefachim, they are significant enough to be regarded as separate from the s’chach, and the valid s’chach lacks the requisite dimensions of seven-by-seven tefachim."
      },
      {
        "id": 1,
        "title": "לבוד מן הצד ומן האמצע",
        "paragraph": "The Gemara qualifies that a gap of less than three tefachim wide does not passul a succah מן הצד – if the gap is at the side, between the s’chach and a wall. But with regard to a gap in the middle of the succah, Rav Acha and Ravina disagree. One says יש לבוד באמצע – the principle of lavud applies even in the middle, and one says, אין לבוד באמצע – lavud does not apply in the middle. The one who holds יש לבוד באמצע learns it from a case taught in a Baraisa regarding a mavoi where two korahs project from opposite walls but do not touch each other, leaving a gap in the middle. If the gap is less than three tefachim, it is not necessary to bring another korah, due to lavud. The other opinion, who holds that lavud only applies at the side, would answer שאני קורות דרבנן – the law of korahs is different since it is only a d’Rabbanon.The one who holds אין לבוד באמצע, learns it from a Mishnah in Ohalos, where a source of tumah is opposite an ארובה – a skylight that does not have an opening of a tefach, and the din is כל הבית כולו טהור – the whole house is tahor. This Mishnah treats the skylight as an open gap in the roof, even though it is less than three tefachim wide. The other opinion who holds יש לבוד באמצע, would answer, שאני הלכות טומאה דהכי גמירי להו – the laws of tumah are different, for this is how they were taught at Sinai. It is a Halachah LeMoshe MiSinai regarding tumah, that lavud only applies to walls. This law cannot be automatically extended to other halachos, such as succah."
      },
      {
        "id": 2,
        "title": "פי תקרה יורד וסותם מחלוקת אם אמרינן",
        "paragraph": "It was stated:כשרה  סיכך על גבי אכסדרה שיש לה פצימין – If one placed s’chach on a porch that has columns in front of it, positioned at intervals of less than three tefachim, the succah is kosher. שאין לה פצימין – If it does not have such columns, Abaye says that it is kosher and Rava says that it is passul. Abaye says the succah is kosher אמרינן פי תקרה יורד וסותם – because we say that “the edge of the roof extends downward and seals,” meaning the edge of each porch roof is viewed as extending downward to form the succah’s requisite partitions. Rava says that the succah is passul לא אמרינן פי תקרה יורד וסותם. Rava challenged Abaye and said that according to Abaye, אפילו הפחית דופן אמצעי – even if the middle wall of a three walled succah collapsed, the succah should still be kosher, because the edge of the s’chach is יורד וסותם – descends and seals to replace the collapsed wall. Abaye said that he concedes that the succah is passul in that case, דהוה ליה כמבוי מפולש – because it is like an open alleyway."
      }
    ],
    "siman": {
      "title": "Chuppah (בן י'ח לחופה)",
      "paragraph": "When the chosson, who proudly designed his chuppah as a large sukkah with 3 tefachim of open space closed in a bit with spits, was challenged by his father-in-law whether lavud applied in the center, the kallah ran out embarrassed and hid on the porch covered in s’chach that had no columns."
    }
  },
  {
    "daf": 19,
    "data": [
      {
        "id": 0,
        "title": "פסל היוצא מן הסוכה נידון כסוכה",
        "paragraph": "A Tanna taught: פסל היוצא מן הסוכה נידון כסוכה  –  Pesal, referring to s’chach that sticks out of the succah, is treated like a succah. The Gemara provides four interpretations for what this is referring to.· Ullah said: קנים היצאים לאחורי סוכה – This refers to sticks of s’chach that extend behind the succah. After the Gemara clarifies that the case is where there are three walls around the protruding side, it has the minimum shiur of a succah, and the shade is greater than the sunlight, the Gemara says that the purpose of teaching this is that one might have thought הואיל ולגוואי עבידי ולבראי לא עבידי – since it walls were initially for the interior of the main succah and were not made for the extension, which is outside, one could argue that the extension does not have valid walls. The Baraisa is coming to teach us that it is valid.· Rabbah and Rav Yosef both said that we are dealing with sticks of s’chach that protrude in front of the succah and one wall extends along with them. You might have said הא לית ליה הכשר סוכה – that it does not have the requirements of a valid succah. The Baraisa is teaching us that it is valid since the protruding section is not regarded as separate from the succah. Two more interpretations are given."
      },
      {
        "id": 1,
        "title": "העושה סוכתו כמין צריף או שסמכה לכותל",
        "paragraph": "The next Mishnah states: העושה סוכתו כמין צריף – If one makes his succah like a conical hut, או שסמכה לכותל – or he leaned it against a wall, Rebbe Eliezer rules in either case that it is pasul because it has no roof. The Chochomim rule that it is kosher. It was taught in a Baraisa that Rebbe Eliezer agrees that if he raised the succah that leaned against a wall, a tefach off the ground, or distanced it a tefach from the wall and supported it with pegs, that it is kosher. Rashi explains that the rule of lavud allows us to view the gap as a solid horizontal surface fit to serve as part of the succah’s roof. The horizontal tefach-wide gap is adequate even though it does not have the dimensions of s’chach and is even comprised of materials that are not valid for s’chach. As long as the succah appears to have a roof, a portion of the sloping surface, which is comprised of valid material, can be combined with the gap to form the s’chach. The Chochomim permit the two cases in the Mishnah because they hold, שיפוע אהלים כאהלים דמו – that sloping roofs are regarded as roofs, meaning they have the status of horizontal surfaces."
      },
      {
        "id": 2,
        "title": "מחצלת",
        "paragraph": "The next Mishnah states: מחצלת קנים גדולה – The halachah of a large reed mat is as follows: עשאה לשכיבה מקבלת טומאה ואין מסככין בה – If one made it for reclining purposes, it is mekabel tumah and cannot be used as s’chach. But if he made it for covering a succah, he may cover a succah with it and it is not mekabel tumah. Rebbe Eliezer says that whether the mat is small or large, if he made it for  שכיבה it is mekabel tumah and we may not cover a succah with it, but if he made it for covering a succah, we may use it as a cover and it is not mekabel tumah. Rashi points out the Rebbe Eliezer’s opinion is more compelling since the explicit designation of the one who produced the mat should determine its status, regardless of its size. The Gemara will go through an extensive analysis of their machlokes."
      }
    ],
    "siman": {
      "title": "Yacht",
      "paragraph": "The adults on the Chol HaMoed Yacht trip enjoyed sitting on deck in the shade under the pesal that protruded outside the succahs while the kids playing hide-and-go seek hid in the succah that leaned against the wall and in another one that had small reed mats that were typically for reclining."
    }
  },
  {
    "daf": 20,
    "data": [
      {
        "id": 0,
        "title": "חוצלות",
        "paragraph": "The Gemara brings a Mishnah in Eduyos that taught: כל החוצלות מטמאין טמא מת דברי רבי דוסא – Rebbe Dosa says that all chotzalos are mekabel tumas meis, and the Chochomim say, they are mekabel tumas midras. Rashi explains that the Chochomim hold that chotzalos are used for reclining and are therefore mekabel tumas midras, whereas Rebbe Dosa holds that they are not made for reclining and therefore are not mekabel tumas midras. When The Gemara questions this since it implies that the Chochomim hold that they are not mekabel tumas meis, and it was learned in a Mishnah, כל המטמא מדרס מטמא טמא מת – Anything that is subject to tumas midras is necessarily subject to tumas meis as well the Gemara says the Chochomim are actually saying that chotzalos are also subject to tumas midras. Rav Avdimi bar Hamduri said that chotzalos are marzovlei, which Rebbe Abba defines as מזבלי – leather bags. Rashi explains that shepherds use them for pillows when they lay down to rest. Rebbe Dosa holds that since this are not their primary use, and shepherds are not encouraged to lie down on the job, they are not mekabel tumas midras. Reish Lakish says they are מחצלות ממש – real mats."
      },
      {
        "id": 1,
        "title": "הריני כפרת רבי חייא ובניו",
        "paragraph": "The Gemara notes that Reish Lakish’s interpretation of chotzalos as real mats is consistent with his reasoning somewhere else, for he said: הריני כפרת רבי חייא ובניו – May I be an atonement for Rebbe Chiya and his sons. Rashi explains that Reish Lakish was saying that any affliction he suffers should be a kaparah for Rebbe Chiya and his sons, as this was a proper method of honoring one’s recently departed father or rebbe. Reish Lakish continues, for initially when Torah was forgotten from Yisroel, עלה עזרא מבבל ויסדה – Ezra came up from Bavel and reestablished it. When it was forgotten again, referring to Bayis Sheini during the leadership of the Ben Beseira family, Hillel HaBavli ascended to Eretz Yisroel and reestablished it. When it was forgotten again, Rebbe Chiya and his sons ascended and reestablished it. The Ritva explains that even though Torah was not forgotten then, which was during the days of Rebbe Yehudah Hanasi, we learn that even one who assures the survival of even one halachah is regarded as having established the entire Torah. And Rebbe Chiya and his sons said that Rebbe Dosa and the Chochomim are arguing over mats that most people do not designate for sitting on. Rebbe Dosa holds that they are not mekabel tumah midras and the Chochomim hold that since some people occasionally sit on them, they are mekabel tumas midras."
      },
      {
        "id": 2,
        "title": "הישן תחת המטה",
        "paragraph": "The opening Mishnah of the second perek states: הישן תחת המטה בסוכה לא יצא ידי חובתו – One who sleeps under the bed in a succah, has not fulfilled his chiyuv to dwell in a succah. Rashi explains that the bed serves as an independent ohel and is a barrier between him and the succah, and the ikar dwelling in the succah is eating, drinking, and sleeping there. Rebbe Yehudah said: It was our practice that we would sleep under the bed in the succah in the presence of the zekeinim and they did not say a word in protest. The Gemara will explain that according to Rebbe Yehuda, the bed is considered an אהל עראי – a temporary dwelling, ולא אתי אהל עראי ומבטל אהל קבע – a temporary shelter does not supersede the permanent shelter of the succah."
      }
    ],
    "siman": {
      "title": "Café",
      "paragraph": "The Leather Bag Café, where guests occasionally sat on mats to relearn forgotten Torah from the newly arrived sages from Bavel, organized beds in their succah restaurant on Succos for really tired guests to sleep under."
    }
  },
  {
    "daf": 21,
    "data": [
      {
        "id": 0,
        "title": "רבי יהודה: כל אהל שאינו עשוי בידי אדם אינו אוהל",
        "paragraph": "On the bottom of Daf 20b the Gemara brought a Mishnah from Oholos, where Rebbe Yehudah said: כל אהל שאינו עשוי בידי אדם אינו אהל – Any ohel that is not made by man is not an ohel with regard to tumah. The Gemara asks for Rebbe Yehudah’s source, and answers that he derives a gezeirah shaveh based on the word ohel, for it is written here regarding tumah via ohel, \"זאת התורה אדם כי ימות האהל\" – This is the law regarding a man who will die in a “tent,” and it is written regarding the Mishkan, \"ויפרש את האהל על המשכן\" – And he (Moshe) spread the “tent’ over the Mishkan. Just as the ohel in the case of the Mishkan refers to an ohel made by man, so too here, in the case of tumah, the term “ohel” refers to a shelter made by man. The Rabbanon who dispute Rebbe Yehudah and rule that even a naturally formed ohel, such as one burrowed by a weasel, transmits tumah, learn from the repetitive expressions of “ohel” “ohel” written in the context of tumah, that it comes to include the law of tumah even by a naturally formed ohel."
      },
      {
        "id": 1,
        "title": "לא היו מביאין דלתות אלא שוורים",
        "paragraph": "The Gemara questions whether Rebbe Yehudah indeed holds that כל אהל שאניו עשוי בידי אדם אינו אהל, citing a Mishnah from Parah that details how children were born and raised in special courtyards in Yerushalayim, on top of the bedrock with a hollow beneath them, so that these children, protected from birth from any possible tumas meis, would be available to draw water for the sequestered Kohen Gadol, who would prepare the parah adumah. When the time came to draw water, they would bring oxen with doors on their backs and the children would ascend and sit on top of them. The door served as an ohel to block any subterranean corpse tumah from penetrating to the children sitting on top, while they travelled from the protected courtyard to the spring where the water was drawn. Rebbe Yehudah said: לא היו מביאין דלתות אלא שוורים – they would not bring doors but rather wide-bellied oxen, and it was these oxen that shielded the children from any tumah. We see from here that Rebbe Yehudah rules that the naturally formed ohel formed by the oxen’s back constitutes an ohel? When Rav Dimi came from Eretz Yisroel, he said in the name of Rebbe Elazar, מודה רבי יהודה כמלא אגרוף – Rebbe Yehudah agrees in the case of a naturally formed ohel that is as large as a fist, that it is deemed an ohel."
      },
      {
        "id": 2,
        "title": "אפילו שיחת תלמידי חכמים צריכה לימוד",
        "paragraph": "In the Mishnah, Rebbe Shimon said that there was an incident involving Tavi, Rabban Gamliel’s eved, who would sleep under a bed, and Rabban Gamliel remarked to the Zekeinim to observe that Tavi is a Talmid Chochom and knows that slaves are patur from sukkah. The Gemara brings a Baraisa, where Rebbe Shimon says משיחתו של רבן גמליאל למדנו שני דברים – From the conversation I just reported we can learn two things. We learn that slaves are patur from dwelling in a succah, and that one who sleeps under a succah has not fulfilled his chiyuv. The Gemara notes that from the fact that Rebbe Shimon used the more unusual term of משיחתו – from his casual conversation, Rebbe Shimon is teaching us the lesson that was said in the name of Rav: מנין שאפילו שיחת תלמידי חכמים צריכה לימוד – From where do we know that even the casual conversation of talmidei chochomim require study, as there are lessons to be gleaned from it? For it is stated: \"ועלהו לא יבול\" – and whose leaves do not wither. Leaves are the lightest part of the tree, representing a talmid chochom’s casual speech, and they do not wither but endure."
      }
    ],
    "siman": {
      "title": "Car (pronounced “ca” by Bostonians)",
      "paragraph": "The kids in the car taking a tour through the Tahor Safari Park who were on the lookout for naturally formed ohels burrowed by weasels, were astonished when they saw wide-bellied oxen carrying children down to a stream, being led by two talmidei chochomim involved in casual conversation."
    }
  },
  {
    "daf": 22,
    "data": [
      {
        "id": 0,
        "title": "סוכה המדובללת",
        "paragraph": "The next Mishnah states: סוכה המדובללת ושצילתה מרובה מחמתה כשרה – A succah that is meduvleless, and whose shade exceeds its light, is kosher. The Gemara asks what מדובללת means, and Rav said: סוכה ענייה – It means a meager succah – i.e. one that is covered with a thin layer of s’chach, with many gaps between the various reeds. Rashi explains that no single gap is three tefachim or wider. Shmuel said: קנה עולה וקנה יורד – The Mishnah refers to a succah whose s’chach is arranged so that one reed is up and one reed is down. That is, the s’chach is staggered so that every other reed is laid at one level, while the reeds in between are laid at a higher level. Rashi explains that because of this arrangement, the succah is more sunlit than shaded. The Mishnah is coming to teach that the succah is nonetheless kosher since the succah would be more shaded than sunlit if all the s’chach were on the same level."
      },
      {
        "id": 1,
        "title": "חבוט",
        "paragraph": "Regarding Shmuel’s understanding that the סוכה המדובללת is a succah with staggered s’chach, Abaye said that the succah is only kosher when there is not a gap of three tefachim between the upper and lower s’chach. But if there is a gap of three tefachim, the succah is passul, for the two levels of s’chach cannot be viewed as joined together. Rashi explains that the succah is passul because the sunlight of either of its two separate roofs exceeds the shade. Rava said that three tefachim of open space only passuls in a case when each of the reeds of the upper level is not a tefach wide, אבל יש בגגו טפח כשרה – but if each of the reeds of the upper level is a tefach wide is it kosher דאמרינן חבוט רמי – for we then say, “Lower and cast the upper reed upon the space below.” Chavot is a Halachah LeMoshe MiSinai that when a covering is situated directly over a gap in a roof below, the covering – no matter how high up – is viewed as if it were lowered and resting on the gap below, effectively closing it. Rava asserts that chavot applies only if the covering is at least a tefach wide, in which case the covering is wide enough to constitute an ohel in its own right."
      },
      {
        "id": 2,
        "title": "המעובה כמין בית",
        "paragraph": "The Mishnah stated: המעובה כמין בית אע\"פ שאין הכובבים נראין מתוכה כשרה – A succah that is thickly covered, like a house, even though the stars cannot be seen from inside of it, is kosher. It was taught in a Baraisa, אין כוכבי חמה נראין מתוכה בית שמאי פוסלין ובית הלל מכשירין – If the s’chach is so thick that even the rays of the sun cannot be seen from inside the succah, Beis Shammai passuls the succah and Beis Hillel is machshir it. Rashi explains that according to Beis Shammai, a succah with such thick s’chach is not like a succah at all. (It is rather like a house, which is certainly passul for the mitzvah)."
      }
    ],
    "siman": {
      "title": "Cab",
      "paragraph": "When the cab crashed into the סוכה המדובללת with the staggered s’chach, the upper reeds that were a tefach thick collapsed in between the lower reeds, making the succah dark like a house."
    }
  },
  {
    "daf": 23,
    "data": [
      {
        "id": 0,
        "title": "סוכה על גבי ספינה",
        "paragraph": "The Mishnah on the bottom of Daf 22b stated: העושה סוכתו בראש העגלה או בראש הספינה כשרה – If one makes his succah on the top of a wagon or on the top of a ship, it is kosher. The Gemara asks who the Tanna of the Mishnah is, and answers that it is Rebbe Akiva, based on a Baraisa that states that Rabban Gamliel holds that a succah on a ship is passul and Rebbe Akiva says that it is kosher. The Baraisa relates that Rebbe Akiva built a succah on a ship and the next day it blew over, and Rabban Gamliel asked him rhetorically, “Akiva, where is your succah now?” Abaye said that both Rabban Gamliel and Rebbe Akiva agree היכא דאינה יכולה לעמוד ברוח מצויה דיבשה לא כלום היא – where the succah is so flimsy it cannot withstand a usual land wind, it is nothing and certainly passul. If it is sturdy enough to withstand an unusual land wind, they both agree that it is kosher. They only disagree where it is possible to withstand a usual land wind but cannot withstand an unusual land wind, which Rashi says is the equivalent of a usual sea wind. Rabban Gamliel holds סוכת דירת קבע בעינן – a succah needs to be a fixed dwelling, and must be able to withstand a normal sea wind. Rebbe Akiva holds that סוכת דירת עראי בעינן, and since it can withstand a normal land wind, it is kosher."
      },
      {
        "id": 1,
        "title": "סוכה על גבי גמל",
        "paragraph": "The Mishnah on Daf 22b states: על גבי גמל כשרה ואין עולין לה ביום טוב – A succah on the back of a camel is kosher but one may not go up into it on Yom Tov. The Gemara on our Daf says that the Tanna of the Mishnah is Rebbe Meir, for it was taught in a Baraisa, העושה סוכתו על גבי בהמה רבי מאיר מכשיר ורבי יהודה פוסל – If one makes a succah on the back of an animal, Rebbe Meir is machshir the succah and Rebbe Yehudah is possel it. The Gemara explains that Rebbe Yehudah’s reason for invalidating the succah is based on the passuk that states, \"חג הסכת תעשה לך שבעת ימים\" – The festival of Succos you shall make for yourself for seven days. סוכה הראויה לשבעה שמה סוכה – From here we derive that a succah that  is fit to use for all seven days is deemed a kosher succah, but if it cannot be used for all seven days it is not deemed a succah. Since a succah atop an animal may not be used on the first day of Succos, which is Yom Tov, because of the d’Rabbanon against mounting an animal on Yom Tov, it is disqualified for the mitzvah altogether. Rebbe Meir holds הא נמי מדאורייתא מחזא חזיה ורבנן הוא דגזרו בה – this succah is fit mid’Oraysa for all seven days, and it is only the Rabbanon that decreed against it."
      },
      {
        "id": 2,
        "title": "Using an animal as a succah wall",
        "paragraph": "The Gemara brings a Baraisa in which Rebbe Meir rules that a live animal may not be used as a succah wall and Rebbe Yehudah permits it. The Gemara asks what Rebbe Meir’s reason is, and Abaye said: שמא תמות – Rebbe Meir is concerned that it might die and collapse to the ground on Yom Tov, thereby leaving the succah without one of its requisite walls. Rebbe Zeira said: שמא תברח – Rebbe Meir is concerned that it might run away. The Gemara goes through an extensive analysis and asks according to Abaye, what concern is there that the animal might die if it is held up by cords from above preventing it from collapsing? The Gemara answers that there are times that one stands the animal so that its top reaches to less than three tefachim from the s’chach, (in a succah that is only ten tefachim high), וכיון דמייתא כווצא ולאו אדעתיה – and once it dies, it shrinks slightly, so that its top is three tefachim or more from the s’chach, and it will not be on his mind to repair the defective wall, since it is not noticeably defective."
      }
    ],
    "siman": {
      "title": "Kugelach – The children’s game (Moving forward the siman is no longer “keg”)",
      "paragraph": "When the Kugelach championship taking place in the succah on the boat suddenly stopped when the succah blew away, the kids were transported in succahs on top of camels to a succah that had a dead animal held up by cords as one of its walls."
    }
  },
  {
    "daf": 24,
    "data": [
      {
        "id": 0,
        "title": "כל מחיצה שעומדת ברוח אינה מחיצה",
        "paragraph": "On Daf 23a a Baraisa was brought that taught that Rebbe Meir holds that a live animal may not be used as a succah wall. Abaye said that Rebbe Meir’s reason for disqualifying an animal is that it might die, whereas Rebbe Zeira said that his reason is that it might run away. The Gemara points out here that the implication is that מדאורייתא מחיצה מעליא היא – mid’Oraysa an animal is a valid partition, and it is the Rabbanon that were gozeir that it should not be used. If this is so, then according to Rebbe Meir תטמא משום גולל – an animal should become tamei if it was being used as a tomb covering, but it was taught in a Mishnah that Rebbe Meir holds that such an animal is tahor? The Rabbanon can be more machmir when the Torah is more meikel, but they cannot be more meikel when the Torah is machmir. The Gemara concedes this and therefore disproves Abaya and Rebbe Zeira’s reasons and presents Rav Acha bar Yaakov’s pshat that Rebbe Meir holds כל מחיצה שעומדת ברוח אינה מחיצה – any mechitzah that stands erect because of breath, is not a kosher mechitzah. Others say that Rav Acha bar Yaakov said that Rebbe Meir holds any mechitzah that is not made by man is not a mechitzah. The nafka minah between the two is where he propped up a wall with נוד תפוח – an inflated wineskin."
      },
      {
        "id": 1,
        "title": "Machlokes whether one can write a get on an animal",
        "paragraph": "The Gemara brought a Baraisa on Daf 23a regarding what may not be done with live animals and concluded that Rebbe Yose HaGlili taught אף אין כותבין עליו גיטי נשים – one may also not write on a get on them. On our Daf, the Gemara explains that Rebbe Yose HaGlili learns from “\"וכתב לה – and one writes for her, that one may write the get on any type of writing surface, not just parchment. The word ספר teaches that it must be written on something similar to a ספר, not food or living things. The Gemara explains that the Rabbanon, who argue with Rebbe Yose HaGlili and hold that one may write a get on an animal, learn that the word ספר teaches, לספירת דברים בעלמא הוא דאתא, that a get should be a narration of words that convey that he is divorcing her. Rashi explains that the word sefer is not referring to the klaf, the writing surface, but rather the formula of severance that the husband is communicating within the get. Therefore, the Torah is not putting a limitation on any writing surface and animals can be used as well."
      },
      {
        "id": 2,
        "title": "העושה סוכתו בין האילנות והאילנות דפנות לה כשרה",
        "paragraph": "The next Mishnah states: If one makes his succah among the trees, with the trees serving as walls for it, it is kosher. The Gemara questions Rav Acha bar Yaakov who said, כל מחיצה שאינה יכולה לעמוד ברוח מצויה אינה מחיצה – Any mechitzah that cannot withstand a normal wind, is not a kosher mechitzah. According to Rav Acha bar Yaakov, the succah that uses trees as walls should not be kosher since they sway to and for from the wind? The Gemara defends Rav Acha bar Yaakov’s ruling, clarifying that the Mishna is discussing a case where the trunk is stiff, and the branches do not sway, because they were braided with palm branches and bay trees. It was still necessary for the Mishnah to teach that trees may be used as succah walls for one might have thought ניגזר דלמא אתי לאשתמושי באילן – we should be gozeir that trees should be passul as walls, lest one come to use the tree on Yom Tov."
      }
    ],
    "siman": {
      "title": "Pitcher (כד)",
      "paragraph": "When the inflatable pitcher of air used as a succah wall popped when the cow with a get written all over it bit into it, it flew into the trees serving as walls for the neighbor’s succah."
    }
  },
  {
    "daf": 25,
    "data": [
      {
        "id": 0,
        "title": "שלוחי מצוה פטורין מן הסוכה",
        "paragraph": "The next Mishnah states, שלוחי מצוה פטורין מן הסוכה – Those on a mission to do a mitzvah are patur from the mitzvah of succah. Rashi brings the examples of one who is travelling in order to learn Torah, greet his Rebbe or to redeem Jewish captives. The Gemara asks for the source of this principle and brings a Baraisa regarding krias Shema that states, \"בשבתך בביתך\" – during your sitting in your home; פרט לעוסק במצוה – this excludes one who is occupied with doing a different mitzvah, who is patur from Krias Shema, \"ובלכתך בדרך\" – and during your going on the way; פרט לחתן – this excludes a chosson, who is preoccupied with this thought pertaining to his performance of a mitzvah. The Baraisa teaches this applies specifically to one marrying a besulah. The Gemara asks how the passuk implies that העוסק במצוה פטור מן המצוה and Rav Huna said: כדרך – The passuk obligates one to recite Shema when “sitting” or “going” only when these activities are comparable to “the way.” מה דרך רשות אף כל רשות לאפוקי האי דבמצוה עסוק – Just as one takes to the way for discretionary purposes so too all situations mentioned in the passuk refer to those involved in a discretionary act, which comes to exclude this person involved in a mitzah."
      },
      {
        "id": 1,
        "title": "Why both sources of Krias Shema and Pesach Sheini were needed to teach about העוסק במצוה",
        "paragraph": "The Gemara questions the need to derive העוסק במצוה פטור מן המצוה from Krias Shema since it can be learned from the parshah of Pesach Sheini for it was taught in a Baraisa that Rebbe Yitzchak argued that the ones who were tamei were those involved with a meis mitzvah whose seventh day after becoming tamei fell on erev Pesach, \"ולא יכלו לעשת הפסח ביום ההוא\" – and they were unable to offer the pesach “on that day.” This implies that they would have been able to offer it the next day since their taharah would have been completed. We see from here that within seven days of Pesach, the people were allowed to attend to a meis mitzvah even though that would preclude their performance of a second, more significant mitzvah, that being the korban pesach. The Gemara answers that both sources are necessary. If the Torah had only taught the principle from Pesach Sheini one might have thought משום דלא מטא זמן חיובא דפסח – it is permissible because the chiyuv of the korban Pesach had not arrived yet when they did the mitzvah of meis mitzvah, but here regarding the time of Krias Shema, when the time of the mitzvah has arrived, one could say there is no exemption. And if it had been learned from Krias Shema, one might have thought it is because there is no issur kares for failure to perform the second mitzvah, whereas in the case of the pesach, when there is an issur kares, one would not be patur."
      },
      {
        "id": 2,
        "title": "אבל חייב בסוכה",
        "paragraph": "Rebbe Abba bar Zavda said in the name of Rav אבל חייב בסוכה – a mourner is chayav in the mitzvah of succah. One might have thought that since Rebbe Abba bar Zavda said in the name of Rav, מצטער פטור מן הסוכה – one who experiences distress is patur from succah, so too a mourner. Rebbe Abba bar Zavda is coming to teach הני מילי צערא דממילא – this applies only when the distress is inherent in the succah, but here איהו דקא מצטער נפשיה – it is he who is causing distress by dwelling on his loss, איבעי ליה ליתובי דעתיה – he is required to calm his mind from his grief and enable himself to perform the mitzvah of dwelling in a succah."
      }
    ],
    "siman": {
      "title": "Twenty-fifth anniversary",
      "paragraph": "The husband who came late to his own silver anniversary dinner on Succos and tried to excuse himself by claiming he was involved in another mitzvah, and then a meis mitzvah, couldn’t stop feeling like a mourner as he sat (alone) in the succah the rest of the night."
    }
  },
  {
    "daf": 26,
    "data": [
      {
        "id": 0,
        "title": "חולין ומשמשיהן פטורין מן הסוכה",
        "paragraph": "The Mishnah on Daf 25a stated, חולין ומשמשיהן פטורין מן הסוכה – The sick and their attendants are patur from the mitzvah of succah. It was taught in a Baraisa, חולה שאמרו לא חולה שיש בו סכנה אלא אפילו חולה שאין בו סכנה – The choleh that was referred to in the Mishnah is not necessarily a choleh whose life is in danger but even a choleh whose life is not in danger, אפילו חש בעיניו ואפילו חש בראשו – and even if he merely has an eye-ache or a headache.The Gemara goes on to distinguish between a choleh and a מצטער מן הסוכה – that a choleh and his attendants are patur from the mitzvah of a succah but the attendants of a מצטער are not patur. The Aruch LaNer explains that throughout the year a person would leave his home to attend to a sick person’s needs, therefore during Succos, he may leave the succah as well. But a person would not leave his home to attend to a person experiencing mere discomfort. Therefore, he may not leave the succah for that purpose either."
      },
      {
        "id": 1,
        "title": "אוכלין אכילת עראי חוץ לסוכה ואין ישנים שינת עראי חוץ לסוכה",
        "paragraph": "The Mishnah stated, ואוכלים אכילת עראי חוץ לסוכה – One may eat lightly outside the succah. A Baraisa was brought that taught: אוכלין אכילת עראי חוץ לסוכה ואין ישנים שינת עראי חוץ לסוכה – One may eat lightly outside the succah, but one may not nap outside the succah. Rav Ashi said גזרה שמא ירדם – The Rabbanon were gozeir against napping lest one fall into a deep sleep. Abaye challenged Rav Ashi from a Baraisa that taught that one may take a nap with his tefillin on but may not take a deeper sleep, as Rashi explains he might come to pass gas. Here too, there should be a concern that he might fall into a deeper sleep. When the first answer is rejected, Rabbah bar bar Chanah said in the name of Rebbe Yochanan, במניח ראשו בין ברכיו עסקינן – We are dealing with one who puts his head between his knees. A person in this position is unlikely to fall into a deep sleep.  Rava gave an alternative reason why one should not nap outside the succah: אין קבע לשינה – There is no fixed minimum for regular sleep. That is, even light sleep has the halachic status of regular sleep, because a nap can also refresh a person. Rashi explains that with respect to tefillin, where the only concern is that one might pass gas, one is allowed to doze, because a person does not tend to pass gas while dozing."
      },
      {
        "id": 2,
        "title": "אסור לאדם לישן ביום יותר משינת סוס",
        "paragraph": "Rav said: אסור לאדם לישן ביום יותר משינת סוס – It is forbidden for a person to sleep by day longer than a horse’s sleep, and how long is a horse’s sleep, שיתין נשמי – sixty respirations. Rashi explains that it is forbidden because of bitul Torah. Abaye said that שנתיה דמר כדרב, - Master’s sleep, referring to his Rebbe, Rabbah bar Nachmani, was as long as Rav’s, which was as long as Rebbe’s, which was as long as Dovid’s, which was as long as a horse’s nap, which is sixty respirations. The Gemara relates that Abaye would doze by day for as long as it takes to travel from Pumbedisa to Bei Kuvei, which Rashi says was a distance of six parsahs. Rav Yosef recited the following passuk in reference to him: \"עד מתי עצל תשכב מתי תקום משנתך\" – How long will you recline, O sluggard? When will you arise from your sleep?"
      }
    ],
    "siman": {
      "title": "Military Coup",
      "paragraph": "The army medics on duty during the military coup, who carried the choleh with a headache on a stretcher and were patur from mitzvas succah, shouted into their bullhorn to wake up the soldiers dozing outside, next to the sleeping horse."
    }
  },
  {
    "daf": 27,
    "data": [
      {
        "id": 0,
        "title": "How many meals is one chayav to eat in a succah?",
        "paragraph": "The next Mishnah states: Rebbe Eliezer says: ארבע עשרי סעודות חייב אדם לאכול בסוכה אחת ביום ואחת בלילה – A person is chayav to eat fourteen meals in the succah, one during the day and one during the night, for each of the seven days of Succos. But the Chochomim say: אין לדבר קצבה חוץ מלילי יום טוב ראשון של חג בלבד – There is no fixed amount, except for the first night of the chag alone. The Gemara asks for the rationale behind Rebbe Eliezer’s ruling, and answers that the Torah commands “In succos you shall dwell” – \"תשבו\" כעין תדורו – “you should dwell” in the succah in the way that you dwell at home. Just as one eats one meal during the day and one at night at home, so too he should do in the succah. The Chochomim hold that a succah must be כדירה – like a residence. אי בעי אכיל אי בעי לא אכיל – If a person wants to eat, he eats, and if he does not want to eat, he does not. As to why the first night is also not discretionary, the Gemara brings Rebbe Yochanan, who said in the name of Rebbe Shimon ben Yehotzadak, that there is a gezeirah shaveh of \"חמשה עשר\" \"חמשה עשר\", linking Pesach and Succos together. Just as eating matzah on the first night of Pesach is a chiyuv, eating in the succah on the first night of Succos is a chiyuv."
      },
      {
        "id": 1,
        "title": "Machlokes whether one can use two different succahs",
        "paragraph": "It was taught in a Baraisa: Rebbe Eliezer says: אין יוצאין מסוכה לסוכה ואין עושין סוכה בחולו של מועד – One may not exit from one succah to go to another succah, which Rashi explains means that one may not eat in one succah and sleep in another or use one succah for one day and another succah on the next day, and one may not erect a succah on Chol Hamoed. But the Chochomim say that one may leave a succah and go to another, and one may erect a succah on Chol HaMoed. The basis for Rebbe Eliezer’s ruling is the passuk, \"חג הסכת תעשה לך שבעת ימים\" – The chag of Succos, you shall make for yourself for seven days, which implies עשה סוכה הראויה לשבעה – that one must erect a succah that is fit for all seven days. The Chochomim say that the passuk is coming to teach, עשה סוכה בחג – Erect a succah during the chag, meaning that one must erect a succah for any of the seven days. Even if he only requires a succah for one day, he must erect a succah to fulfill his chiyuv."
      },
      {
        "id": 2,
        "title": "Machlokes whether one can fulfill his chiyuv by dwelling in his friends’ succah",
        "paragraph": "It was taught in a Baraisa: Rebbe Eliezer says: Just as a person does not fulfill his chiyuv to take a lulav on the first day of Succos with his friend’s lulav, as it is written, \"ולקחתם לכם ביום הראשון פרי עץ הדר כפת תמרים\" – and you shall take for yourselves on the first day, the fruit of a citron tree, the branch of a date palm, where we derive משלכם – that one must take from these minim in his own possession, כך אין אדם יוצא ידי חובתו בסוכתו של חבירו – so too, a person cannot fulfill his chiyuv by dwelling in his friend’s succah, for it is written, \"חג הסכת תעשה לך שבעת ימים\" – A chag of Succos you shall make for yourselves for seven days, from which we derive משלך – the succah must be from your own possessions. The Chochomim say that one can fulfill his chiyuv in his friend’s succah, for it is written,\"כל האזרח בישראל ישבו בסכת\" – All the natives of Yisrael shall dwell in succos. The passuk teaches, שכל ישראל ראוים לישב בסוכה אחת – that all of Yisrael are fit to sit in one succah. Rashi explains that the passuk implies that the entire nation can fulfill their chiyuv by going into a single succah, one person after the other."
      }
    ],
    "siman": {
      "title": "Kazoo",
      "paragraph": "The boy who drove his neighbors crazy playing his kazoo straight for the amount of time it takes to eat fourteen seudos, who then left the succah and went into a second succah to do it again, was immediately escorted home because he was told he must only play in a succah that was his family’s possession."
    }
  },
  {
    "daf": 28,
    "data": [
      {
        "id": 0,
        "title": "שמונים תלמידים היו לו להלל הזקן",
        "paragraph": "It was taught in a Baraisa: שמונים תלמידים היו לו להלל הזקן – Hillel Hazakein had eighty talmidim. Thirty of whom were worthy that the Shechinah should rest upon them, as it did on Moshe Rabbeinu, thirty of whom were worthy that the sun should stand still for them, as it did for Yehoshua ben Nun; and there were twenty who ranked in between them. גדול שבכולן יונתן בן עוזיאל קטן שבכולן רבן יוחנן בן זכאי – the greatest of them all was Yonasan ben Uziel, and the the least of them was Rabban Yochanan ben Zakkai. The Baraisa enumerates Rabban Yochanan ben Zakkai’s mastery of every part of Torah, as well as שיחת מלאכי השרת ושיחת שדים ושיחת דקלים – the speech of the malachim, sheidim, and palm trees, various mashalim, and דבר גדול ודבר קטן – a great matter, referring to Maaseh Merkava, and a small matter, referring to הויות דאביי ורבא – the inquiries of Abaye and Rava. Now, if the least of all the talmidim, referring to Rabban Yochanan ben Zakkai, was so great, then all the more so Yonasan ben Uziel, who was the greatest of all the talmidim. It was said about him, בשעה שיושב ועוסק בתורה כל עוף שפורח עליו מיד נשרף – when he sat and learned Torah, any bird that flew over him was immediately burned."
      },
      {
        "id": 1,
        "title": "נשים... פטורין מן הסוכה",
        "paragraph": "The next Mishnah states: נשים ועבדים וקטנים פטורין מן הסוכה – Women, slaves and children are patur from the mitzvah of succah. The Gemara asks for the source that women are patur and it is determined that it is a Halacha L’Moshe M’Sinai . The Gemara asks why a Halacha L’Moshe M’Sinai is needed to teach women are patur, since succah is a מצות עשה שהזמן גרמא and women are exempt from such mitzvos? Abaye answered that it is otherwise one might have thought, \"תשבו\" כעין תדורו – The Torah’s command “You shall dwell” in succos, implies you should dwell in a succah the same way you dwell at home. מה דירה איש ואשתו אף סוכה איש ואשתו – Just as in a home, a man and his wife dwell together, so too in a succah a man and his wife should dwell together. Rava said that a Halacha L’Moshe M’Sinai is necessary to exempt women from succah, for one might have thought that the גזירה שוה of \"חמשה עשר\" \"חמשה עשר\" that link Succos to Pesach, comes to teach that just as women are chayav in achilas matzah, even though it is a מצות עשה שהזמן גרמא, so too they are chayav in succah."
      },
      {
        "id": 2,
        "title": "Which type of learning must be done in the succah?",
        "paragraph": "The next Mishnah states: כל שבעת הימים אדם עושה סוכתו קבע וביתו עראי – All seven days of Succos, a man makes his succah a fixed residence, and his regular house his temporary residence. The Gemara brings a Baraisa that describes how a person makes his succah a דירת קבע, such as bringing his nice keilim and beautiful linens to the succah, and it also states, ומשנן בסוכה – and he analyzes his Torah learning in the succah. The Gemara asks if this is correct, since Rava said: מקרא ומתנא במטללתא ותנוי בר ממטללתא – Reading Chumash and reviewing Mishnah should be done in the succah, but analyzing the Torah can be done outside the succah? Rashi explains that the fresh air outside helps one have a clear mind. The Gemara answers that the Baraisa is referring to reviewing material that he has already clarified, whereas Rava is referring to new material."
      }
    ],
    "siman": {
      "title": "Strong Man",
      "paragraph": "The strong man who was furious when birds kept burning up over a succah and falling all over his heavy weights, stormed past a group of women eating outside the succah, and broke down the door only to find a little old man learning Chumash and Mishnayos."
    }
  },
  {
    "daf": 29,
    "data": [
      {
        "id": 0,
        "title": "ירדו גשמים – אין מטריחין אותו לעלות עד שיגמר סעודתו",
        "paragraph": "The Mishnah on Daf 28b stated: מאימתי מותר לפנות משתסרח המקפה ירדו גשמים – If rain was falling into the succah, at what point is it permitted to leave and go into the house? When the rainfall is so intense that the porridge gets ruined. It was taught in a Baraisa on our Daf, that if one was eating in a succah and it began raining and he left  the succah and continued his meal in his house; אין מטריחין אותו לעלות עד שיגמור סעודתו – even if it stops raining, we do not trouble him to go back into the succah, until he finishes his meal and wishes to eat another meal. Rashi explains that once he sat down to continue his meal, he is no longer chayav to return to the succah, even if it stops raining. Similarly, if one was sleeping in the succah and it began raining, and he left his succah and went to sleep in his house; אין מטריחין אותו לעלות עד שיאור – even if it stops raining, we do not trouble him to go back into the succah until it becomes light, when dawn begins to break."
      },
      {
        "id": 1,
        "title": "ושפך לו קיתון על פניו",
        "paragraph": "The Mishnah brought a mashal for when one is forced out of the succah because of rain; למה הדבר דומה לעבד שבא למזוג כוס לרבו ושפך לו קיתון על פניו – To what does this compare? To a slave who comes to pour wine for his master, and he poured a pitcher of water on his face. The Gemara on this Daf brings a Baraisa that clarifies that it is as if the master spilled a pitcher of water on the slave’s face and said to him, אי אפשי בשמושך – “I do not desire your service!”The Gemara then digresses to discuss other natural occurrences which serve as an omen of Hashem’s dissatisfaction with the world. It was taught in a Baraisa: Rebbe Meir says: כל זמן שמאורות לוקין סימן רע לשונאיהם של ישראל – When the celestial bodies are stricken it is a bad omen for the Jewish people. We assume that the omen is intended for them מפני שמלומדין במכותיהן – because they are accustomed to their blows, meaning that the Jewish people are accustomed to punishment. This is analogous to a teacher of young children who comes to school with a strap in his hand. מי דואג מי שרגיל ללקות בכל יום ויום הוא דואג – Who is worried about the impending punishment? The child who is accustomed to being hit everyday is the one that worries."
      },
      {
        "id": 2,
        "title": "לולב הגזול",
        "paragraph": "The opening Mishnah of the third perek states: לולב הגזול והיבש פסול – A stolen lulav or a dry one is passul. The Gemara points out that the Mishnah does not distinguish between the first day of Yom Tov or the second day of the chag, and asks that while it is understandable that a dry lulav is passul on any day, because \"הדר\" בעינן וליכא – we require that the lulav possess beauty all seven days, and this is lacking when the lulav is dry, but for a stolen lulav it is only understandable that on the first day of the chag it is passul,  because it is written, \"לכם\" – and you shall take for yourselves on the first day the dalet minim, which implies  ,משלכם it should be your own property, but why on the second day of the chag should a stolen lulav be passul? Rebbe Yochanan said in the name of Rebbe Shimon bar Yochai משום דהוה ליה מצוה הבאה בעבירה – because it is a mitzvah that is brought about through an aveirah. An object that is acquired through an aveirah is unfit for use in the performance of a mitzvah."
      }
    ],
    "siman": {
      "title": "Cot",
      "paragraph": "As the empty cot in the succah got soaked from the rain while the family ate inside, the master poured a pitcher on the face of a thief, who tried to sneak in and steal his lulav."
    }
  },
  {
    "daf": 30,
    "data": [
      {
        "id": 0,
        "title": "The source and a mashal for מצוה הבאה בעבירה",
        "paragraph": "Rebbe Yochanan said in the name of Rebbe Shimon bar Yochai that the reason it is prohibited to use a stolen lulav is because it is a מצוה הבאה בעבירה – a mitzvah that is brought about through doing an aveirah, which is based on a passuk that lists stolen animals and lame animals that are unfit to be offered. מה פסח לית ליה תקנתא אף גזול לית ליה תקנתא – Just as a lame animal cannot be repaired, as the blemish renders it permanently unfit to be offered, so too a stolen one cannot be repaired לא שנא לפני יאוש ולא שנא אחר יאוש – and it makes no difference if it is before the original owner has abandoned hope of retrieving it, or afterwards.Related to this, Rebbe Yochanan said in the name of Rebbe Shimon bar Yochai, what is the meaning of that which is written, \"כי אני ה' אהב משפט שנא גזל בעולה\" – For I am Hashem, Who loves justice, Who hates robbery in an olah offering? This may be explained by means of a mashal of a king passing through a toll booth in his own country, who says to his servants to pay the toll. When they asked him what the point was, since all of the revenue goes to him, he replied that all the travelers learn from him by example, that they should not try to avoid the toll. Similarly, Hashem says in regard to not wanting a stolen olah, ממני ילמדו בני ויבריחו עצמן מן הגזל – Let my sons learn from Me, so that they will distance themselves from theft."
      },
      {
        "id": 1,
        "title": "Rebbe Yitzchak bar Nachmani holds one can use a stolen lulav from the second day on",
        "paragraph": "The Gemara brings Rebbe Ami who agrees with Rebbe Yochanan that one is not permitted to use a stolen lulav because it is a מצוה הבאה בעבירה, but then brings a statement from Rebbe Yitzchak bar Nachmani who said in the name of Shmuel, that a stolen lulav is only passul on the first day of Yom Tov אבל ביום טוב שני מתוך שיוצא בשאול יוצא נמי בגזול – but on the second day of the chag and thereafer, the rule is that since a person can be yotzei with a borrowed lulav, he can be yotzei with a stolen one. Rashi explains that Rebbe Yitzchak bar Nachmani holds that the only reason a stolen lulav cannot be used on the first day is the Torah’s requirement that it be his own property. Just as on the second day he may use a borrowed lulav, he may use a stolen one."
      },
      {
        "id": 2,
        "title": "Rav Huna’s guidance to the merchants regarding selling hadasim",
        "paragraph": "Rav Huna said to the merchants who sold the dalet minim, that when you buy myrtle twigs to be used for hadasim, they should not cut them from the trees themselves, but rather let the nochrim cut the twigs and give them to you, the reason being, סתם עובדי כוכבים גזלני ארעתא נינהו – nochrim generally steal the land on which the hadasim trees grow, וקרקע אינה נגזלת – but land cannot be “stolen.” Meaning, that land always remains the original owner’s property, even if he abandons hope of recovering it. If they themselves cut them from the trees, they will be stealing them and will be unable to use them as a mitzvah. Therefore, they should let the nochrim cut the twigs so that there should be יאוש בעלים in the nochri’s hands ושינוי הרשות – and a change of jurisdiction when the twigs are placed in the merchants’ hands. The twigs will then be fit for use for the performance of the mitzvah. The Gemara asks why this procedure was necessary. Even if the merchants cut the twigs from the trees, thenthere would be יאוש בעלים in the merchants’ hands and שינוי הרשות in the buyers’ hands? The Gemara answers that Rav Huna’s ruling is necessary only regard to the twigs that will be used for the merchants’ own hoshana bundles."
      }
    ],
    "siman": {
      "title": "Melamed",
      "paragraph": "The  Rebbi riding on a lame goat  who made sure all his talmidim paid the toll, got stopped by cops searching for stolen lulavim being used on the second day of Succos, while a nearby merchant instructed  nochrim  to cut Hadasim twigs before giving it to him."
    }
  },
  {
    "daf": 31,
    "data": [
      {
        "id": 0,
        "title": "גזל עצים וסיכך בהן אין לו אלא דמי עצים",
        "paragraph": "A Baraisa stated, גזל עצים וסיכך בהן דברי הכל אין לו אלא דמי עצים – If one stole pieces of wood and made a succah with them, all agree that the original owner has the right to receive only the value of the wood, and the robber may keep the succah. The Gemara brings an incident where a certain elderly woman came before Rav Nachman and said to him: “The Reish Galusa and all the rabbanon of the Reish Galusa’s house, have been sitting in a stolen succah, for its wood has been stolen from me!” She screamed, demanding that her wood be returned, but Rav Nachman paid no attention to her. She said to him: “A woman whose father had three hundred and eighteen servants, (which Rashi says is a reference to Avraham Avinu, who owned 318 servants), is screaming before you and you pay no attention to her!?” Rav Nachman ignored her and said to his students פעיתא היא דא – This woman is a screamer. ואין לה אלא דמי עצים בלבד – and she is entitled only to the value of the wood that was stolen from her, but not the wood itself."
      },
      {
        "id": 1,
        "title": "יבש פסול רבי יהודה מכשיר",
        "paragraph": "It was taught in a Baraisa: יבש פסול רבי יהודה מכשיר – A dry lulav is passul, but Rebbe Yehudah is machsir it. Rava said that the machlokes pertains to a lulav, but not to an esrog, דרבנן סברי מקשינן לולב לאתרוג – for the Rabbanon hold that we make a hekeish between the lulav and esrog as follows: מה אתרוג בעי הדר אף לולב בעי הדר – Just as the esrog requires beauty, so too the lulav requires beauty, whereas Rebbe Yehudah holds that we do not make the hekeish and the lulav does not require beauty. אבל באתרוג דברי הכל הדר בעינן – However concerning the esrog, everybody agrees that it requires beauty. When Rava is challenged, based on the fact that Rebbe Yehudah says יאגדנו למעלה – one should tie a lulav at the top if the leaves are spread apart, presumably because of הידור, the Gemara answers that Rebbe Yehudah holds that the words כפת תמרים teaches - ואם היה פרוד יכתפנו the lulav should as one, and if it was spread apart, one should tie it together. After many attempts, the Gemara is unsuccessful in proving that Rebbe Yehudah requires hiddur for a lulav but does refute Rava’s statement that Rebbe Yehudah requires hiddur for an esrog, from the fact that Rebbe Yehudah is machshir an old esrog."
      },
      {
        "id": 2,
        "title": "נסדק כשר",
        "paragraph": "The Mishnah on Daf 29b stated: נקטם ראשו פסול – If the lulav’s top is clipped off it is passul. Rav Huna said that they only taught this concerning the case where the top is actually clipped off, אבל נסדק כשר – but if it was merely split, the lulav is kosher. The Gemara questions whether a split lulav is kosher, from a Baraisa that taught: לולב כפוף קווץ סדוק עקום דומה למגל פסול – A lulav that is bent over that looks like a fishhook, barbed, meaning that it hass thorny stems protruding from its spine, split, or curved like a sickle, it is passul. We see from here that נסדק is passul? Rav Pappa said, דעביד כהימנק – The Baraisa refers to a case where the lulav was made like a himnak. Rashi explains that the Baraisa is not referring to a lulav whose leaves have split open, but rather to a lulav that grew in the shape of a himnak, which is a metal tool used by sofrim that is forked at one end. If the lulav grew in this shape, it appears to have two spines,with the leaves reaching in opposite directions. Such a lulav is passul, but a lulav whose leaves have split open is kosher."
      }
    ],
    "siman": {
      "title": "Judge (law)",
      "paragraph": "The woman screaming at the judge sitting in the succah made from wood she claimed was stolen, became enraged when he gave her a dry lulav and old esrog as compensation and told her they were kosher, and not to worry that the lulav was split."
    }
  },
  {
    "daf": 32,
    "data": [
      {
        "id": 0,
        "title": "נחלקה התיומת",
        "paragraph": "Rav Pappa asked: נחלקה התיומת מהו – If the tiyumes was split in two, what is the halachah? The tiyumes is the middle double leaf that grows from the top of the lulav’s spine and forms its tip. Rashi explains that the leaf is called a tiyumes because the leaves are attached like תאומים – twins. Rav Pappa is asking in a case where the tiyumes is split all the way down to the spine, so that the top of the spine is split. The Gemara answers, that Rebbe Yochanan said in the name of Rebbe Yehoshua ben Levi: ניטלה התיומת פסול – If the tiyumes was removed, the lulav is passul. מאי לאו דהוא הדין נחלקה – Is it not presumable that the same halachah applies if the tiyumes is split? The Gemara assumes that the removal of the tiyumes makes the lulav passul because it then lacks הדר, and the same would apply when it is split. The Gemara rejects this answer, saying that the case of where the tiyumes was removed is different, דהא חסר ליה – because then the lulav is deficient. Another version of Rebbe Yochanan’s statement has him state that a split tiyumes is considered as if it is removed and the lulav is passul."
      },
      {
        "id": 1,
        "title": "How we know that כפות תמרים refers to a lulav",
        "paragraph": "Ravina said to Rav Ashi on what basis do we know that כפות תמרים requires us to take a lulav, which is the pliant palm branch whose leaves hug its spine. אימא חרותא – Say that the Torah refers to a hardened branch. Rashi explains that this is a palm tree branch that has hardened for two or three years. Many stems branch off the central one and have hardened and point in different directions. Rav Ashi responded בעינא כפות וליכא – We require that the lulav be tied together, and this condition is lacking in a hardened branch. When Ravina counters ואימא אופתא – but say the passuk refers to a log from the trunk of the palm tree, Rav Ashi responded, כפות מכלל דאיכא פרוד – The expression “tied up” implies that there is a possibility for it to be separated, והאי כפות ועומד לעולם – and this one (the log) is permanently “tied up.” When the Gemara asks ואימא כופרא – but say the passuk refers to a palm shoot, which is a branch that is one or two years old and has begun to harden, but the stems protruding from it still can be bent back and tied to it, Abaye said: דרכיה דרכי נעם וכל נתיבתיה שלום – Its ways are pleasantness, and all its pathways are peace. Rashi explains that since a palm shoot has thorny projections, it is unpleasant for one to hold."
      },
      {
        "id": 2,
        "title": "ענף עץ עבות – זה הדס",
        "paragraph": "It was taught in a Baraisa regarding identifying a hadas: \"ענף עץ עבת\" שענפיו חופין את עצו – The term “a shoot of the plaited tree” refers to a species whose shoots cover its branches. And which species is this? It is a hadas. Another Baraisa described the hadas: The term “shoot of the plaited tree” implies קלוע כמין קליעה ודומה לשלשלת – that the tree’s leaves are plaited like a braid, and similar to an interlocking chain, and this is a reference to a hadas. Rebbe Eliezer ben Yaakov says that the term refers to עץ שטעם עצו ופריו שוה – a tree whose wood and fruit taste alike, which is a reference to a hadas. The Gemara asks what the case is of a twig that is plaited, and Rav Yehudah said that it is where the leaves stand תלתא תלתא טרפי בקינא – in clusters of three on each base. Rav Kahana said אפילו תרי וחד – even if they stand in pairs with a third one overlapping each pair."
      }
    ],
    "siman": {
      "title": "Mad scientist in a lab",
      "paragraph": "The mad scientist working in his succah lab on developing a species of lulav where the תיומת never split, ended up producing a mutant thorny lulav that was plaited like a braid and looked more like a hadas."
    }
  },
  {
    "daf": 33,
    "data": [
      {
        "id": 0,
        "title": "אם יש דחוי אצל מצות",
        "paragraph": "The Mishnah on 32b stated, נקטם ראשו פסול – If the top of the hadas is clipped off it is passul. On our Daf, Ulla bar Chinana qualified the Mishnah with the following Baraisa: נקטם ראשו ועלתה בו תמרה כשר – If its top was clipped off, but a “date” grew on it, the hadas is kosher. Rashi explains that the hadas sometimes sprouts small green date-shaped buds, which are similar to the buds that grow on aravos stems, at the bases of its leaves. When the bud sprouts, the hadas is considered to have regained its beauty. Rebbe Yirmiyah asked what the halachah is if its top was clipped off before Yom Tov and a date grew on it during Yom Tov? יש דחוי אצל מצות או לא – Is there permanent rejection in regard to mitzvos, or not? The concept of dichui, which applies in regard to kodshim, is that once an object is disqualified from use in a specific service it is permanently rejected, even if the reason for disqualification ceases to exist.The Gemara asks why Rebbe Yirmiyah is uncertain, since a case in Chullin stated that if blood was covered by earth via wind, and then became uncovered again, a person is chayav to cover it to fulfill the mitzvah of כסוי הדם. Rav Pappa said that this implies אין דחוי אצל מצות – there is no permanent rejection in regard to mitzvos. The Gemara said that Rav Yirmiyah was inquiring about Rav Pappa’s inference. Does אין דחוי אצל מצות apply only to chumros, such as this case of כסוי הדם, or even when it leads to a kula such as this hadas case? The Gemara leaves it as a teiku but later resolves part of the question."
      },
      {
        "id": 1,
        "title": "Removing the berries from hadasim on Yom Tov",
        "paragraph": "It was taught in a Baraisa, אין ממעטין ביום טוב – We may not decrease the berries (from hadasim) on Yom Tov, but it was reported in the name of Rebbe Eliezer b’Rebbe Shimon that we may decrease them on Yom Tov. The Gemara questions Rebbe Eliezer’s opinion והא קא מתקן מנא ביום טוב – But one is thereby repairing a kli on Yom Tov? Rav Ashi answered that we are dealing with a case where one plucked the berries for the purpose of eating them, and Rebbe Eliezer b’Rebbe Shimon hold likes his father, who said, דבר שאינו מתכוין מותר. The Gemara objects, because Abaya and Rava both said that Rebbe Shimon concedes that one is chayav in a case of פסיק רישיה ולא ימות. The Gemara answers that we are dealing with a case דאית ליה הושענא אחריתי – where the person has another hoshana with which he can do the mitzvah. Since it is irrelevant to him whether this hadas is valid, plucking the berries is not considered a “repair.”"
      },
      {
        "id": 2,
        "title": "ערבי נחל",
        "paragraph": "It was taught in a Baraisa: \"ערבי נחל\" הגדילין על הנחל – The term “brook willows” refers to aravos that grow by a brook. Another pshat is שעלה שלה משוך כנחל – that it is a type of aravah whose leaf is elongated like a brook. It was taught in another Baraisa that the plural form of ערבי נחל teaches that aravos are not only kosher if they grow by a brook, but they are also kosher if they grow in fields or mountains. Abba Shaul said \"ערבי\" שתים – the plural form of aravos implies two aravos are required, one for lulav and the other one for the Mikdash, to encircle the mizbeyach with aravos each day of Succos. The Rabbanon hold that the mitzvah of aravos in the Mikdash is Halachah LeMoshe MiSinai."
      }
    ],
    "siman": {
      "title": "Peg leg pirate",
      "paragraph": "The Peg Leg Pirate who got angry after he clipped off the top of the hadas and saw a new bud begin to grow on Yom Tov, got distracted pulling off all its berries to eat, that his ship got grounded in a willow brook."
    }
  },
  {
    "daf": 34,
    "data": [
      {
        "id": 0,
        "title": "צפצפה",
        "paragraph": "It was taught in a Baraisa: \"ערבי נחל\" הגדילות על הנחל פרט לצפצפה הגדילה בין ההרים – The term \"brook willows\" refers to aravos that grow by a brook, excluded, therefore, is the Tzaftzafah, which grows among the mountains. Rebbe Zeira said, which passuk demonstrates that tzaftzafah is not considered an aravah? \"קח על מים רבים צפצפה שמו – He took that which grows on abundant waters and set it up as tzaftzafah. Rashi explains that Hashem provided the Jewish people the opportunity to be as lush as an aravah, but they allowed themselves to be like a tzaftzafah. Clearly, this indicates that tzaftzafah is an inferior species, which is not included in the category of aravah.The Gemara brings a Baraisa that distinguishes between an aravah and tzaftzafah. ערבה קנה שלה אדום ועלה שלה משוך ופיה חלק – The Aravah: Its stem is red, and its leaf is elongated, and the edge of its leaf is smooth. צפצפה קנה שלה לבן ועלה שלה עגול ופיה דומה למגל – The tzaftzafah: Its stem is white, its leaf is rounded, and the edge of its leaf is serrated like a sickle."
      },
      {
        "id": 1,
        "title": "Machlokes regarding how many of each species must be taken",
        "paragraph": "The next Mishnah brings a machlokes Tannaim regarding how many of each species must be taken. Rebbe Yishmael holds that one must take three hadasim, two aravos, one lulav and one esrog. The hadasim are valid אפילו שנים קטומים ואחד אינו קטום – even if two are clipped and one is not clipped. Rebbe Tarfon saysאפילו שלשתן קטומים  - They are valid even if all three are clipped. Rashi explains that Rebbe Tarfon does not require hadar for hadasim. Rebbe Akiva says that just as only one lulav and one esrog are required, so too only one hadas and one aravah are required.The Gemara brings a Baraisa that elaborates on the Mishnah and teaches that Rebbe Yishmael said: \"פרי עץ הדר\" אחד – The passuk “the fruit of a hadar tree” teaches that one esrog is the required amount. \"כפת תמרים\" אחד – The “branches of date palms” refers to one lulav. Rashi explains that although the word כפת is plural, since it is written defectively without the letter vav, it can be read as a singular noun. \"ענף עץ עבות\" שלשה – The three words of “a shoot of the plaited tree” alludes to three hadasim.  \"ערבי נחל\" שתים and “brook willows” refers to two aravos."
      },
      {
        "id": 2,
        "title": "How the esrog is taken with the other minim",
        "paragraph": "In the same Baraisa, Rebbe Eliezer said יכול יהא אתרוג עמהן באגודה אחת - that it might be thought that the esrog should be tied together with the other three species in one bundle. To counter this thought, Rebbe Eliezer asks, does the passuk say פרי עץ הדר וכפת תמרים, with which the vav of וכפת would connect the hadar tree to the branches of date palms? No, it says כפת without the connecting letter vav. This teaches that the esrog is not bundled with the other species. ומנין שמעכבין זה את זה – And from where do we know that the dalet minim are essential to each other? Rashi explains that if one takes only three of the four minim he has completely failed to fulfill the mitzvah? תלמוד לומר \"ולקחתם\" שתהא לקיחה תמה – the Torah therefore states, “and you shall take,” which indicates that it should be a complete taking. Rashi explains that Rebbe Eliezer expounds ולקחתם as ולקחת תם – and you shall take completely."
      }
    ],
    "siman": {
      "title": "Ladder",
      "paragraph": "The ladder covered in white stemmed and rounded leaf tzaftzafah with serrated edges, had three hadasim on the third rung, two aravos on the second rung, and a lulav on the first rung, with the esrog all alone on the side."
    }
  },
  {
    "daf": 35,
    "data": [
      {
        "id": 0,
        "title": "Different pshatim in פרי עץ הדר",
        "paragraph": "It was taught in a Baraisa: \"פרי עץ הדר\" עץ שטעם עצו ופריו שוה הוי אומר זה אתרוג – The term the fruit of the hadar tree alludes to a tree whose wood and fruit taste alike. You must say that this is the esrog. Rebbe said: אל תקרי \"הדר\" אלא הדיר – Do not read the word describing the tree as hadar, meaning beautiful, rather read it as hadir, which means a corral. The Gemara comes to understand this to mean that just as in a corral, small animals are born while the large animals are still in existence, so too the tree is similar in that when the small fruits arrive, the large ones of the previous crop are still in existence. Rashi explains that an esrog is different from other fruits in that it can be left on the tree for a number of years. Rebbe Abahu said: אל תקרי \"הדר\" אלא הדר דבר שדר באילנו משנה לשנה – Do not read the word as hadar, rather, read it as haddar, meaning that it dwells. This teaches that that the reference is to something that dwells on its tree from one year to the next year. Ben Azzai says: אל תקרי \"הדר\" אלא אידור – Do not read it as hadar. Rather read it as idur, meaning water, for in Greek water is called idur. And which is the tree that grows on the basis of all sources of water, meaning it relies upon irrigation and rainfall? You must say this is the esrog."
      },
      {
        "id": 1,
        "title": "Machlokes why an esrog of orlah is passul",
        "paragraph": "The Mishnah on Daf 34b stated that an esrog of orlah is passul. Rebbe Chiya bar Avin and Rebbe Assi disagree regarding the reason. One says the reason is לפי שאין בה היתר אכילה – because the esrog is not permitted for consumption and the other says the reason is לפי שאין בה דין ממון – because there is no monetary jurisdiction over it. Rashi explains that since one cannot derive הנאה from orlah it has no value at all, and therefore, is not considered “his own” to fulfill ולקחתם לכם. The Gemara revises its understanding of their machlokes and clarifies that they both agree that an esrog needs a היתר אכילה to be valid. They disagree whether it requires a דין ממון. The nafka minah is an esrog of maaser sheini that is inside Yerushalayim according to Rebbe Meir. According to the one that said that an esrog of orlah is prohibited because it does not have a היתר אכילה, an esrog of maaser sheini inside Yerushalayim is valid since it may be eaten according to Rebbe Meir. According to the one who said an esrog of orlah is passul because it does not have a דין ממון, מעשר שני ממון גבוה הוא – maaser sheini is property of the Most High according to Rebbe Meir and would thus be passul."
      },
      {
        "id": 2,
        "title": "נטלה פטמתו פסול",
        "paragraph": "The Mishnah stated: נטלה פטמתו פסול – If its pitam was removed the esrog is passul. It is common for an esrog to have a stemlike protrusion at its top, which is crowned by a rounded bud. This short stem is the pitam and is also referred to as the דד, nipple. The crown of the stem is the שושנתא. If the pitam is missing the esrog is passul because it is considered חסר, deficient. On this Daf, Rebbe Yitzchak ben Elazar brought a Baraisa with the reading: נטלה בוכנתו – Its pestle was removed. This reading reflects the fact that the pitam is pointed and its shape resembles that of a pestle. Rebbe Yitzchak ben Elazar informs us that the esrog is passul only if the base of the pitam is missing, but not if the bud is missing."
      }
    ],
    "siman": {
      "title": "Children’s choir singing La-La-La",
      "paragraph": "The Pri Eitz Hadar Children’s choir comprised of kids of different ages dressed up as esrogim singing in a tree, wouldn’t let the kid in the Orlah esrog costume and the one who broke his pitam join them."
    }
  },
  {
    "daf": 36,
    "data": [
      {
        "id": 0,
        "title": "נולדו באתרוג סימני טרפה מהו",
        "paragraph": "Rava inquired: נולדו באתרוג סימני טרפה מהו – What is the halachah if signs of a tereifah appeared in an esrog? The Gemara says that Rava was asking about a case like that of Ulla, who said in the name of Rebbe Yochanan, that a lung that can be poured like a flask of water, is kosher, and Rava said, והוא דקיימא סימפונהא – This is only applicable where its bronchial tubes are intact, but if they are not intact it is a sign of a treifah. Rashi in Chullin explains that the dissolving of the interior flesh is considered a nonfatal defect only as long as the air passages did not dissolve, so that the lung still contains air passages within its membrane. Rava’s question in regard to an esrog is what is the halachah if its flesh is dissolved but the inner pockets containing the seeds are intact. Perhaps in the case of the lung, דלא שליט בה אוירא – where the external atmosphere does not impact on it, for the lung is enclosed within the body, הדר בריא – that even though the flesh has dissolved, it can regenerate, and that is why the animal is not a treifah. But here, in the case of the esrog, the external atmosphere does impact on it, and it inevitably rots once the flesh has dissolved, and since it cannot be corrected, the esrog is passul. Or perhaps there is no difference between the lung and the esrog? The Gemara’s attempt to resolve the question is not successful."
      },
      {
        "id": 1,
        "title": "An esrog molded with many planks",
        "paragraph": "It was stated in a Baraisa: גדלו בדפוס ועשאו כמין בריה אחרת פסול – If one grew the esrog in a mold and formed it like another species, it is passul. Rava said that they taught this only when one formed the esrog like another species, אבל כברייתו כשר – but if one shaped it like its own form, it is kosher. The Gemara asks that this is obvious, as the Baraisa stipulated, “like another species,” and it answers לא צריכא דעבידא דפי דפי – Rava’s statement was necessary concerning a case where the esrog was fashioned with many “planks.” Rashi explains that Rava refers to a mold that caused the esrog to grow in the shape of a water wheel, with numerous broad spokes emerging from a central core. Rava teaches that this is considered a normal form of esrog."
      },
      {
        "id": 2,
        "title": "Machlokes regarding what one uses to bind the lulav.",
        "paragraph": "The next Mishnah states that Rebbe Yehudah holds אין אוגדין את הלולב אלא במינו – We may not bind the lulav bundle except with its own kind, whereas Rebbe Meir holds, אפילו בחוט במשיחה – We may bind it even with linen  thread. Rava said that according to Rebbe Yehudah אפילו בסיב אפילו בעיקרא דדיקלא – we may bind the lulav even with the ivy that grows around the trunk of the palm tree and even with strips of bark from the trunk of the palm tree.  Rashi explains that even though they are a different color than the lulav and do not enhance its appearance, they can be used, since Rebbe Yehudah does not require hadar for the lulav. Rava says that Rebbe Yehudah’s reasoning is that he holds לולב צריך אגד – that the lulav requires bundling with the other species as part of the mitzvah. Rashi explains that since the אגד is required, whatever is joined in the bundle, even as a wrapping, is considered an inherent part of the mitzvah. Therefore, if one uses a fifth material, he will have violated בל תוסיף, the mitzvah not add to a mitzvah."
      }
    ],
    "siman": {
      "title": "Lulav",
      "paragraph": "The embarrassed merchant who sold thirty-six lulavim with what turned out to be treif esrogim, replaced them with esrogim that looked like water wheels and gave each person a free egged from one of the dalet minim."
    }
  },
  {
    "daf": 37,
    "data": [
      {
        "id": 0,
        "title": "Machlokes whether s’chach must be made from the dalet minim",
        "paragraph": "On the bottom of Daf 36b a Baraisa was brought that stated: \"בסכת תשבו\" – סוכה של כל דבר דברי רבי מאיר – Rebbe Meir says the passuk, In succos you should dwell, refers to a succah whose s’chach is made of anything. Rebbe Yehudah saysאין סוכה נוהגת אלא בארבעה מינים שבלולב  - The mitzvah of succah pertains only with a succah whose s’chach is made of one of the dalet minim, based on a kal v’chomer. If even the mitzvah of lulav, which does not apply by night as it does by day, applies only with the dalet minim, then concerning a succah, which applies by night as it does by day, all the more so it should be fulfilled with s’chach that is made of one of the dalet minim. They said to Rebbe Yehudah, כל דין שאתה דן תחילתו להחמיר וסופו להקל אינו דין – Any kal v’chomer that you advance with the intent to more machmir but whose end results in a kula is not an admissible kal v’chomer. For according to you, if one cannot find s’chach from the dalet minim he will not be able to fulfill the mitzvah, and the passuk states, בסכת תשבו שבעת ימים – סוכה של כל דבר – In succos you shall dwell for seven days, which implies a succah made from anything. In addition, it says in Ezra that the Jewish people were told to make succos with branches of olive leaves, pine needles in addition to the dalet minim. The Gemara answers that Rebbe Yehudah holds the other species were only for the דפנות, the walls."
      },
      {
        "id": 1,
        "title": "Smelling the hadas and esrog",
        "paragraph": "The Gemara cites a number of Rabah’s rulings. הדס של מצוה אסור להריח בו אתרוג של מצוה מותר להריח בו – Concerning the hadas that is designated for the mitzvah, it is forbidden to smell it on Succos, but concerning the esrog designated for the mitzvah, one is permitted to smell it on Succos. What is the reason? With respect to hadas, which normally stands to be used for smelling, when one sets it aside for the mitzvah, he sets it aside from the use of smelling. Rashi explains that the prohibition is derived through the analogy to the succah, דחל שם שמים על עצי סוכה, the wood is consecrated for the mitzvah and may not be used for other purposes. But with respect to the esrog, which normally stands to be used for eating, כי אקצייה מאכילה אקצייה – when one set it aside for the mitzvah, he set it aside from the use of eating, but did not set it aside from the use of smelling."
      },
      {
        "id": 2,
        "title": "The meaning of the נענעוים",
        "paragraph": "The next Mishnah discusses when the נענעוים, the waving of the lulav is done. The Gemara explains the symbolism of waving in various directions for the שתי הלחם ושני כבשי עצרת, which Rava says applies to lulav as well. Rebbe Yochanan said, מוליך ומביא למי שהארבע רוחות שלו – One extends them outward and then brings them inward for the sake of the One Whom the four directions of the world are His, מעלה ומוריד למי שהשמים והארץ שלו – one raises them up and lowers them down for the sake of the One Whom the heavens and the earth are His. In Eretz Yisroel they taught, מוליך ומביא כדי לעצור רוחות רעות – One extends them outwards and brings then inwards in order to ward off harmful winds, מעלה ומוריד כדי לעצור טללים רעים – one raises them up and lowers them down to ward off damaging dews. On the top of Daf 38a, Rebbe Yose bar Avin, and some say, Rebbe Yose bar Zevila, said, this tells us שירי מצוה מעכבין את הפורענות – that even the residual part of the mitzvah can prevent punishment, for the waving is a שירי מצוה and yet it wards off harmful winds and dews. When doing the נענעוים, Rav Acha bar Yaakov used to say, דין גירא בעיניה דסטנא – “This is an arrow in the eye of the Satan,” but the Gemara says this is not a proper practice משום דאתי לאיגרוייה ביה – because Satan may come to provoke him to sin."
      }
    ],
    "siman": {
      "title": "Laser Tag",
      "paragraph": "The laser tag champ hiding out in the succah with the dalet minim s’chach, zapped his rival as he was sniffing a hadas and kept the enemy team at bay by waving his laser gun back and forth."
    }
  },
  {
    "daf": 38,
    "data": [
      {
        "id": 0,
        "title": "Interrupting one’s meal to do the mitzvah of lulav",
        "paragraph": "The next Mishnah states: מי שבא בדרך ולא היה בידו לולב ליטול – If one was traveling on the road and did not have a lulav in hand to take and perform the mitzvah, when he enters his home, יטול על שלחנו – he should take the lulav at his table. If one did take the lulav in the morning, he should take it in the afternoon, שכל היום כשר ללולב – for the entire day is kosher for taking the lulav. The Gemara presents a contradiction in the Mishnah. It states that one takes the lulav at the table, למימרא דמפסיק – which is to say that he must interrupt his meal in order to fulfill the mitzvah. But it states in a Mishnah in Shabbos that if one began his meal before davening Minchah, אין מפסיקין – he is not required to interrupt his meal but can finish and daven afterwards. Rav Safra said that there is no contradiction. The Mishnah in Shabbos refers to where there is enough time in the day to finish the meal and daven, whereas our Mishnah is dealing with when there is not enough time to finish and take the lulav.When Rava suggested that a more obvious distinction is that one must interrupt for lulav because it is a d’Oraysa, whereas davening is only a d’Rabbanon, Rebbe Zeira said the case of the lulav was on the second day of the chag. The Gemara says this is implied, since the Mishnah said, “he was traveling on the way,” which cannot be done on the first day of Yom Tov."
      },
      {
        "id": 1,
        "title": "Major Halachos that can be learned from the current custom of reciting Hallel",
        "paragraph": "The next Mishnah discusses the mitzvah of Hallel. Rava said הלכתא גיברתא איכא למשמע ממנהגא דהלילא – Major halachos can be deduced from the current custom for the recitation of Hallel. Rashi explains that the custom in Rava’s time changed considerably from when Hallel was instituted by the Neviim. Originally, not everyone was proficient in reading, so the Neviim established the minhag for one person to recite Hallel, and the others would listen and respond Halleluyah after each phrase. By Rava’s time, most people were proficient enough to recite Hallel on their own in unison with the ba’al tefillah, except in certain places. The first halachah of six that Rava mentioned was that the ba’al tefillah would recite the first word, Halleluyah, and the people would respond Halleluyah. מכאן שמצות לענות הללויה – From here it can be inferred that it is a mitzvah to respond Halleluyah at the beginning of Hallel."
      },
      {
        "id": 2,
        "title": "The source for שומע כעונה",
        "paragraph": "Rebbe Shimon be Pazi said the following statement in the name of Rebbe Yehoshua ben Levi who said it in the name of Bar Kappara: מנין לשומע כעונה – From where is it derived that listening is like responding and that one has fulfilled his chiyuv? For it is written: כל דברי הספר אשר קרא מלך יהודה – All the words of the scroll which the king of Yehudah read, referring to Yoshiyahu. Now was it Yoshiyahu that read the sefer? No, it was Shaphan who read them, as it is written, ויקראהו שפן לפני המלך – Shaphan then read it before the king? Rather it can be inferred from here that שומע כעונה – that listening is like responding. When the Gemara suggests that perhaps Yoshiyahu had read the sefer after Shaphan had read it, Rav Acha bar Yaakov answered that it is not so for it is written, \"יען רך לבבך ותכנע מפני ה' בשמעך\" – Because your heart is soft, and you humbled yourself before Hashem when you heard (the words of the scroll). The passuk says when you heard, and not: when you read."
      }
    ],
    "siman": {
      "title": "Chicken Soup (דבר לח)",
      "paragraph": "When the host interrupted his chicken soup meal when he saw that his lulav had arrived, he began reciting Hallel with Halleluyah upon which his guests responded in kind, except for the man who was busy enjoying his matzah ball, who merely listened as his form of response."
    }
  },
  {
    "daf": 39,
    "data": [
      {
        "id": 0,
        "title": "כל המצות כולן מברך עליהן עובר לעשייתן",
        "paragraph": "The Mishnah on Daf 38a stated: Where the minhag with Hallel is לברך יברך – to recite a berachah, one recites a berachah. Abaye said: לא שנו אלא לאחריו אבל לפניו מצוה לברך – They taught that the matter of making a berachah is a minhag only with regard to the one recited after Hallel, but with regard to the berachah recited before Hallel, there is an actual chiyuv to recite the berachah. For Rav Yehudah said in the name of Shmuel: כל המצות כולן מברך עליהן עובר לעשייתן – Regarding all of the mitzvos, one recites the berachah for them immediately before their performance.The Gemara asks which passuk indicates that the word עובר has the meaning of “before”? Rav Nachman bar Yitzchak said it is written, \"וירץ אחימעץ דרך הככר ויעבר את הכושי\" – Achimaatz ran by way of the plain and went before (ויעבר) the Cushi. Abaye said it is derived from \"הוא עבר לפניהם\" – Then he went before them, referring to Yaakov going before his wives and sons to greet Eisav. Or it can be derived from \"ויעבר מלכם לפניהם וה' בראשם\" – and their king goes before them, with Hashem at their head, referring to when the Moshiach goes before the Jewish people, and Hashem precedes all of them."
      },
      {
        "id": 1,
        "title": "נותן לו אתרוג במתנה בשביעית",
        "paragraph": "The next Mishnah states: הלוקח לולב מחבירו בשביעית נותן לו אתרוג במתנה – If one purchases a lulav during shemittah from his friend who is an am haaretz he must give him the esrog as a gift, לפי שאין רשאי ללוקחו בשביעית – because he is not permitted to purchase it from him during shemittah. The Gemara clarifies that a lulav that one buys in shemittah is the product of the sixth year since it grew primarily during the sixth year, whereas an esrog’s status is determined when it is picked, making it a product of shemittah. The Gemara asks what one should do if the am haaretz does not want to give him the esrog as a gift, and Rav Huna answered, מבליע ליה דמי אתרוג בלולב – He includes the cost of the esrog in the price of the lulav. Rashi explains that he should raise the price of the lulav to the point where he can give the esrog as a gift."
      },
      {
        "id": 2,
        "title": "אין מוסרין דמי פירות שביעית לעם הארץ",
        "paragraph": "The Gemara questions why the Mishnah forbids one to purchase an esrog outright and answers לפי שאין מוסרין דמי פירות שביעית לעם הארץ – Because one is not permitted to give an am haaretz money from the sale of shemittah produce, because he may use the money in a forbidden manner. Rashi explains that the Torah states that sheviis produce is \"לאכלה\" ולא לסחורה – for you to eat, and not to do commerce. This does not prohibit the produce from being sold. Rather, it teaches that the money, like the produce for which it was received, must be consumed, meaning spent on food or similar items during shemittah. An am haaretz is suspected of saving his money past this time. If one purchases produce from him, then he will be leading him to sin. For it was taught in a Baraisa: One is not permitted to give an am haaretz money from the sale of shemittah produce above the cost of purchasing three meals, and if he forgot and gave him more, he should say, הרי מעות הללו יהו מחוללין על פירות שיש לי בתוך ביתי – These shemittah monies that are now in the hands of the am haaretz should be deconsecrated on the non-shemittah produce that I have in my house, ובא ואוכלן בקדושת שביעית – and he (the chaver) comes and eats them in accordance to kedushas sheviis."
      }
    ],
    "siman": {
      "title": "Letter",
      "paragraph": "When the letter with the instructions to recite a berachah at the beginning of Hallel arrived, along with the shemittah lulav package that came with an esrog as a present, the man made sure to pay the am ha’aretz only enough to purchase three meals."
    }
  },
  {
    "daf": 40,
    "data": [
      {
        "id": 0,
        "title": "Why a lulav has kedushas sheviis even though wood does not",
        "paragraph": "The Gemara notes that the reason a lulav may be purchased from an am haaretz during shemittah is because it is a product of the sixth year that entered the seventh, which implies הא דשביעית קדוש – that a lulav that is a product of the seventh year has kedushas sheviis. Why should this be so? עצים בעלמא הוא ועצים אין בהן משום קדושת שביעית – A lulav is mere wood, not produce, and wood has no kedushas sheviis. The Gemara answers that the passuk states that the produce of the land during sheviis is \"לכם לאכלה\" – for you to eat. “For you” implies for any need, whereas “to eat” seems to restrict its use to food. Therefore, it must be understood to mean \"לכם\" דומיא ד\"לאכלה\" – the larger uses permitted by לכם must be similar to those of the phrase לאכלה. This teaches the only uses permitted are מי שהנאתו וביעורו שוה – those whose benefit coincides with the consumption of the produce. Rashi brings the examples of anointing, drinking, and burning oil in a lamp, where the oil or drink are being consumed as they provide benefit. Only such items have kedushas sheviis. This would exclude wood from kedushas sheviis, whose benefit comes after its consumption, meaning when it is already reduced to coals. A lulav’s typical use as a broom has its benefit and consumption, meaning it gets worn down, at the same time, making it subject to kedushas sheviis."
      },
      {
        "id": 1,
        "title": "Machlokes how shemittah produce is מתחללת",
        "paragraph": "It was taught on Daf 39 that kedushas sheviis can attach onto money that was given in payment for shemittah produce. Rebbe Elazar said: אין שביעית מתחללת אלא דרך מקח – Shemittah produce cannot be מתחללת, meaning impart its kedushah to money or produce exchanged for it, except by way of purchase. Rebbe Yochanan said: בין דרך מקח בין דרך חילול – It can be imparted both by way of purchase and by way of deconsecration. Rashi explains that one would say, “This produce should be מחוללין onto these monies”. Rebbe Elazar’s reason is that the passuk states, \"בשנת היובל הזאת\" – In this Yovel year, and next to it the passuk states, \"וכי תמכרו ממכר\" – When you shall make a sale. This teaches that kedushas sheviis can only be imparted through purchase. Rebbe Yochanan’s reason is that the passuk states \"כי יובל היא קדש\" – For it is Yovel, it shall be holy. The use of the term kodesh in connection with Yovel and shemittah teaches that just as a kodesh item can be deconsecrated both by way of purchase and by way of chillul, אף שביעית בין דרך מקח וממכר בין דרך חילול – so too shemittah produce can impart its kedushah via purchase or chillul."
      },
      {
        "id": 2,
        "title": "בוא וראה כמה קשה אבקה של שביעית",
        "paragraph": "The Gemara asks what then does Rebbe Yochanan do with the passuk, \"וכי תמכרו ממכר\" – When you shall make a sale, and answers that he needs it for the source of the teaching of Rebbe Yose bar Chanina, for a Baraisa taught: Rebbe Yose bar Chanina said: בוא וראה כמה קשה אבקה של שביעית – Come and see how harsh is the dust of the prohibition of sheviis, for if a man does business with the produce of the shemittah year, hoping to profit thereby, in the end, poverty will force him to sell his מטלטלין וכלים, as it is stated, \"בשנת היובל הזאת תשבו איש אל אחזתו\" – In this Yovel year, you shall return each to his ancestral heritage, and next to this the Torah states: \"וכי תמכרו ממכר עמיתך – When you shall make a sale to your fellow or make a purchase from the hand of your fellow. The words “the hand” imply that the passuk speaks of selling מטלטלין, and the juxtaposition of this to the preceding passuk teaches that one will become pressed to sell these objects because of his failure to observe the halachos of shemittah."
      }
    ],
    "siman": {
      "title": "Pool",
      "paragraph": "The lifeguard who used a lulav broom with kedushas sheviis to sweep around the pool deck, found monies with kedushas sheviis, right next to a poor shemittah violator who was trying to sell his מטלטלין to some of the pool guests."
    }
  },
  {
    "daf": 41,
    "data": [
      {
        "id": 0,
        "title": "The source for making a זכר למקדש",
        "paragraph": "The next Mishnah states: בראשונה היה לולב ניטל במקדש שבעה – Originally, in the days of the Beis Hamikdash, the lulav was taken in the Temple all seven days of Succos, ובמדינה יום אחד - and in the provinces on only one day, being the first day. When the Beis Hamikdash was destroyed, Rabban Yochanan ben Zakkai instituted that the lulav be taken in the provinces all seven days of Succos, זכר למקדש – as a remembrance of the Beis Hamikdash. The Gemara asks for the source that we are bidden to make a זכר למקדש, and Rebbe Yochanan said that it states in Yirmiyahu, For I will make a cure for you, and from your wounds I will heal you – the word of Hashem; כי נדחה קראו לך – for they, (referring to the nations of the world), called you “Discarded One,” ציון היא דרש אין לה – saying, “She is Tziyon, there is none who seek her.” From the words \"דרש אין לה\" – there is none who seek her, מכלל דבעיא דרישה – it is implied that she requires seeking. Rabban Yochanan ben Zakkai determined that the way to fulfill this is through performing the mitzvah of lulav the way it was done in the Beis Hamikdash."
      },
      {
        "id": 1,
        "title": "2.שיהא יום הנף כולו אסור",
        "paragraph": "The Mishnah stated that Rabban Yochanan ben Zakkai also instituted שיהא יום הנף כולו אסור – that the entire Day of Waving, referring to the waving of the Omer, should be forbidden for eating from חדש – the new crop of grain. Rashi explains that when the Omer is brought, chadash is only permitted afterwards, but when there is no Beis HaMikdash and omer offering, it is permitted immediately upon daybreak of the sixteenth. The Gemara teaches that were it not for Rabban Yochanan ben Zakkai’s institution, in the time when their will be a Beis HaMikdash, people will say, “Last year, on the sixteenth of Nissan, did we not become permitted to eat from the chadash upon daybreak? Now, too, let us eat at daybreak, and they would not realize that now that the Beis Hamikdash stands, it is the bringing of the Omer that permits it.  The Gemara seeks to clarify the day Rabban Yochanan ben Zakkai was concerned that the Temple would be rebuilt, since if it was built on the sixteenth of Nissan, people could eat the chadash at daybreak, and if it was built on the fifteenth or earlier, it would become permissible to eat from midday onward, after the omer was brought. The Gemara concludes that the case is when the Temple was rebuilt the night of the sixteenth or just before shkiyah on the fifteenth, which might cause a delay for it to be brought on the sixteenth. Rashi clarifies that even though the Temple is not permitted to be rebuilt at night or on Yom Tov, the restrictions only apply to human construction. However, the Third Temple will miraculously descend intact from Heaven, as it says in the passuk, מקדש ה' כוננו ידיך – the Mikdash, My Master, that Your Hand established."
      },
      {
        "id": 2,
        "title": "3.מתנה על מנת להחזיר שמה מתנה",
        "paragraph": "A Baraisa was brought that states that a person cannot fulfill his chiyuv of lulav on the first day of Yom Tov with his friend’s lulav אלא אם כן נתנו לו במתנה – unless the latter gave it to him as a gift, and brings an incident where Rabban Gamliel, who was travelling on a boat with other Rabbanon, gave his lulav worth  a thousand zuz, to the other Rabbanan to use, each one gifting the lulav to the next one, and then Rebbe Akiva, who used it last, returned it. The Tanna is coming to teach that, מתנה על מנת להחזיר שמה מתנה – a gift granted on condition that it be returned, is legally considered a gift. Rava taught that if one did not return the lulav afterwards, he has not fulfilled his chiyuv. Since he didn’t fulfill the condition, it is clarified retroactively that the gift was void and that he used a stolen lulav."
      }
    ],
    "siman": {
      "title": "Grandma",
      "paragraph": "The Grandma who loved to seek out ways to do a  זכר למקדש  proudly bentched lulav for seven days straight and gave her special Chadash bowl as a gift to friends to be used after the sixteenth of Nissan, on condition they return it."
    }
  },
  {
    "daf": 42,
    "data": [
      {
        "id": 0,
        "title": "Taking the lulav beshogegg into reshus harabim",
        "paragraph": "Rebbe Yose stated in the Mishna on Daf 41b, that if the first day of Succos fell on Shabbos, and one inadvertently carried the lulav into reshus harabim, he is not chayav a chatas, מפני שהוציאו לו ברשות – because he carried it out with permission to do a mitzvah. Rashi explains that he was preoccupied in doing a mitzvah, thinking about it, and rushing to do it, and Rebbe Yose holds טועה בדבר מצוה פטור – one preoccupied with a mitzvah is patur. Abaye said לא שנו אלא שלא יצא בו – The Mishnah refers only to where he has not yet fulfilled his chiyuv of lulav at the time he carries it out, but if he had, he would be chayav. The Gemara challenges Abaye, since from the moment he picks up the lulav he has fulfilled his chiyuv with it. If Abaye is correct, then when would Rebbe Yose ever rule that one is patur? Abaye answered: כשהפכו – in a case where one inverted it, meaning he picked up the lulav upside down. Rava said that you may even say where he did not invert it. Rebbe Yose’s case would be where he carried it out in a kli. The Gemara asks that Rava is the one who holds, לקיחה על ידי דבר אחר שמה לקיחה – that taking by means of something else is considered a valid “taking”. The Gemara answers that that is only when it is דרך כבוד, not דרך בזיון – in a disrespectful way."
      },
      {
        "id": 1,
        "title": "When one is chayav to have a child start certain mitzvos",
        "paragraph": "The next Mishnah states, קטן היודע לנענע חייב בלולב – A child who knows how to wave the lulav, is chayav in the mitzvah. In addition to that, a Baraisa taught, להתעטף חייב בציצית – a child who knows how to wrap himself, is chayav in tzitzis, לשמור תפילין אביו לוקח לו תפילין – If he knows how to guard the kedushah of tefillin properly, his father buys tefillin for him, יודע לדבר אביו לומדו תורה וקריאת שמע – If he knows how to talk, his father teaches him Torah and krias shema. The Gemara asks what is meant here by “Torah” and Rav Hamnuna said: It means that the father teaches the child the passuk: \"תורה צוה לנו משה מורשה קהלת יעקב\" – The Torah that Moshe commanded us is the heritage of Kehillas Yaakov. Krias Shema here, means פסוק ראשון – the first passuk."
      },
      {
        "id": 2,
        "title": "לולב וערבה ששה ושבעה",
        "paragraph": "The first Mishnah in the fourth perek states: לולב וערבה ששה ושבעה – The mitzvos of lulav and aravah are performed in the Beis Hamikdash for six or seven days. Under what circumstances is the lulav performed for seven days? יום טוב הראשון של חג שחל להיות בשבת – When the first day of the chag falls on Shabbos, the lulav is taken for seven days. ושאר כל הימים ששה – But when the first day falls on any of the other days of the week, the lulav is taken for only six days. For the chiyuv of lulav is not docheh a Shabbos that falls on of the final six days of Succos. The Gemara asks why it should be forbidden to take the lulav in the Beis Hamikdash, טלטול בעלמא הוא ולידחי שבת – The only concern is handling the lulav, which is a muktzeh prohibition, and since it does not involve a d’Oraysa, let this mitzvah be docheh Shabbos? Rabbah answered, גזרה שמא יטלנו בידו וילך אצל בקי ללמוד – the Rabbanon were gozeir against taking a lulav onShabbos, lest one take it in his hand and go to an expert to learn the halachos, ויעבירנו ארבע אמות ברשות הרבים – and inadvertently carry it dalet amos in reshus harabim. The Gemara adds that this is the same reason against blowing the shofar on a Rosh Hashana that falls on Shabbos, and for the decree against reading the Megillah on a Purim that falls on Shabbos."
      }
    ],
    "siman": {
      "title": "Mobster",
      "paragraph": "The mobster who was poked by the man who inadvertently carried his lulav upside down as he walked into reshus harabim, got poked again by kids passing by who were shaking their lulavim while singing תורה צוה לנו משה as they headed four amos towards the neighborhood baki to learn the halachos."
    }
  },
  {
    "daf": 43,
    "data": [
      {
        "id": 0,
        "title": "ביום\" ואפילו בשבת\"",
        "paragraph": "The Gemara brought a Baraisa that taught ואפילו בשבת \"ביום\" – the words “on that day”, of the phrase “on the first day,” teach that the mitzvah of lulav is performed even on Shabbos. The Gemara asks that since the only relevant prohibition is טלטול בעלמא – the mere handling of the lulav, which is a d’Rabbanon muktzeh prohibition, why would a passuk be needed to permit it, since d’Oraysa it is permitted to handle the lulav? Rava answered that the passuk is coming to permit the performance of מכשירי לולב – the preliminaries of the mitzvah of lulav, some of which violate Shabbos mid’Oraysa, such as cutting the lulav from the tree, or binding it with the other minim. This is in accordance with Rebbe Eliezer who holds לולב וכל מכשיריו דוחין את השבת – The mitzvah of lulav and all of its preliminaries are docheh Shabbos, based on the passuk \"ביום\" ואפילו בשבת. The Rabbanon, who prohibit מכשירי לולב on Shabbos, learn from the passuk \"ביום\" that the mitzvah of lulav is only by day, and not at night."
      },
      {
        "id": 1,
        "title": "Why the aravah ceremony is docheh Shabbos on the seventh day of Succos",
        "paragraph": "The Gemara asks why the aravah ceremony performed in the Beis Hamikdash is docheh Shabbos on the seventh day of Succos, and Rebbe Yochanan said: כדי לפרסמה שהיא מן התורה – in order to publicize the fact that it is a d’Oraysa. When the Gemara asks why there is not a gezeirah prohibiting it, lest one carry it dalet amos in a reshus harabim, like there is for the lulav, the Gemara answers, ערבה שלוחי בית דין מייתי לה – in the case of the aravah, the agents of beis din bring the branches to the Temple courtyard, which Rashi clarifies, is done erev Shabbos, and the mitzvah is then done by only the Kohanim. Whereas לולב לכל מסור – Lulav is given to everyone to do, and therefore, there is a greater likelihood that one will inadvertently transgress. When the Gemara then suggests that the aravah should be docheh Shabbos on the first day of Yom Tov, it answers לא מוכחא מילתא – that in that case, it would not be apparent that it is the aravah ceremony that is docheh Shabbos. People will say it is the mitzvah of lulav that is docheh Shabbos, and the aravah obligation is merely accompanying it."
      },
      {
        "id": 2,
        "title": "Machlokes regarding how the aravah ceremony is performed",
        "paragraph": "The Gemara brings a machlokes regarding how the aravah ceremony is done. Rav Yosef holds that the whole ceremony is done בזקיפה, by standing the aravos up around the mizbayach. Abaye holds that the ceremony first entails נטילה, taking the aravos in hand and circling the mizbayach, which is then followed by standing the branches up around the mizbayach. After Abaye's first two attempts in challenging Rav Yosef are unsuccessful, he brings a Baraisa that relates the following incident. One time, the seventh day of the aravah ceremony fell on Shabbos and shoots were brought erev Shabbos and placed in the chatzeir. The בייתוסין, who denied תורה שבעל פה, came and hid them beneath rocks, knowing that the Rabbanon would not move rocks on Shabbos. The next day, some amei haaretz realized what had been done, and not knowing of the muktzeh prohibition, they extracted them from beneath the rocks, and the Kohanim brought them and stood them up at the sides of the mizbayach. Why did the בייתוסין behave this way? לפי שאין בייתוסין מודים שחיבוט ערבה דוחה את השבת – Because they did not admit that waving the aravah is docheh Shabbos. We see from here  that the aravah obligation is performed by taking the branches in hand, and not simply standing them around the mizbayach."
      }
    ],
    "siman": {
      "title": "Magazine",
      "paragraph": "The Succos magazine found by a yid cutting a lulav off a tree on Shabbos, featured a cover story “Why Aravos are Docheh Shabbos on the Seventh Day”, with a picture of Kohanim taking the aravos in hand and then placing them around the mizbayach."
    }
  },
  {
    "daf": 44,
    "data": [
      {
        "id": 0,
        "title": "Do כהנים בעלי מומין take the aravah as well?",
        "paragraph": "Reish Lakish said: כהנים בעלי מומין נכנסין בין האולם ולמזבח כדי לצאת בערבה – Blemished Kohanim may enter the area between the Ulam and the mizbayach in order to fulfill the chiyuv of aravah. Rashi explains that even though they are generally forbidden to enter this area, Reish Lakish holds that they are chayav in aravah. Therefore, they also take the aravah in hand, and crowd in among the Kohanim to make their way around the mizbayach. Rebbe Yochanan asked “Who said this?” which is understood to mean, who said that the chiyuv is with fulfilled with נטילה, by taking the aravah and walking around the mizbayach, in which case כהנים בעלי מומים would have to do it, as well? Perhaps it is fulfilled with זקיפה, by standing the aravos up at the sides of the mizbayach, in which case it can be performed by one Kohen on behalf of all the others. And even you say that it must performed with נטילה, who said that it must be performed by כהנים בעלי מומין? דלמא בתמימים – Perhaps it is only performed by unblemished Kohanim. Tosafos explains that it is reasonable that the Halachah leMoshe MiSinai only applies to those that are fit for avodah."
      },
      {
        "id": 1,
        "title": "ערבות – יסוד נביאים או מנהג נביאים",
        "paragraph": "Regarding the aravah obligation, Rebbe Yochanan and Rebbe Yehoshua ben Levi disagree. One said that the aravah obligation is יסוד נביאים – an enactment of the nevi’im, and the other says it is מנהג נביאים, a custom of the nevi’im. Rashi explains that a יסוד נביאים means that it was enacted by the latter prophets, Chaggai, Zecharya and Malachi, who insituted a number of Rabbinic enactments during the time of the Anshei Knesses Hagadolah. מנהג נביאים means that they merely instituted  the customary performance of the aravah ceremony. The nafka minah between them is that there is no berachah for a מנהג נביאים since the word \"וצונו\" – \"Who has commanded us\" cannot be said. It can be recited in the case of the יסוד הנביאים since listening to the Rabbanon is a mitzvah from the Torah. The Gemara goes on to clarify that Rebbe Yochanan holds that the aravah ceremony in the Beis Hamikdash is Halachah leMoshe MiSinai, whereas the aravos done in the provinces on the seventh day is an enactment of the nevi’im."
      },
      {
        "id": 2,
        "title": "The aravah is taken alone",
        "paragraph": "Rebbe Ami said: ערבה צריכה שיעור ואינה ניטלת אלא בפני עצמה ואין אדם יוצא ידי חובתו בערבה שבלולב – The aravah requires a minimum shiur, and it may only be taken alone, and a person cannot fulfill his chiyuv with the aravah that is in the lulav. Rashi explains that it must be taken alone with nothing else bound to it, so that it will be apparent that it is being taken to fulfill the mitzvah of aravah. When the Gemara questions Rebbe Ami’s need to state that it cannot be taken with the lulav, given that he already said that it must be taken alone, it answers that if he had only said that it must be taken alone, one might have thought that this is in a case where one did not lift the lulav once and then lift it again, but where one lifted the lulav once and then lifted it again לשם ערבה, perhaps Rebbe Ami’s rule does not apply. Therefore, Rebbe Ami is coming to teach that even if this manner, the chiyuv cannot be fulfilled with the aravah in the lulav. But Rav Chisda said in the name of Rebbe Yitzchak אדם יוצא ידי חובתו בערבה שבלולב – A person may fulfill his chiyuv with the aravah that is in the lulav, (that is, provided that he lifted it two times)."
      }
    ],
    "siman": {
      "title": "Mud",
      "paragraph": "The Kohen bal mum with mud on his garments, was dreaming of the day that he’ll be able to take the aravos around the mizbayach, as he held the aravos on the seventh day in his shul according to the מנהג הנביאים, making sure not to take the aravos in his lulav."
    }
  },
  {
    "daf": 45,
    "data": [
      {
        "id": 0,
        "title": "The eleven amah aravos were placed on the יסוד of the mizbayach",
        "paragraph": "The next Mishnah states regarding the aravos in the Beis Hamikdash, that after the aravos were gathered from Motza, ובאין וזוקפין אותן בצדי המזבח – the Kohanim would come and stand them up at the sides of the mizbayach, וראשיהן כפופין על גבי המזבח – and their tips would be bent over the top of the mizbayach. It was taught in a Baraisa: רבות וארוכות וגבוהות אחד עשר אמה – The aravos were many, and long, and they were cut to stand eleven amos high, כדי שיהו גוחות על המזבח אמה – so that they would be leaning over the mizbayach an amah. Meriemar said in the name of Mar Zutra, that we learn from this Baraisa that they were placed upon the base of the mizbayach, for if they were placed on the ground, they would brush the roof  given that the mizbayach is nine amos high and has two protrusions of an amah each for the יסוד and the סובב. To accommodate the two protrusions, it would be necessary to place the aravos against the mizbayach at an angle. If the tips then extend an amah inward over the mizbayach, they will surely brush the roof."
      },
      {
        "id": 1,
        "title": "אסרו חג בעבתים עד קרנות המזבח",
        "paragraph": "Rebbe Abahu taught the source which teaches that the aravos must rise above the mizbayach. It is derived from the passuk, \"אסרו חג בעבתים עד קרנות המזבח\" – circle (the mizbayach) on the chag with (aravah) branches (that reach) to the horns of the mizbayach. We see from this passuk that the branches must reach the mizbayach’s horns. It follows, that since the קרנות rise above the roof of the mizbayach, the aravos too much reach above its roof. Rebbe Yirmiyah said in the name of Rebbe Shimon bar Yochai, and Rebbe Yochanan said in the name of Rebbe Shimon Hamachuzi, who said in the name of Rebbe Yochanon Hamakose, כל העושה איסור לחג באכילה ושתיה מעלה עליו הכתוב כאילו בנה מזבח והקריב עליו קרבן – Whoever joins the chag to eating and drinking, the passuk regards him as if he built a mizbayach and brought a korban on it, as it is stated, \"אסרו חג בעבתים עד קרנות המזבח\" – Join the chag to (consumption) of fattened beasts – it is as (blood) to the horns of the mizbayach. Rashi says that the word בעבתים derives from the word עב, meaning thick. There are some that say the passuk is referring to the day after the chag, known as issru chag."
      },
      {
        "id": 2,
        "title": "ל'ו צדיקים",
        "paragraph": "It was said in the name of Rebbe Shimon bar Yochai, ראיתי בני עלייה והן מועטין – I have seen the people of the highest level and they are few. If they are a thousand, I and my son are among them. If they are a hundred, I and my son are among them. If they are two, they are myself and my son. The Gemara asks if there are so few at the highest level, given that Rava had said that there are eighteen thousand rows of tzadikim standing before HaKadosh Boruch Hu, and answers that Rebbe Shimon bar Yochai was referring to those דמסתכלי באספקלריא המאירה – that view the Shechinah through a clear screen, whereas Rava’s statement was referring to those that do not. The Gemara questions if there are so few that can see through a clear screen, given Abaye’s statement that there are no less than thirty-six tzadikim that receive the Shechinah every day, as it says in the passuk \"אשרי כל חוכי לו\" – praiseworthy are all who await Him, לו is the gematria of thirty-six. The Gemara answers that Abaye is referring to those that enter with permission, whereas Rebbe Shimon ben Yochai is referring to those who may enter without permission."
      }
    ],
    "siman": {
      "title": "Monopoly",
      "paragraph": "The festive monopoly board that featured eleven amah aravos placed around it, was brought out only on issru chag, for the thirty-six best behaved children to play with in turns."
    }
  },
  {
    "daf": 46,
    "data": [
      {
        "id": 0,
        "title": "How many times one makes a לישב בסוכה",
        "paragraph": "On Daf 45b a machlokes was brought regarding the berachos recited for the mitzvos of lulav and succah, and Rebbe Yochanan ruled that a berachah is recited on the succah on all seven days. The Gemara challenges this, based on a Baraisa that taught that when one enters the succah during the chag to sit in it, he makes the berachah of לישב בסוכה, וכיון שבירך יום ראשון שוב אינו מברך – and once he has recited this berachah on the first day of the chag, he does not recite the berachah on the subsequent days. The Gemara answers that the question of whether a berachah on the succah is recited all seven days, is dependent on a machlokes Tannaim regarding tefillin. For it was taught in a Baraisa, תפילין כל זמן שמניחין מברך עליהן דברי רבי – Rebbe said that tefillin, every time one dons them, one recites a berachah over them. And the Chochomim say, אינו מברך אלא שחרית בלבד – one recites a berachah in the morning only, no more than once a day. We see that according to Rebbe, one recites multiple berachos in a single day. Similarly, Rebbe Yochanan holds, that although all seven days of Succos are regarded as one long “day”, since the succah obligation is day and night, one recites berachos all seven days."
      },
      {
        "id": 1,
        "title": "היו לפניו מצות הרבה",
        "paragraph": "It was taught in a Baraisa, היו לפניו מצות הרבה אומר \"ברוך אתה ה'...וצונו על המצות\" – If there are many mitzvos before a person to be performed, which Rashi explains could mean one who is ready to take a lulav, dwell in a succah, don tefillin and wrap himself in a tallis, he recites a berachah “and has commanded us regarding His mitzvos\". Rebbe Yehudah says that he recites a berachah over each and every mitzvah individually. Rebbe Zeira said, and some say that it was Rebbe Chanina bar Pappa who said, that Rebbe Yehudah’s reason is based on the passuk, \"ברוך ה' יום יום\" – Blessed is Hashem day by day. Now can it mean that we bless Hashem only by day and not by night? Surely not. Rather, the passuk is coming to say that בכל יום ויום תן לו מעין ברכותיו – on every single day, give Him the berachah appropriate for that day. Rashi explains that on Shabbos we recite a berachah appropriate to Shabbos, and on Yom Tov we recite a berachah that is appropriate for it. Here too, with regard to various mitzvos, בכל דבר ודבר תן לו מעין ברכותיו – for each and every mitzvah, give Him the appropriate berachah for that matter, and do not group the berachos together."
      },
      {
        "id": 2,
        "title": "When do the esrog and succah become permitted for mundane use?",
        "paragraph": "The Gemara brings a machlokes regarding when the esrog and succah are permitted for mundane use. Rebbe Yochanan said: אתרוג בשביעי אסור בשמיני מותר סוכה אפילו בשמיני אסורה – An esrog is forbidden for use as food on the seventh day after one has fulfilled his chiyuv with it, whereas on Shemini Atzeres, it is permitted. A succah, however, is forbidden for use as firewood even on the eighth day. Reish Lakish said: אתרוג אפילו בשביעי נמי מותר – An esrog, even on the seventh day is permitted. The Gemara explains what the point of contention is between them. Reish Lakish holds למצותה אתקצאי – the esrog was set aside only for the performance of the mitzvah. As soon as one concludes the mitzvah, the esrog may be eaten. Rebbe Yochanan holds: לכולי יומא אתקצאי – the esrog was set aside for the entire day.  Since the esrog was prohibited when the day began, it remains prohibited the entire day. Rebbe Yochanan understands the Mishnah permitting the adults to eat the children’s esrogim on the seventh day as only applying to the children’s esrogim, which were not designated for a full-fledged mitzvah, but only for chinuch."
      }
    ],
    "siman": {
      "title": "Cow",
      "paragraph": "The cowboy who loved to ring his cow’s cowbell every time he made a berachah when he entered the succah, started ringing it repeatedly when he saw his lulav, tefillin and tallis in there too, and got so distracted he accidently took a bite out of his esrog when he wasn’t allowed to."
    }
  },
  {
    "daf": 47,
    "data": [
      {
        "id": 0,
        "title": "שמיני ספק שביעי",
        "paragraph": "At the bottom of Daf 46b, Rav Yehudah brei d’Rav Shmuel said in the name of Rav, regarding dwelling in a succah in galus, שמיני ספק שביעי שביעי לסוכה ושמיני לברכה – The eighth day that is possibly the seventh day, is treated as the seventh day regarding the succah and as the eighth day regarding the berachah for Yom Tov, which Rashi explains means that one mentions יום השמיני חג העצרת הזה in the Amidah, Bircas Hamazon and Kiddush. But Rebbe Yochanan says: שמיני לזה ולזה – It is treated as the eighth day regarding both the succah and the berachah. On our Daf, in the Gemara’s second interpretation of the machlokes, everybody agrees that we do not recite the berachah of לישב בסוכה. They only disagree with respect to dwelling in the succah on the eighth day. According to Rav Yehudah in the name of Rav, who said that it is treated as the seventh day regarding the succah, we do dwell in the succah on that day. But according to Rebbe Yochanan, who said that it is treated as the eighth day regarding both the succah and the berachah, we do not dwell in the succah. The Ritva explains that Rebbe Yochanan holds that the very act of dwelling in the succah (even without the berachah) indicates that the day is possibly the seventh day of Succos, which is only Chol HaMoed, and thus might cause people to treat the Yom Tov more lightly. The Gemara concludes that the halachah is that we dwell in the succah on the eighth day but do not recite a לישב בסוכה."
      },
      {
        "id": 1,
        "title": "אומרים זמן בשמיני של חג ואין אומרים זמן בשביעי של פסח",
        "paragraph": "Rebbe Yochanan said: אומרים זמן בשמיני של חג ואין אומרים זמן בשביעי של פסח – We recite a Shehechiyanu on Shemini Atzeres but not on the seventh day of Pesach. Rebbe Levi bar Chama said, and others say it was Rebbe Chama bar Chanina, that Shemini Atzeres is considered a separate holiday שהרי חלוק בשלשה דברים – because it is different from the seven days of Succos that precede it, in three ways: בסוכה ולולב וניסוך המים – in regard to succah, lulav and the water libations. The Gemara asks that שביעי של פסח should requires a Shehechiyanu as well, since it is different from the first day of Pesach in that there is no mitzvah to eat matzah, like the first night. The Gemara answers, that while it is different from the first night of Pesach, it is not different from the first day of Pesach, when there is no chiyuv to eat matzah, as opposed to Shemini Atzeres, which is different even from the first day. Ravina said, זה חלוק משלפניו וזה חלוק משלפני פניו – This eighth day is different from the day immediately preceding it, whereas the seventh day of Pesach is only different from a day which is prior to the days that precede it, meaning, the first day."
      },
      {
        "id": 2,
        "title": "Shemina Atzeres also requires לינה, tarrying overnight",
        "paragraph": "It was taught in a Baraisa that Rebbe Yehudah said, that just as the seven days of Succos require קרבן שיר ברכה ולינה, - bringing a korban, the shir by the Leviim, its own beracha, and tarrying overnight, so too Shemini Atzeres requires the same. The Gemara questions whether Shemini Atzeres requires לינה, based on a Baraisa where Rebbe Yehudah said that Pesach Sheini does not require לינה, since the passuk, ופנית בבקר והלכת לאהלך – and you may turn back in the morning and go to your tents, is juxtaposed to the next passuk, \"ששת ימים תאכל מצות\" – for six days you shall eat matzos. Only that which requires an observance of six days, requires לינה. The Gemara suggests that this would also exclude Shemini Atzeres, but then answers that it only excludes Pesach Sheini, which is similar to Pesach Rishon. Rashi says that since the passuk discusses Pesach, the exclusion is only to another Pesach-like holiday."
      }
    ],
    "siman": {
      "title": "Maze",
      "paragraph": "To make it through the Succos “Escape the Maze” participants in the Diaspora had to all agree whether they should sit in the succah on the eighth day, while making a Shechiyanu on Shemini Atzeres and not on Shevii shel Pesach, and then sleep in sleeping bags and tarry overnight."
    }
  },
  {
    "daf": 48,
    "data": [
      {
        "id": 0,
        "title": "The source of the chiyuv of simchah on Shemini Atzeres",
        "paragraph": "The next Mishnah teaches that one is chayav in Hallel, simchah, referring to the eating of shelamim meat, and in kavod of the final day of the chag, referring to Shemini Atzeres, just like all other days of the chag. The Gemara asks for the source for rejoicing on the eighth day? Rashi explains the question, that the chiyuv of simchah is stated explicitly only with regard to the seven days of Succos, as it is written: חג הסוכות תעשה לך – Make for yourselves a festival of Succos for seven days, and next to it the passuk states: ושמחת בחגך – and you shall rejoice on your chag. The Gemara answers that it was taught in a Baraisa, that in reference to the rejoicing on Succos it is written: \"והיית אך שמח\" – and you shall be nothing but joyous. לרבות לילי יום טוב האחרון - This comes to include the final night of Yom Tov, meaning Shemini Atzeres, in the rejoicing of the previous seven days. The Baraisa asks that maybe the passuk is meant only to include the first night of the chag, and answers: כשהוא אומר \"אך\" חלק – When the Torah states “but,” it qualifies the content of the passuk and teaches only one of these times, referring to the last day, is designated a “time of simchah.” The last night is included שיש שמחה לפניו – because it is preceded by other days of simchah, and the first day is excluded since it is not preceded by days of simchah."
      },
      {
        "id": 1,
        "title": "ושאבתם מים בששון",
        "paragraph": "The third Mishnah on the Daf describes how ניסוך המים, the water libation, was performed with the morning tamid during the seven days of the chag. A member of the group from the Beis Hamikdash would fill a golden flask, with a capacity of three lugin, from the Shiloach. הגיעו לשער המים - When they returned and reach the Water Gate, which Rashi explains was one of the southern  gates of the Temple courtyard and called the שער המים because the person entered through this gate with the flask of water, תקעו והריעו ותקעו – they sounded a tekiah, a teruah, and a tekiah. The Gemara seeks the source for the blowing of the trumpets, and Rav Eina said: For it states in the passuk, \"ושאבתם מים בששון ממעיני הישועה\" – And you shall draw water with rejoicing from the wellsprings of salvation. The Gemara brings an incident with a heretic named Sasson  who told Rebbe Abahu that the Jewish people are destined to draw water for him in Olam Haba, as it says, \"ושאבתם מים בששון\". Rebbe Abahu responded that if the passuk had said לששון – to Sasson, perhaps it could be interpreted that way. But the passuk says \"בששון\" – and you shall draw water with Sasson, which means that your skin will be made into a canteen and will be used for water drawing."
      },
      {
        "id": 2,
        "title": "Three things that the Kohen ascends the ramp on the left side",
        "paragraph": "It was taught in a Baraisa: All who ascend the ramp to the mizbayach ascend toward the right, go around the mizbayach, and then descend on the left side of the ramp, חוץ מן העולה לשלשה דברים הללו שעולין דרך שמאל וחוזרין על העקב – except for one who ascends for these three things, who would ascend the ramp toward the left, and then after performing the task, descend the way they had come. The three things are: ניסוך המים וניסוך היין ועולת העוף כשרבתה במזרח – the water libation, the wine libation, and the blood of the bird olah when there were too many bird olos, and thus too many Kohanim on the east side of the mizbayach. Rashi explains that these items might be adversely affected from the smoke of the mizbayach if the Kohen took the regular route around the mizbayach which is more than 100 amos long. Water and wine might absorb the smoke and become passul and the bird olah might die."
      }
    ],
    "siman": {
      "title": "Brainiacs",
      "paragraph": "The Brainiacs who tried to predict whether their neighbors in the next succah would still be singingושמחת בחגך  on the eighth day, based on their trumpet blowing frequency for the tune of ושאבתם מים בששון the first seven days, also tested the damaging limits of smoke absorption in water and wine and smoke inhalation in sacrificial birds."
    }
  },
  {
    "daf": 49,
    "data": [
      {
        "id": 0,
        "title": "שיתין מששת ימי בראשית נבראו",
        "paragraph": "The Gemara brings sources that the shisin, into which the libations flowed, existed from the beginning of Creation. Rabbah bar bar Chanah said in the name of Rebbe Yochanan: שיתין מששת ימי בראשית נבראו – The shishin have existed since the six days of Creation. This is alluded in the passuk: חמוקי ירכיך כמו חלאים מעשה ידי אמן – Your concealed flanks are like jewels, the handiwork of a master craftsman. \"Your concealed flanks\" allude to the shisin that are at the foot (yerech) of the mizbayach, and the words \"are like jewels\" (chala’im) teaches that they are מחוללין ויורדין עד התהום – hollow and descend to the depths. The words \"the handiwork of a master craftsman\" is referring to the handiwork of the craftsmanship of Hakadosh Boruch Hu. It was taught in the academy of Rebbe Yishmael: The Torah begins with the word \"בראשית\" – אל תקרי \"בראשית\" אלא ברא שית – Do not pronounce it “Bereishis” (in the beginning) but rather “bara shis” (He created shis). Another Baraisa disputes this, maintaining that the shishin were manmade excavations."
      },
      {
        "id": 1,
        "title": "בשלשה דברים גדולה גמילות חסדים יותר מן הצדקה",
        "paragraph": "It was taught in a Baraisa: בשלשה דברים גדולה גמילות חסדים יותר מן הצדקה – Acts of kindness are greater than tzedakah in three matters: (1) צדקה בממונו גמילות חסדים בין בגופו בין בממונו – Tzedakah is done only with one’s money . Acts of kindness are performed both, with his body and with his money. Rashi brings the examples of giving a hesped for a meis, being mesameach a chosson, or escorting a friend on a trip. (2) צדקה לעניים גמילות חסדים בין לעניים בין לעשירים – Tzedakah is given only to the poor, whereas acts of kindness are performed for both the poor and the rich. (3) צדקה לחיים גמילות חסדים בין לחיים בין למתים – Tzedakah is only performed for the living, whereas acts of kindness are performed for both the living and the dead."
      },
      {
        "id": 2,
        "title": "ותורת חסד על לשונה",
        "paragraph": "Rebbe Elazar said: What is meant by that which is written in the passuk: \"פיה פתחה בחכמה ותורת חסד על לשונה\" – She opens her mouth with wisdom and the Torah of kindness is upon her tongue. Now, is there a Torah of chesed and a Torah that is not chesed? אלא תורה לשמה זו היא תורה של חסד – Rather, the distinction is that Torah learned for its own sake is referred to as a Torah of chesed, whereas Torah learned שלא לשמה – not for its own sake, is not referred to as a Torah of chesed. There are those who say that the distinction is as follows: תורה ללמדה זו היא תורה של חסד שלא ללמדה זו היא תורה שאינה של חסד – Torah that is learned with the intention of teaching it to others, is referred to as a Torah of chesed. However, Torah that is learned without the intention of teaching it to others is considered a Torah that is not of chesed."
      }
    ],
    "siman": {
      "title": "Meat (Butcher)",
      "paragraph": "The butcher of Bereishis Meats, who used a picture of the שיתין for his logo, sponsored cholent for the bochurim who did acts of chesed because they were greater than tzedakah and he made sure to always teach others what he had learned."
    }
  },
  {
    "daf": 50,
    "data": [
      {
        "id": 0,
        "title": "חבית של זהב שאינה מקודשת",
        "paragraph": "The Mishnah on Daf 48b stated regarding ניסוך המים, כמעשהו בחול כך מעשהו בשבת – Just as it was performed on a weekday so is it performed on Shabbos, except that the Kohen would not draw the water from the מי שילוח on Shabbos itself; rather, on erev Shabbos he would fill a חבית של זהב שאינה מקודשת - an unconsecrated golden barrel, from the Shiloach, and have it in the chamber to be used the next day. The Gemara on 49b asks why an unconsecrated barrel was necessary, and Ze’iri answered קסבר אין שיעור למים – the Tanna of our Mishnah maintains that no maximum amount is prescribed for the water libation וכלי שרת מקדשין שלא מדעת – and furthermore, he maintains that klei shareiss sanctify their contents without intention. If one brought the water in a kli shareiss on erev Shabbos, it would become passul through לינה – by remaining overnight. Chizkiyah said that klei shareiss do not sanctify except with specific intent, so there is no concern of actual לינה, however they were gozeir that it should be placed in an unconsecrated vessel lest onlookers see the water in a kli shareiss and assume it was sanctified with intent. Rebbe Yannai in the name of Rebbe Zeira provides a third answer."
      },
      {
        "id": 1,
        "title": "2.החליל אינו דוחה לא את השבת ואת לא את יום טוב",
        "paragraph": "The opening Mishnah of the fifth perek states that the חליל, the flute-playing that accompanied the שמחת בית השואבה, was not docheh Shabbos or Yom Tov. It was taught in a Baraisa: החליל דוחה את השבת דברי רבי יוסי בר יהודה – Rebbe Yose bar Yehudah holds that the flute-playing is docheh Shabbos, and the Chochomim say: אף יום טוב אינו דוחה – it is not even docheh Yom Tov. Rav Yosef said that the machlokes was stated only in reference to the שיר של קרבן – the flute playing that accompanied the wine libations of the morning and afternoon tamid on the twelve days that Hallel was recited. Rebbe Yose holds עיקר שירה בכלי – the essential shirah is with instruments, ועבודה היא – and therefore, it is deemed an avodah and is docheh Shabbos. Whereas the Rabbanon hold עיקר שירה בפה – the essential shirah is vocal, and the instrumental accompaniment is not an avodah and so is not docheh Shabbos. אבל שיר של שואבה דברי הכל שמחה היא ואינה דוחה את השבת – but the playing of instruments that accompanied the שמחת בית השואבה, everybody agrees that it is merely to enhance the rejoicing, and is not a true avodah, and therefore, is not docheh Shabbos."
      },
      {
        "id": 2,
        "title": "מחלוקת בכלי שרת שעשאן של עץ",
        "paragraph": "It was taught in a Baraisa כלי שרת שעשאן של עץ רבי פוסל ורבי יוסי בר יהודה מכשיר – Regarding the suitability of klei shareis that were fashioned from wood, Rebbe is possel them and Rebbe Yose bar Yehudah is machshir them. After Rav Yosef’s understanding of the machlokes is rejected, the Gemara suggests that perhaps all agree דעיקר שירה בכלי – that the essential shirah is with instruments, and that the אבובא דמשה – Moshe’s flute, which was made from wood, was in fact, a kli shareis. And what they are disputing here is whether דנין אפשר משאי אפשר –we can derive a possibility from an impossibility. Do we derive the suitability of wood for other service vessels, where metal would serve as well, from the case of Moshe’s flute, where metal would not have served as well, since a metal flute would not have sounded so sweet? Or perhaps, since the flute had to be made of reed, no proof can be brought for the other service vessels. Rebbe Yose bar Yehudah, who is machshir wooden vessels, holds דנין אפשר משאי אפשר, whereas Rebbe, who is possel them, holds לא דנין אפשר משאי אפשר. The Gemara brings an alternative pshat in the machlokes."
      }
    ],
    "siman": {
      "title": "Nincompoop (Silly, foolish person)",
      "paragraph": "The nincompoop who bumped into a golden barrel of unconsecrated water and dropped his flute into it as a choir sang, pulled out an ancient wooden one from his pocket and continued on his way."
    }
  },
  {
    "daf": 51,
    "data": [
      {
        "id": 0,
        "title": "The sources for עיקר שירה בכלי ועיקר שירה בפה",
        "paragraph": "The Gemara asks what is the reason for the one who says that עיקר שירה בכלי – that the essential sacrificial song is with instrumental accompaniment? For it is written: And Chizkiyahu directed that the olah be offered on the mizbayach. And as the service of the olah began, החל שיר ה' והחצצרות ועל ידי כלי דויד מלך ישראל – the song of Hashem began, and the blowing of the trumpets, and with the instruments of Dovid, Melech Yisroel. Since the passuk mentions the instruments as part of the שיר ה', it implies that they form part of the עיקר שירה. What is the reason of the one who says that עיקר שירה בפה – that the essential song is purely vocal? For it is written: \"ויהי כאחד למחצצרים ולמשררים להשמיע קול אחד\" – “There was unison among the trumpeters, and songsters; producing music as with one voice…” No mention is made here of instrumentalists, implying that their role was not essential. Rashi explains that although the חצוצרות were sounded, it was for the purpose of fulfilling the chiyuv that the tamid and mussaf be accompanied by the blowing of the trumpets, but they were not part of the שירה. The Gemara goes on to explain how each opinion understands the other opinion’s source."
      },
      {
        "id": 1,
        "title": "מי שלא ראה שמחת בית השואבה, ירושלים בתפארתה ובית המקדש בבנינו",
        "paragraph": "The next Mishnah provides a lengthy description of the שמחת בית השואבה. It was taught in a Baraisa: מי שלא ראה שמחת בית השואבה לא ראה שמחה מימיו – Whoever did not see the celebration of the שמחת בית השואבה, never saw rejoicing in all his days. מי שלא ראה ירושלים בתפארתה לא ראה כרך נחמד מעולם – Whoever did not see Yerushalayim in its splendor, never saw a delightful city in his life. מי שלא ראה בית המקדש בבנינו לא ראה בנין מפואר מעולם – Whoever did not see the Beis Hamikdash when it stood, never saw a magnificent structure in his life. Abaye said, and some say it was Rav Chisda who said it, זה בנין הורדוס – it refers to the one built by Herod. Rava said he built it with stones of green and white marble. Others say it was with stones of green, blue, and white marble. One row of stones protruded, and the other row was recessed in order to provide space for cement. Herod thought to cover the entire Temple with gold plating, but the Rabbanon told him to leave it as it is, for this way is more becoming, דמיתחזי כאדותא דימא – since the swirling coloration of the marble appears like the waves of the sea. Rashi explains that the shifting colors of the marble made it appear as if the walls were undulating, like waves."
      },
      {
        "id": 2,
        "title": "מי שלא ראה דיופלוסטון של אלכסנדריא של מצרים",
        "paragraph": "It was taught in a Baraisa: Rebbe Yehudah said: Whoever did not see the דיופלוסטון of Alexandria in Egypt לא ראה בכבודן של ישראל – never saw the glory of Yisroel. It was like a large basilica, with a row of benches inside a row of benches. On occasion there were double the amount of people that left Mitzrayim in attendance. There were seventy-one chairs of gold in it, corresponding to the members of the Great Sanhedrin, and a wooden platform in its center upon which the חזן הכנסת, the shul gabbai, would stand with a flag in his hand. When it came time to answer amen, he would wave the flag as a signal and all the people would answer. The people did not sit mixed, rather the goldsmiths sat separately, and the silversmiths sat separately, and the blacksmiths sat separately, etc. When a poor man came in there, he would readily recognize the section reserved for his fellow craftsmen and would turn there for employment, and from there obtain employment for himself and his family. The Gemara goes on to tell of the end of the community, when Alexander came and slaughtered them."
      }
    ],
    "siman": {
      "title": "Beaver Pelt Hats (Related to beavers “gnawing”)",
      "paragraph": "The Beaver Pelt Hat Society enjoying a concert of vocalists with no instrumentation and fascinated by the stage walls that seemed to undulate like waves, sat in a section of the massive auditorium where poor beaver pelt hat wearers could find them."
    }
  },
  {
    "daf": 52,
    "data": [
      {
        "id": 0,
        "title": "The source that permits building the תיקון גדול – the balcony in the Ezras Nashim",
        "paragraph": "Rav brought the following passuk from Zechariyah’s vision of the war of Gog and Magog and the mournful eulogies over the death of Moshiach ben Yosef, to teach that it was permissible to make the תיקון גדול, the balcony for the women in the Ezras Nashim, so that they should not mingle with the men at the שמחת בית השואבה. \"וספדה הארץ משפחות משפחות לבד משפחת בית דויד לבד ונשיהם לבד\" – The land will eulogize each family by itself; the family of the house of Dovid by itself, and their wives by themselves. It’s a kal v’chomer. If in the future world they will be involved in a hesped, and the yetzer hora has no power over them, as it will be eradicated, yet the Torah said that the men and women should mourn separately, then all the more so at the שמחת בית השואבה, when they are involved in simchah, and the yetzer hora has power over them, all the more so, they should be separated."
      },
      {
        "id": 1,
        "title": "Why there is a hesped over the yetzer hora",
        "paragraph": "There is a machlokes Rebbe Dosa and the Rabbanon regarding the nature of the hesped mentioned above. One said that it was over Moshiach ben Yosef who will have been killed in battle, and one said it will be for the yetzer hora which will have been eradicated. The Gemara asks why does the eradication of the yetzer hora warrant weeping, and answers that Rebbe Yehudah expounded, that in the future, HaKadosh Boruch Hu will bring the yetzer hora and shecht it in the presence of the tzadikim and the resha’im. צדיקים נדמה להם כהר גבוה – To the tzadikim, the yetzer hora will appear like a high mountain that can hardly be scaled, ורשעים נדמה להם כחוט השערה – and to the resha’im, it will appear like a strand of hair that can easily be snapped. הללו בוכין והללו בוכין – They will both cry. The tzadikim will weep and say: “How were we able to overcome such a high mountain?” And the resha’im will weep and say: \"How were we not able to overcome this strand of hair?” Rebbe Assi said: יצר הרע בתחילה דומה לחוט של בוכיא ולבסוף דומה כעבותות העגלה – Regarding the yetzer hora: Initially it resembles a spider’s thread, and ultimately it resembles a cart rope. Rashi explains that the first time a person is tempted to sin, it is not difficult to resist the temptation. Once the person becomes accustomed to it, however, it becomes very difficult to resist."
      },
      {
        "id": 2,
        "title": "The yetzer hora has seven names, and seeks to overpower a person every day",
        "paragraph": "Rav Avira expounded, and others say it was Rebbe Yehoshua ben Levi: שבעה שמות יש לו ליצר הרע – The yetzer hora has seven names. Hakadosh Boruch Hu called it רע. Moshe called it ערל. Dovid called it טמא. Shlomo called it שונא – the enemy. Yishaya called it מכשול – a stumbling block. Yechezkel called it אבן – a stone. Yoel called it צפוני – the hidden one. The Gemara relates that Abaye watched a man and woman set out on a journey together and when they reached a crossroads, they took leave of one another. Abaye said to himself that had it been him in the situation he would have been unable to restrain himself from sin. Abaye became despondent until a certain old man, (Eliyahu Hanavi ) taught him: כל הגדול מחבירו יצרו גדול הימנו – Whoever is greater than his fellow, his yetzer hora is greater than his fellow’s as well. Rebbe Shimon ben Lakish said: יצרו של אדם מתגבר עליו בכל יום ומבקש להמיתו – A man’s yetzer hora threatens every day to overpower him, and seeks to kill him, ואלמלא הקדוש ברוך הוא שעוזר לו אינו יכול לו – And if not for Hakadosh, Boruch Hu, Who aids him, he would be unable to withstand it."
      }
    ],
    "siman": {
      "title": "Newbie to Yiddishkeit",
      "paragraph": "The female newbies to Yiddishkeit who sat up in the balcony away from the men to hear a shiur about the yetzer hora, were shown pictures of mountains and strands of hair, and taught the different meanings of its seven names."
    }
  },
  {
    "daf": 53,
    "data": [
      {
        "id": 0,
        "title": "A person’s feet are his guarantors",
        "paragraph": "Rebbe Yochanan said: רגלוהי דבר איניש אינון ערבין ביה – A person’s feet are his guarantors; לאתר דמיתבעי תמן מובילין יתיה – to where he is summoned, there they lead him. Rashi explains that when one's time comes, they bring him to the place where he is meant to die. The Gemara brings an incident that illustrates this principle. One day Shlomo Hamelech saw that the Malach Hamaves was sad and asked him why. The Malach Hamaves answered that he is being demanded of to take two of Shlomo Hamelech’s scribes, who sit there in the court, and he has been unable to. When Shlomo Hamelech heard this, he tried to help his scribes escape by handing them over to demons, and he sent them to the town of Luz, a city where the Malach Hamaves has no rule. But when they reached the gates of the town, the Malach Hamaves was waiting for them, and they died before entering the city. The next day Shlomo Hamelech saw that the Malach Hamaves was happy and asked him why. He answered that Shlomo Hamelech sent them to the very place that they were demanded of him to take away their lives. Immediately Shlomo Hamelech said: \"A person’s feet are his guarantors; to where he is summoned, they lead him\"."
      },
      {
        "id": 1,
        "title": "Not sleeping due to the simchah of the שמחת בית השואבה",
        "paragraph": "It was taught in a Baraisa: Rebbe Yehoshua ben Chananya said: כשהיינו שמחים שמחת בית השואבה לא ראינו שינה בעינינו – When we would rejoice at the שמחת בית השאובה, our eyes would see no sleep for all of Succos. How so? The first hour of the day was the tamid shel shachar. From there we proceeded to tefillah, then to the mussaf, then to the tefillah for mussaf, then to the Beis Hamidrash to learn. From there we went to a seudah, and then to Minchah, and then to the tamid shel bein ha’arbaim, מכאן ואילך לשמחת בית השואבה – and from then on, the rest of the night, we devoted ourselves the שמחת בית השואבה, until the next morning when the cycle would begin again. When the Gemara brings a proof that people cannot stay awake for even three days, the Gemara answers that Rebbe Yehoshua meant לא טעמנו טעם שינה – We did not enjoy a proper sleep, for they would only doze on each other’s shoulders."
      },
      {
        "id": 2,
        "title": "The source for the fifteen Shir Hama’alos",
        "paragraph": "The Mishnah on Daf 51b stated that during the Simchas Beis Hasho’eva, the Leviim with their countless number of instruments, stood on the fifteen steps that led down from the Ezras Yisroel to the Ezras Nashim כנגד חמש עשרה שיר המעלות שבתהילים – which correspond to fifteen Songs of Ascent found in Tehillim. On our Daf, Rav Chisda asked a Rabbi who would explain Aggadata to him, for the source of these fifteen Shir Hama’alos, and the Rabbi related that when Dovid excavated the pits beneath the mizbayach, the waters of the deep came up and threatened to flood the world. Dovid asked if anyone knew if it was permitted to write the Divine Name on a shard and cast into the deep so that the waters will calm down. Eventually, Achitophel, Dovid’s mentor, made a kal v’chomer and reasoned that if the Divine Name is permitted to be erased to bring shalom between a man and his wife in the case of a sotah, all the more so it would be permitted to do so to bring peace for the whole world. He permitted Dovid to do so and the deep subsided sixteen thousand amos. When Dovid saw that the water had subsided to such a great extent, he said that the higher the water, the moister and more fertile the earth will be. He recited the fifteen Shir Hama’alos and brought the water back up fifteen thousand amos, until they were only one thousand amos below the earth’s surface."
      }
    ],
    "siman": {
      "title": "Nigerian Prince",
      "paragraph": "The Nigerian Prince, who was mourning the loss of his two scribes, overheard non-stop rejoicing in a shul that lasted for seven days straight, featuring a massive orchestra that played on fifteen steps."
    }
  },
  {
    "daf": 54,
    "data": [
      {
        "id": 0,
        "title": "Three blasts on the tenth step or by the side of the mizbayach",
        "paragraph": "The Gemara points out that the Mishnah on Daf 53b that listed the forty-eight blasts that took place erev Shabbos during the chag, mentions three blasts that took place by the mizbayach and does not mention the three blasts that were sounded when the trumpeters reached the tenth step, which was described in the previous Mishnah on Daf 51b . The Gemara answers that our Mishnah is the opinion of Rebbe Eliezer ben Yaakov, and the previous Mishnah is that of the Rabbanon. Rebbe Eliezer holds כיון דתקע לפתיחת שערים למעלה עשירית למה לי דתקע – once they had blown for the opening of the gates, why blow at the tenth step. האי לאו שער הוא – That is not a gate, and therefore not an appropriate location for blowing. Therefore, על גבי המזבח עדיף – sounding the three blasts at the mizbayach is preferable. The Rabbanon hold כיון דתקע למילוי המים על גבי מזבח למה לי – since one blows to mark the Water Drawing, why blow at the side of the mizbayach? Therefore, it is preferable to sound the three blasts at the tenth step. Rashi explains that doing it at the tenth step is associated to the Water Drawing."
      },
      {
        "id": 1,
        "title": "שתוקעין בכל מוסף ומוסף",
        "paragraph": "The Mishnah had stated regarding the blowing of חצצרות, that ובמוספין עוד תשע – there were another nine blows for the mussafim. When Rebbe Acha bar Chanina arrived from the South, he brought the following Baraisa with him: The passuk states: \"ובני אהרן הכהנים יתקעו בחצצרות\" – And the sons of Aharon, the Kohanim, they shall blow the trumpets. Now the expression “shall blow” did not need to be stated since it has already been stated in the same passuk: \"ותקעתם בחחצרות על עלתיכם ועל זבחי שלמיכם\" – And you shall blow the trumpets over your olos and shelamim. What does the passuk teach by stating “you shall blow”? הכל לפי המוספין תוקעין – It teaches that we blow according to the mussafim. Rebbe Acha bar Chanina explained the Baraisa as follows: לומר שתוקעין על כל מוסף ומוסף – It teaches that we blow a separate set of trumpet blasts for each and every mussaf. The Gemara will bring several challenges to this ruling, attempting to show that on certain days it would result in more than the forty-eight maximum soundings of the חצצרות mentioned in the Mishnah."
      },
      {
        "id": 2,
        "title": "Adjusting the calendar so Yom Kippur will not fall on a Sunday",
        "paragraph": "When the Gemara challenges the maximum limit of forty-eight trumpet blasts from the case of erev Pesach that fell on Shabbos, which would result in more, it answers that the Mishnah only mentions cases that occur every year. The Gemara objects to this answer since the case of forty-eight blasts that our Mishnah mentions is when erev Shabbos falls during Succos. Sometimes it does not occur, such as when the first day of Succos falls on erev Shabbos! The Gemara answers that when the first day of Succos is scheduled to fall on erev Shabbos מדחי דחינן ליה  - we postpone it one day, until Shabbos. Why is it postponed? Since if the first day of Succos falls out on erev Shabbos, then Yom Kippur would have been on the previous Sunday. In order to prevent that from happening, we add a day to Elul in order to postpone it one day. Rashi explains that it is not desirable for Yom Kippur to follow Shabbos, since anyone dying on Shabbos would remain unburied for two days until after Yom Kippur. Furthermore, any vegetables that one prepares to eat after Yom Kippur will have to be picked two days earlier, on Friday, and will wilt by the time they are needed. The Gemara will bring the opinion of others, who do not hold of adjusting the calendar to prevent Yom Kippur from falling on a Sunday."
      }
    ],
    "siman": {
      "title": "Noodles",
      "paragraph": "The noodle loving king, who required his subjects to blow trumpets three times on the 10th step up when they offered him noodles and then blow nine times again for each additional offering, changed the Fast-day schedule so he would never have to abstain from noodles on a Sunday."
    }
  },
  {
    "daf": 55,
    "data": [
      {
        "id": 0,
        "title": "The trumpet blasts were lengthened, or the number of trumpeters increased for mussafim",
        "paragraph": "On Daf 54a, Rebbe Acha bar Chanina taught that a separate set of trumpet blasts are blown for each mussaf offering. After the Gemara successfully refutes his ruling, on our Daf it asks how to understand the Baraisa and passuk that Rebbe Acha bar Chanina brought as a source for his teaching. Ravina said: לומר שמאריכין בתקיעות – The Baraisa and the passuk mean only that the blasts are lengthened, not that they are repeated. Rashi explains that when there is more than one mussaf, the sounding of the trumpets and the song that accompanied them, which took place as the wine libations of these offerings were being poured, were drawn out until both libations had been poured. The Rabbanan of Caesaria said in the name of Rebbe Acha: לומר שמרבה בתוקעין – The Baraisa means to say that where there is more than one mussaf, we increase the number of trumpeters, but not the number of trumpet blasts. Rashi explains that there is no upper limit for the number of trumpeters."
      },
      {
        "id": 1,
        "title": "The seventy bulls correspond to the seventy nations",
        "paragraph": "The next Mishnah teaches how the twenty-four משמרות divided the bringing of the numerous offerings over Succos, given that a different number from the seventy bulls was offered daily. The Gemara brings Rebbe Elazar, who said: הני שבעים פרים כנגד מי – To what do the seventy bulls correspond, and answers כנגד שבעים אומות – They correspond to the seventy nations. Rashi explains that they provide kaparah for the seventy nations of the world, in order that rain may fall throughout the world, and it is on Succos that the world is judged regarding rainfall. The Gemara continues and asks why the single bull of Shemini Atzeres is brought and answers, כנגד אומה יחידה – It corresponds to the singular nation of Yisroel. This can be compared to a king of flesh and blood who said to his servants to prepare for him a big banquet. When the final day of the banquet came אמר לאוהבו – he said to his beloved companion, עשה לי סעודה קטנה כדי שאהנה ממך – “Prepare for me a small meal so that I may enjoy your company.” Rashi explains that is as if to say that I derive pleasure from your company alone. Rebbe Yochanan said: אוי להם לעובדי כוכבים שאבדו ואין יודעין שאבדו – Woe to the idolaters, who have lost something precious and do not know what they lost. For as long as the Temple stood, the mizbayach atoned for them, but now that it is gone, מי מכפר עליהן – who will atone for them?"
      },
      {
        "id": 2,
        "title": "The source that all mishmaros share equally in the emurim of the regalim",
        "paragraph": "The next Mishnah states בשלשה פרקים בשנה היו כל משמרות שוות באימורי הרגלים ובחילוק לחם הפנים – During three periods of the year, referring to the regalim, all twenty-four mishmaros were equal in the sharing of the emurim of the regalim and in the division of the lechem hapanim. It was taught in a Baraisa, from where is it known that all of the twenty-four mishmaros were equal in the sharing of the emurim of the regalim? For the Torah states: \"ובא בכל אות נפשו...ושרת\" – and he comes with all the desire of his soul…and he shall serve. This teaches that a Kohen may offer korbanos even if it is not the week of his watch. To dispel the notion that this is even on other days of the year other than the regalim, the Torah states: \"מאחד שעריך\" – from one of your cities. לא אמרתי אלא בשעה שכל ישראל נכנסין בשער אחד – I have only said that all mishmaros are equal, when they enter one gate , which is at the time of the regalim. During all other times, only Kohanim of that week’s watch are entitled to offer the korbanos."
      }
    ],
    "siman": {
      "title": "Speed Limit Sign of 55",
      "paragraph": "The proud crossing guard holding the speed limit sign who would blow one long note on his whistle until all of the additional animals crossed the road, gave up when he saw seventy bulls head toward him, guided by twenty-four ranchers who liked to share meat equally on their holidays."
    }
  },
  {
    "daf": 56,
    "data": [
      {
        "id": 0,
        "title": "Which takes precedence, the berachah on the succah or the shehechiyanu?",
        "paragraph": "The Gemara brings a machlokes Amoraim concerning the order of berachos that one recites when he enters the succah the first night of Succos. Rav said: סוכה ואחר כך זמן – When one recites kiddush, he first recites לישב בסוכה and then שהחיינו, and Rabbah bar bar Chanah said: זמן ואחר כך סוכה – One recites שהחיינו and then לישב בסוכה. The Gemara explains that Rav says that one first recites a לישב בסוכה because he holds חיובא דיומא עדיף – the obligation of the day takes precedence. Meaning, that the berachah of לישב בסוכה relates specifically to the obligation of Succos. Rabbah bar bar Chanah said that one recites a שהחיינו first because he holds תדיר ושאינו תדיר תדיר קודם – when that which is frequent conflicts with that which is not frequent, that which is frequent takes precedence. The Gemara attempts to connect this machlokes to the machlokes between Beis Shammai and Beis Hillel regarding which comes first when reciting kiddush on Shabbos, the berachah on the wine or the berachah on the day but concludes that they are not necessarily the same machlokes."
      },
      {
        "id": 1,
        "title": "The division of the lechem hapanim",
        "paragraph": "The  final Mishnah of the Masectha brings a machlokes regarding the division of the lechem hapanim the rest of the year. The Tanna Kamma holds that the incoming mishmar and the outgoing mishmar split the lechem hapanim equally, with each mishmar receiving six loaves. Rebbe Yehudah holds that the incoming mishmar receives seven loaves and the outgoing mishmar receives five loaves. The Gemara asks what the reason is according to Rebbe Yehudah, that the incoming mishmar receives seven, and Rebbe Yitzchak answers, בשכר הגפת דלתות – the two loaves are granted as compensation for closing the Temple gates in the evening. Meaning, that those who opened the gates in the morning should have had the duty to complete the job and close them at night. Since the incoming mishmar is doing the work of the outgoing mishmar, it behooves the outgoing mishmar to give one of their loaves in payment. When the Gemara suggests that the outgoing mishmar should tell the incoming mishmar to remove the enactment, so that the following week it will be removed from them, Abaye answered: בוצינא טבא מקרא – A small gourd now is better than a large gourd later. In this case, the incoming mishmar prefers to receive all that it is entitled to immediately than to defer some of it to later."
      },
      {
        "id": 2,
        "title": "Punishing the Mishmar of Bilgah",
        "paragraph": "The Mishnah stated that the mishmar of Bilgah was penalized, in that it always divided the lechem hapanim in the south, its specific ring that was used to shecht a korban during its watch was sealed so they had to use another mishmar’s ring, וחלונה סתומה – and its specific alcove to deposit its knives was sealed. The Gemara explains that the reason for the penalties, was either due to an incident involving Miriam bas Bilgah, a daughter of one of its members who became an apostate, or it was because the mishmar was tardy in coming to the Beis Hamikdash when it was their week to serve. The Gemara asks on the first answer, if it is fair that the entire family be penalized over one daughter’s actions. Abaye answers that it is, as people say, שותא דינוקא בשוקא או דאבוה או דאימיה – The utterances of a child in public, express the views of either his father or mother. When the Gemara persists and asks why the whole mishmar should be penalized, Abaye answers אוי לרשע אוי לשכנו – Woe to the wicked one and woe to his neighbor. The Gemara concludes, conversely, טוב לצדיק טוב לשכנו – It will be  good for the tzadik and good for his neighbor."
      }
    ],
    "siman": {
      "title": "The shusher in shul going “nu-nu”",
      "paragraph": "The shusher in the succah who shushed everyone down so they could hear the לישב בסוכה before the שהחיינו and insisted on getting one extra roll for closing the succah door, was horrified when his little son told all the guests that people should stand in the presence of a shusher."
    }
  }
]